[
    {
        "id": 810,
        "name": "Grookey",
        "isNfe": true,
        "types": [
            "grass"
        ],
        "desc": "Grookey is a Grass-type Pokemon with the ability Overgrow. It excels against Water and Ground-types but is vulnerable to Fire-type moves."
    },
    {
        "id": 811,
        "name": "Thwackey",
        "isNfe": true,
        "types": [
            "grass"
        ],
        "desc": "Thwackey, a Grass-type Pokemon, evolves from Grookey. It possesses the Overgrow ability and is strong against Water and Ground-types but weak against Fire-type moves."
    },
    {
        "id": 812,
        "name": "Rillaboom",
        "types": [
            "grass"
        ],
        "forms": [
            {
                "name": "Rillaboom",
                "types": [
                    "grass"
                ]
            },
            {
                "name": "Rillaboom Gigantamax",
                "types": [
                    "grass"
                ],
                "spriteSuffix": "gigantamax",
                "isGigantamax": true
            }
        ],
        "desc": "Rillaboom, the final evolution of Grookey, is a Grass-type Pokemon with the Overgrow ability. It has an advantage over Water and Ground-types but is weak to Fire-type attacks."
    },
    {
        "id": 813,
        "name": "Scorbunny",
        "isNfe": true,
        "types": [
            "fire"
        ],
        "desc": "Scorbunny is a Fire-type Pokemon with the Blaze ability. It's strong against Grass-types but vulnerable to Water-type moves."
    },
    {
        "id": 814,
        "name": "Raboot",
        "isNfe": true,
        "types": [
            "fire"
        ],
        "desc": "Raboot, a Fire-type Pokemon, is the evolution of Scorbunny and has the Blaze ability. It excels against Grass-types but struggles against Water-type attacks."
    },
    {
        "id": 815,
        "name": "Cinderace",
        "types": [
            "fire"
        ],
        "forms": [
            {
                "name": "Cinderace",
                "types": [
                    "fire"
                ]
            },
            {
                "name": "Cinderace Gigantamax",
                "types": [
                    "fire"
                ],
                "spriteSuffix": "gigantamax",
                "isGigantamax": true
            }
        ],
        "desc": "Cinderace, the final form of Scorbunny, is a Fire-type Pokemon with the Blaze ability. It excels against Grass-types but must be cautious of Water-type moves."
    },
    {
        "id": 816,
        "name": "Sobble",
        "isNfe": true,
        "types": [
            "water"
        ],
        "desc": "Sobble is a Water-type Pokemon with the Torrent ability. It's strong against Fire-types but is weak to Grass-type attacks."
    },
    {
        "id": 817,
        "name": "Drizzile",
        "isNfe": true,
        "types": [
            "water"
        ],
        "desc": "Drizzile, the evolution of Sobble, is a Water-type Pokemon with the Torrent ability. It excels against Fire-types but faces weaknesses against Grass-type moves."
    },
    {
        "id": 818,
        "name": "Inteleon",
        "types": [
            "water"
        ],
        "desc": "Inteleon, the final evolution of Sobble, is a Water-type Pokemon with the Torrent ability. It's strong against Fire-types but should be careful of Grass-type attacks."
    },
    {
        "id": 824,
        "name": "Blipbug",
        "isNfe": true,
        "types": [
            "bug"
        ],
        "desc": "Blipbug is a Bug-type Pokemon that can evolve into Dottler. It's strong against Grass and Psychic-types but weak to Fire, Flying, and Rock-type moves."
    },
    {
        "id": 825,
        "name": "Dottler",
        "isNfe": true,
        "types": [
            "bug",
            "psychic"
        ],
        "desc": "Dottler is a dual-type Bug and Psychic Pokemon. It's strong against Grass and Psychic-types but has vulnerabilities to Dark, Fire, Ghost, and Flying-type moves."
    },
    {
        "id": 826,
        "name": "Orbeetle",
        "types": [
            "bug",
            "psychic"
        ],
        "forms": [
            {
                "name": "Orbeetle",
                "types": [
                    "bug",
                    "psychic"
                ]
            },
            {
                "name": "Orbeetle Gigantamax",
                "types": [
                    "bug",
                    "psychic"
                ],
                "spriteSuffix": "gigantamax",
                "isGigantamax": true
            }
        ],
        "desc": "Orbeetle, a dual-type Bug and Psychic Pokemon, has the ability Frisk. It excels against Grass and Psychic-types but is vulnerable to Dark, Fire, Ghost, and Flying-type moves."
    },
    {
        "id": 10,
        "name": "Caterpie",
        "isNfe": true,
        "types": [
            "bug"
        ],
        "desc": "Caterpie is a Bug-type Pokemon that evolves into Metapod and later into Butterfree. It's weak to Fire, Flying, and Rock-type moves."
    },
    {
        "id": 11,
        "name": "Metapod",
        "isNfe": true,
        "types": [
            "bug"
        ],
        "desc": "Metapod is a Bug-type Pokemon that evolves from Caterpie and later into Butterfree. It's weak to Fire, Flying, and Rock-type moves."
    },
    {
        "id": 12,
        "name": "Butterfree",
        "types": [
            "bug",
            "flying"
        ],
        "forms": [
            {
                "name": "Butterfree",
                "types": [
                    "bug",
                    "flying"
                ]
            },
            {
                "name": "Butterfree Gigantamax",
                "types": [
                    "bug",
                    "flying"
                ],
                "spriteSuffix": "gigantamax",
                "isGigantamax": true
            }
        ],
        "desc": "Butterfree, a dual-type Bug and Flying Pokemon, has the ability Compound Eyes. It's strong against Grass, Bug, and Fighting-types but is weak to Electric, Fire, Flying, Ice, and Rock-type moves."
    },
    {
        "id": 736,
        "name": "Grubbin",
        "isNfe": true,
        "types": [
            "bug"
        ],
        "desc": "Grubbin is a Bug-type Pokemon that evolves into Charjabug. It's strong against Grass, Psychic, and Dark-types but weak to Fire, Flying, and Rock-type moves."
    },
    {
        "id": 737,
        "name": "Charjabug",
        "isNfe": true,
        "types": [
            "bug",
            "electric"
        ],
        "desc": "Charjabug is a dual-type Bug and Electric Pokemon that evolves from Grubbin and can further evolve into Vikavolt. It's strong against Grass, Electric, and Psychic-types but weak to Fire and Rock-type moves."
    },
    {
        "id": 738,
        "name": "Vikavolt",
        "types": [
            "bug",
            "electric"
        ],
        "desc": "Vikavolt is a dual-type Bug and Electric Pokemon that evolves from Charjabug. It's strong against Grass, Electric, and Psychic-types but vulnerable to Rock and Fire-type moves."
    },
    {
        "id": 163,
        "name": "Hoothoot",
        "isNfe": true,
        "types": [
            "normal",
            "flying"
        ],
        "desc": "Hoothoot is a dual-type Normal and Flying Pokemon with the ability Insomnia. It's strong against Grass and Bug-types but weak to Electric and Ice-type moves."
    },
    {
        "id": 164,
        "name": "Noctowl",
        "types": [
            "normal",
            "flying"
        ],
        "desc": "Noctowl, a dual-type Normal and Flying Pokemon, has the abilities Insomnia and Tinted Lens. It's strong against Grass and Bug-types but vulnerable to Electric, Ice, and Rock-type moves."
    },
    {
        "id": 821,
        "name": "Rookidee",
        "isNfe": true,
        "types": [
            "flying"
        ],
        "desc": "Rookidee is a Flying-type Pokemon with the abilities Keen Eye and Unnerve. It's strong against Grass and Bug-types but weak to Electric, Ice, and Rock-type moves."
    },
    {
        "id": 822,
        "name": "Corvisquire",
        "isNfe": true,
        "types": [
            "flying"
        ],
        "desc": "Corvisquire is a Flying-type Pokemon that evolves from Rookidee. It has the abilities Keen Eye and Unnerve. It excels against Grass and Bug-types but is weak to Electric, Ice, and Rock-type moves."
    },
    {
        "id": 823,
        "name": "Corviknight",
        "types": [
            "flying",
            "steel"
        ],
        "forms": [
            {
                "name": "Corviknight",
                "types": [
                    "flying",
                    "steel"
                ]
            },
            {
                "name": "Corviknight Gigantamax",
                "types": [
                    "flying",
                    "steel"
                ],
                "spriteSuffix": "gigantamax",
                "isGigantamax": true
            }
        ],
        "desc": "Corviknight, a dual-type Flying and Steel Pokemon, has the abilities Pressure and Unnerve. It's strong against Grass, Bug, Fairy, Ice, Normal, and Psychic-types but weak to Electric, Fire, and Rock-type moves."
    },
    {
        "id": 819,
        "name": "Skwovet",
        "isNfe": true,
        "types": [
            "normal"
        ],
        "desc": "Skwovet is a Normal-type Pokemon with the abilities Cheek Pouch and Gluttony. It's strong against Ghost-types but weak to Fighting-types."
    },
    {
        "id": 820,
        "name": "Greedent",
        "types": [
            "normal"
        ],
        "desc": "Greedent, the evolution of Skwovet, is a Normal-type Pokemon with the abilities Cheek Pouch and Gluttony. It's strong against Ghost-types but vulnerable to Fighting-types."
    },
    {
        "id": 519,
        "name": "Pidove",
        "isNfe": true,
        "types": [
            "normal",
            "flying"
        ],
        "desc": "Pidove is a dual-type Normal and Flying Pokemon with the abilities Big Pecks and Super Luck. It's strong against Grass and Bug-types but weak to Electric and Ice-type moves."
    },
    {
        "id": 520,
        "name": "Tranquill",
        "isNfe": true,
        "types": [
            "normal",
            "flying"
        ],
        "desc": "Tranquill is a dual-type Normal and Flying Pokemon that evolves from Pidove. It has the abilities Big Pecks and Super Luck. It excels against Grass and Bug-types but is weak to Electric and Ice-type moves."
    },
    {
        "id": 521,
        "name": "Unfezant",
        "types": [
            "normal",
            "flying"
        ],
        "desc": "Unfezant, the final evolution of Pidove, is a dual-type Normal and Flying Pokemon with the abilities Big Pecks and Super Luck. It's strong against Grass and Bug-types but vulnerable to Electric and Ice-type moves."
    },
    {
        "id": 827,
        "name": "Nickit",
        "isNfe": true,
        "types": [
            "dark"
        ],
        "desc": "Nickit is a Dark-type Pokemon with the abilities Run Away and Unburden. It's strong against Ghost and Psychic-types but weak to Fighting and Bug-type moves."
    },
    {
        "id": 828,
        "name": "Thievul",
        "types": [
            "dark"
        ],
        "desc": "Thievul is a Dark-type Pokemon with the abilities Unburden and Run Away. It excels against Ghost and Psychic-types but is weak to Fighting and Bug-type moves."
    },
    {
        "id": 263,
        "name": "Zigzagoon",
        "isNfe": true,
        "types": [
            "normal"
        ],
        "forms": [
            {
                "name": "Zigzagoon",
                "isNfe": true,
                "types": [
                    "normal"
                ]
            },
            {
                "name": "Zigzagoon Galar",
                "isNfe": true,
                "types": [
                    "dark",
                    "normal"
                ],
                "spriteSuffix": "galar"
            }
        ],
        "desc": "Zigzagoon is a Normal-type Pokemon that evolves into Linoone or Galarian Zigzagoon, which is a dual-type Dark and Normal Pokemon. Zigzagoon is strong against Ghost-types but weak to Fighting-types, while Galarian Zigzagoon shares these strengths and weaknesses."
    },
    {
        "id": 264,
        "name": "Linoone",
        "types": [
            "normal"
        ],
        "forms": [
            {
                "name": "Linoone",
                "types": [
                    "normal"
                ]
            },
            {
                "name": "Linoone Galar",
                "isNfe": true,
                "types": [
                    "dark",
                    "normal"
                ],
                "spriteSuffix": "galar"
            }
        ],
        "desc": "Linoone is a Normal-type Pokemon that evolves from Zigzagoon. It has strengths against Ghost-types but is weak to Fighting-types. Galarian Linoone shares these strengths and weaknesses but is also a dual-type Dark and Normal Pokemon."
    },
    {
        "id": 862,
        "name": "Obstagoon",
        "types": [
            "dark",
            "normal"
        ],
        "desc": "Obstagoon is a dual-type Dark and Normal Pokemon with the abilities Reckless and Guts. It excels against Ghost-types but is weak to Fighting and Bug-type moves."
    },
    {
        "id": 831,
        "name": "Wooloo",
        "isNfe": true,
        "types": [
            "normal"
        ],
        "desc": "Wooloo is a Normal-type Pokemon with the abilities Fluffy and Run Away. It's strong against Ghost-types but weak to Fighting-types."
    },
    {
        "id": 832,
        "name": "Dubwool",
        "types": [
            "normal"
        ],
        "desc": "Dubwool, the evolution of Wooloo, is a Normal-type Pokemon with the abilities Fluffy and Steadfast. It's strong against Ghost-types but vulnerable to Fighting-types."
    },
    {
        "id": 270,
        "name": "Lotad",
        "isNfe": true,
        "types": [
            "water",
            "grass"
        ],
        "desc": "Lotad is a dual-type Water and Grass Pokemon with the abilities Swift Swim and Rain Dish. It excels against Ground, Rock, and Water-types but is weak to Electric-types."
    },
    {
        "id": 271,
        "name": "Lombre",
        "isNfe": true,
        "types": [
            "water",
            "grass"
        ],
        "desc": "Lombre, the evolution of Lotad, is a dual-type Water and Grass Pokemon with the abilities Swift Swim and Rain Dish. It's strong against Ground, Rock, and Water-types but has weaknesses to Electric-types."
    },
    {
        "id": 272,
        "name": "Ludicolo",
        "types": [
            "water",
            "grass"
        ],
        "desc": "Ludicolo is a dual-type Water and Grass Pokemon with the abilities Swift Swim and Rain Dish. It excels against Ground, Rock, and Water-types but is weak to Electric-types."
    },
    {
        "id": 273,
        "name": "Seedot",
        "isNfe": true,
        "types": [
            "grass"
        ],
        "desc": "Seedot is a Grass-type Pokemon with the ability Chlorophyll. It's strong against Ground, Rock, and Water-types but vulnerable to Bug, Fire, Flying, Ice, and Poison-type moves."
    },
    {
        "id": 274,
        "name": "Nuzleaf",
        "isNfe": true,
        "types": [
            "grass",
            "dark"
        ],
        "desc": "Nuzleaf, the evolution of Seedot, is a dual-type Grass and Dark Pokemon with the abilities Chlorophyll and Early Bird. It excels against Ground, Rock, and Water-types but is weak to Bug, Fairy, Fighting, Fire, Flying, Ice, and Poison-type moves."
    },
    {
        "id": 275,
        "name": "Shiftry",
        "types": [
            "grass",
            "dark"
        ],
        "desc": "Shiftry is a dual-type Grass and Dark Pokemon with the abilities Chlorophyll and Early Bird. It's strong against Ground, Rock, Water, and Ghost-types but is weak to Bug, Fairy, Fighting, Fire, Flying, Ice, and Poison-type moves."
    },
    {
        "id": 833,
        "name": "Chewtle",
        "isNfe": true,
        "types": [
            "water"
        ],
        "desc": "Chewtle is a Water-type Pokemon with the abilities Strong Jaw and Shell Armor. It excels against Fire, Rock, and Ground-types but is vulnerable to Electric and Grass-type moves."
    },
    {
        "id": 834,
        "name": "Drednaw",
        "types": [
            "water",
            "rock"
        ],
        "forms": [
            {
                "name": "Drednaw",
                "types": [
                    "water",
                    "rock"
                ]
            },
            {
                "name": "Drednaw Gigantamax",
                "types": [
                    "water",
                    "rock"
                ],
                "spriteSuffix": "gigantamax",
                "isGigantamax": true
            }
        ],
        "desc": "Drednaw is a dual-type Water and Rock Pokemon with the abilities Strong Jaw and Shell Armor. It's strong against Fire, Rock, and Ground-types but weak to Electric, Fighting, Grass, and Ground-type moves."
    },
    {
        "id": 509,
        "name": "Purrloin",
        "isNfe": true,
        "types": [
            "dark"
        ],
        "desc": "Purrloin is a Dark-type Pokemon with the abilities Limber and Unburden. It excels against Ghost and Psychic-types but is vulnerable to Fighting and Bug-type moves."
    },
    {
        "id": 510,
        "name": "Liepard",
        "types": [
            "dark"
        ],
        "desc": "Liepard is a Dark-type Pokemon with the abilities Limber and Unburden. It's strong against Ghost and Psychic-types but weak to Fighting and Bug-type moves."
    },
    {
        "id": 835,
        "name": "Yamper",
        "isNfe": true,
        "types": [
            "electric"
        ],
        "desc": "Yamper is an Electric-type Pokemon with the abilities Ball Fetch and Rattled. It's strong against Water and Flying-types but weak to Ground-type moves."
    },
    {
        "id": 836,
        "name": "Boltund",
        "types": [
            "electric"
        ],
        "desc": "Boltund, the evolution of Yamper, is an Electric-type Pokemon with the abilities Strong Jaw and Competitive. It's strong against Water and Flying-types but vulnerable to Ground-type moves."
    },
    {
        "id": 659,
        "name": "Bunnelby",
        "isNfe": true,
        "types": [
            "normal"
        ],
        "desc": "Bunnelby is a Normal-type Pokemon with the abilities Pickup and Cheek Pouch. It's strong against Ghost-types but weak to Fighting-types."
    },
    {
        "id": 660,
        "name": "Diggersby",
        "types": [
            "normal",
            "ground"
        ],
        "desc": "Diggersby is a dual-type Normal and Ground Pokemon with the abilities Pickup and Cheek Pouch. It excels against Electric, Poison, Rock, and Steel-types but is weak to Fighting, Grass, Ice, and Water-type moves."
    },
    {
        "id": 572,
        "name": "Minccino",
        "isNfe": true,
        "types": [
            "normal"
        ],
        "desc": "Minccino is a Normal-type Pokemon with the abilities Cute Charm and Technician. It's strong against Ghost-types but weak to Fighting-types."
    },
    {
        "id": 573,
        "name": "Cinccino",
        "types": [
            "normal"
        ],
        "desc": "Cinccino, the evolution of Minccino, is a Normal-type Pokemon with the abilities Cute Charm and Technician. It excels against Ghost-types but is weak to Fighting-types."
    },
    {
        "id": 761,
        "name": "Bounsweet",
        "isNfe": true,
        "types": [
            "grass"
        ],
        "desc": "Bounsweet is a Grass-type Pokemon with the abilities Leaf Guard and Oblivious. It's strong against Ground and Rock-types but vulnerable to Bug, Fire, Flying, Ice, and Poison-type moves."
    },
    {
        "id": 762,
        "name": "Steenee",
        "isNfe": true,
        "types": [
            "grass"
        ],
        "desc": "Steenee, the evolution of Bounsweet, is a Grass-type Pokemon with the abilities Leaf Guard and Oblivious. It excels against Ground and Rock-types but is weak to Bug, Fire, Flying, Ice, and Poison-type moves."
    },
    {
        "id": 763,
        "name": "Tsareena",
        "types": [
            "grass"
        ],
        "desc": "Tsareena is a Grass-type Pokemon with the abilities Leaf Guard and Queenly Majesty. It's strong against Ground and Rock-types but vulnerable to Bug, Fire, Flying, Ice, and Poison-type moves."
    },
    {
        "id": 43,
        "name": "Oddish",
        "isNfe": true,
        "types": [
            "grass",
            "poison"
        ],
        "desc": "Oddish is a dual-type Grass and Poison Pokemon with the abilities Chlorophyll and Run Away. It excels against Ground, Rock, and Water-types but is weak to Bug, Fire, Flying, Ice, and Psychic-type moves."
    },
    {
        "id": 44,
        "name": "Gloom",
        "isNfe": true,
        "types": [
            "grass",
            "poison"
        ],
        "desc": "Gloom, the evolution of Oddish, is a dual-type Grass and Poison Pokemon with the abilities Chlorophyll and Stench. It excels against Ground, Rock, and Water-types but is weak to Bug, Fire, Flying, Ice, and Psychic-type moves."
    },
    {
        "id": 45,
        "name": "Vileplume",
        "types": [
            "grass",
            "poison"
        ],
        "desc": "Vileplume is a dual-type Grass and Poison Pokemon with the abilities Chlorophyll and Effect Spore. It excels against Ground, Rock, and Water-types but is weak to Bug, Fire, Flying, Ice, and Psychic-type moves."
    },
    {
        "id": 182,
        "name": "Bellossom",
        "types": [
            "grass"
        ],
        "desc": "Bellossom is a Grass-type Pokemon with the abilities Chlorophyll and Healer. It's strong against Ground, Rock, and Water-types but weak to Bug, Fire, Flying, Ice, and Psychic-type moves."
    },
    {
        "id": 406,
        "name": "Budew",
        "isNfe": true,
        "types": [
            "grass",
            "poison"
        ],
        "desc": "Budew is a dual-type Grass and Poison Pokemon with the abilities Natural Cure and Poison Point. It excels against Ground, Rock, and Water-types but is weak to Bug, Fire, Flying, Ice, and Psychic-type moves."
    },
    {
        "id": 315,
        "name": "Roselia",
        "isNfe": true,
        "types": [
            "grass",
            "poison"
        ],
        "desc": "Roselia is a dual-type Grass and Poison Pokemon with the abilities Natural Cure and Poison Point. It excels against Ground, Rock, and Water-types but is weak to Bug, Fire, Flying, Ice, and Psychic-type moves."
    },
    {
        "id": 407,
        "name": "Roserade",
        "types": [
            "grass",
            "poison"
        ],
        "desc": "Roserade is a dual-type Grass and Poison Pokemon with the abilities Natural Cure and Poison Point. It excels against Ground, Rock, and Water-types but is weak to Bug, Fire, Flying, Ice, and Psychic-type moves."
    },
    {
        "id": 278,
        "name": "Wingull",
        "isNfe": true,
        "types": [
            "water",
            "flying"
        ],
        "desc": "Wingull is a dual-type Water and Flying Pokemon with the abilities Keen Eye and Hydration. It's strong against Fire and Rock-types but vulnerable to Electric types."
    },
    {
        "id": 279,
        "name": "Pelipper",
        "types": [
            "water",
            "flying"
        ],
        "desc": "Pelipper is a dual-type Water and Flying Pokemon with the abilities Keen Eye and Drizzle. It's strong against Fire and Rock-types but weak to Electric and Ice-type moves."
    },
    {
        "id": 595,
        "name": "Joltik",
        "isNfe": true,
        "types": [
            "bug",
            "electric"
        ],
        "desc": "Joltik is a dual-type Bug and Electric Pokemon with the abilities Compound Eyes and Unnerve. It excels against Grass and Water-types but is vulnerable to Fire and Rock-type moves."
    },
    {
        "id": 596,
        "name": "Galvantula",
        "types": [
            "bug",
            "electric"
        ],
        "desc": "Galvantula is a dual-type Bug and Electric Pokemon with the abilities Compound Eyes and Unnerve. It's strong against Water and Flying-types but weak to Fire, Rock, and Electric-type moves."
    },
    {
        "id": 309,
        "name": "Electrike",
        "isNfe": true,
        "types": [
            "electric"
        ],
        "desc": "Electrike is an Electric-type Pokemon with the abilities Static and Lightning Rod. It excels against Water and Flying-types but is vulnerable to Ground-type moves."
    },
    {
        "id": 310,
        "name": "Manectric",
        "types": [
            "electric"
        ],
        "desc": "Manectric is an Electric-type Pokemon with the abilities Static and Lightning Rod. It's strong against Water and Flying-types but vulnerable to Ground-type moves."
    },
    {
        "id": 37,
        "name": "Vulpix",
        "isNfe": true,
        "types": [
            "fire"
        ],
        "desc": "Vulpix is a Fire-type Pokemon with the abilities Flash Fire and Drought. It excels against Bug, Grass, and Ice-types but is weak to Ground, Rock, and Water-type moves."
    },
    {
        "id": 38,
        "name": "Ninetales",
        "types": [
            "fire"
        ],
        "desc": "Ninetales is a Fire-type Pokemon with the abilities Flash Fire and Drought. It's strong against Bug, Grass, and Ice-types but vulnerable to Ground, Rock, and Water-type moves."
    },
    {
        "id": 58,
        "name": "Growlithe",
        "isNfe": true,
        "types": [
            "fire"
        ],
        "desc": "Growlithe is a Fire-type Pokemon with the abilities Intimidate and Flash Fire. It's strong against Bug, Grass, and Ice-types but vulnerable to Ground, Rock, and Water-type moves."
    },
    {
        "id": 59,
        "name": "Arcanine",
        "types": [
            "fire"
        ],
        "desc": "Arcanine is a Fire-type Pokemon with the abilities Intimidate and Flash Fire. It excels against Bug, Grass, and Ice-types but is weak to Ground, Rock, and Water-type moves."
    },
    {
        "id": 582,
        "name": "Vanillite",
        "isNfe": true,
        "types": [
            "ice"
        ],
        "desc": "Vanillite is an Ice-type Pokemon with the abilities Ice Body and Snow Cloak. It's strong against Dragon, Flying, Grass, and Ground-types but is weak to Fighting, Fire, Rock, and Steel-type moves."
    },
    {
        "id": 583,
        "name": "Vanillish",
        "types": [
            "Ice"
        ],
        "desc": "Vanillish is an Ice-type Pokemon with the abilities Ice Body and Snow Cloak. It's strong against Dragon, Flying, Grass, and Ground-types but is weak to Fighting, Fire, Rock, and Steel-type moves."
    },
    {
        "id": 584,
        "name": "Vanilluxe",
        "types": [
            "Ice"
        ],
        "desc": "Vanilluxe is an Ice-type Pokemon with the abilities Ice Body and Snow Warning. It's strong against Dragon, Flying, Grass, and Ground-types but is weak to Fighting, Fire, Rock, and Steel-type moves."
    },
    {
        "id": 220,
        "name": "Swinub",
        "types": [
            "Ice",
            "Ground"
        ],
        "desc": "Swinub is a dual-type Ice and Ground Pokemon with the abilities Oblivious and Snow Cloak. It excels against Dragon, Flying, Grass, and Ground-types but is weak to Fighting, Fire, Ice, and Steel-type moves."
    },
    {
        "id": 221,
        "name": "Piloswine",
        "types": [
            "Ice",
            "Ground"
        ],
        "desc": "Piloswine is a dual-type Ice and Ground Pokemon with the abilities Oblivious and Snow Cloak. It excels against Dragon, Flying, Grass, and Ground-types but is weak to Fighting, Fire, Ice, and Steel-type moves."
    },
    {
        "id": 473,
        "name": "Mamoswine",
        "types": [
            "Ice",
            "Ground"
        ],
        "desc": "Mamoswine is a dual-type Ice and Ground Pokemon with the abilities Oblivious and Snow Cloak. It excels against Dragon, Flying, Grass, and Ground-types but is weak to Fighting, Fire, Ice, and Steel-type moves."
    },
    {
        "id": 225,
        "name": "Delibird",
        "types": [
            "Ice",
            "Flying"
        ],
        "desc": "Delibird is a dual-type Ice and Flying Pokemon with the abilities Vital Spirit and Hustle. It excels against Bug, Fighting, and Grass-types but is weak to Electric, Fire, and Rock-type moves."
    },
    {
        "id": 361,
        "name": "Snorunt",
        "types": [
            "Ice"
        ],
        "desc": "Snorunt is an Ice-type Pokemon with the abilities Inner Focus and Ice Body. It excels against Dragon, Flying, Grass, and Ground-types but is weak to Fighting, Fire, Rock, and Steel-type moves."
    },
    {
        "id": 362,
        "name": "Glalie",
        "types": [
            "Ice"
        ],
        "desc": "Glalie is an Ice-type Pokemon with the abilities Inner Focus and Ice Body. It excels against Dragon, Flying, Grass, and Ground-types but is weak to Fighting, Fire, Rock, and Steel-type moves."
    },
    {
        "id": 478,
        "name": "Froslass",
        "types": [
            "Ice",
            "Ghost"
        ],
        "desc": "Froslass is a dual-type Ice and Ghost Pokemon with the abilities Snow Cloak and Cursed Body. It excels against Dragon, Flying, Grass, Ground, and Psychic-types but is weak to Dark, Fire, Ghost, Rock, and Steel-type moves."
    },
    {
        "id": 343,
        "name": "Baltoy",
        "types": [
            "Ground",
            "Psychic"
        ],
        "desc": "Baltoy is a dual-type Ground and Psychic Pokemon with the abilities Levitate and Levitate. It excels against Electric, Fighting, Poison, and Rock-types but is weak to Bug, Dark, Ghost, Ice, and Water-type moves."
    },
    {
        "id": 344,
        "name": "Claydol",
        "types": [
            "Ground",
            "Psychic"
        ],
        "desc": "Claydol is a dual-type Ground and Psychic Pokemon with the abilities Levitate and Levitate. It excels against Electric, Fighting, Poison, and Rock-types but is weak to Bug, Dark, Ghost, Ice, and Water-type moves."
    },
    {
        "id": 749,
        "name": "Mudbray",
        "types": [
            "Ground"
        ],
        "desc": "Mudbray is a Ground-type Pokemon with the abilities Own Tempo and Stamina. It excels against Electric, Poison, Rock, and Steel-types but is weak to Grass and Ice-type moves."
    },
    {
        "id": 750,
        "name": "Mudsdale",
        "types": [
            "Ground"
        ],
        "desc": "Mudsdale is a Ground-type Pokemon with the abilities Own Tempo and Stamina. It excels against Electric, Poison, Rock, and Steel-types but is weak to Grass and Ice-type moves."
    },
    {
        "id": 557,
        "name": "Dwebble",
        "types": [
            "Bug",
            "Rock"
        ],
        "desc": "Dwebble is a dual-type Bug and Rock Pokemon with the abilities Sturdy and Shell Armor. It excels against Bug, Fire, Flying, Ice, and Poison-types but is vulnerable to Rock and Steel-type moves."
    },
    {
        "id": 558,
        "name": "Crustle",
        "types": [
            "Bug",
            "Rock"
        ],
        "desc": "Crustle is a dual-type Bug and Rock Pokemon with the abilities Sturdy and Shell Armor. It excels against Bug, Fire, Flying, Ice, and Poison-types but is vulnerable to Rock and Steel-type moves."
    },
    {
        "id": 622,
        "name": "Golett",
        "types": [
            "Ground",
            "Ghost"
        ],
        "desc": "Golett is a dual-type Ground and Ghost Pokemon with the abilities Iron Fist and Klutz. It excels against Electric, Fire, Poison, and Rock-types but is vulnerable to Dark, Ghost, Ice, and Water-type moves."
    },
    {
        "id": 623,
        "name": "Golurk",
        "types": [
            "Ground",
            "Ghost"
        ],
        "desc": "Golurk is a dual-type Ground and Ghost Pokemon with the abilities Iron Fist and Klutz. It excels against Electric, Fire, Poison, and Rock-types but is vulnerable to Dark, Ghost, Ice, and Water-type moves."
    },
    {
        "id": 517,
        "name": "Munna",
        "types": [
            "Psychic"
        ],
        "desc": "Munna is a Psychic-type Pokemon with the abilities Forewarn and Synchronize. It excels against Fighting and Poison-types but is vulnerable to Bug, Dark, and Ghost-type moves."
    },
    {
        "id": 518,
        "name": "Musharna",
        "types": [
            "Psychic"
        ],
        "desc": "Musharna is a Psychic-type Pokemon with the abilities Forewarn and Synchronize. It excels against Fighting and Poison-types but is vulnerable to Bug, Dark, and Ghost-type moves."
    },
    {
        "id": 177,
        "name": "Natu",
        "types": [
            "Psychic",
            "Flying"
        ],
        "desc": "Natu is a dual-type Psychic and Flying Pokemon with the abilities Synchronize and Early Bird. It excels against Fighting and Poison-types but is vulnerable to Dark, Electric, Ghost, Ice, and Rock-type moves."
    },
    {
        "id": 178,
        "name": "Xatu",
        "types": [
            "Psychic",
            "Flying"
        ],
        "desc": "Xatu is a dual-type Psychic and Flying Pokemon with the abilities Synchronize and Early Bird. It excels against Fighting and Poison-types but is vulnerable to Dark, Electric, Ghost, Ice, and Rock-type moves."
    },
    {
        "id": 759,
        "name": "Stufful",
        "types": [
            "Normal",
            "Fighting"
        ],
        "desc": "Stufful is a dual-type Normal and Fighting Pokemon with the abilities Fluffy and Klutz. It excels against Rock, Steel, and Dark-types but is vulnerable to Fighting, Flying, and Psychic-type moves."
    },
    {
        "id": 760,
        "name": "Bewear",
        "types": [
            "Normal",
            "Fighting"
        ],
        "desc": "Bewear is a dual-type Normal and Fighting Pokemon with the abilities Fluffy and Klutz. It excels against Rock, Steel, and Dark-types but is vulnerable to Fighting, Flying, and Psychic-type moves."
    },
    {
        "id": 459,
        "name": "Snover",
        "types": [
            "Grass",
            "Ice"
        ],
        "desc": "Snover is a dual-type Grass and Ice Pokemon with the abilities Snow Warning and Soundproof. It excels against Ground, Grass, and Electric-types but is vulnerable to Fire, Fighting, Rock, and Steel-type moves."
    },
    {
        "id": 460,
        "name": "Abomasnow",
        "types": [
            "Grass",
            "Ice"
        ],
        "desc": "Abomasnow is a dual-type Grass and Ice Pokemon with the abilities Snow Warning and Soundproof. It excels against Ground, Grass, and Electric-types but is vulnerable to Fire, Fighting, Rock, and Steel-type moves."
    },
    {
        "id": 98,
        "name": "Krabby",
        "isNfe": true,
        "types": [
            "Water"
        ],
        "desc": "Krabby is a Water-type Pokemon with the abilities Hyper Cutter and Shell Armor. It excels against Fire, Ground, and Rock-types but is vulnerable to Electric and Grass-type moves."
    },
    {
        "id": 99,
        "name": "Kingler",
        "types": [
            "Water"
        ],
        "forms": [
            {
                "name": "Kingler",
                "types": [
                    "Water"
                ]
            },
            {
                "name": "Kingler Gigantamax",
                "types": [
                    "Water"
                ],
                "spriteSuffix": "gigantamax",
                "isGigantamax": true
            }
        ],
        "desc": "Kingler is a Water-type Pokemon with the abilities Hyper Cutter and Shell Armor. It excels against Fire, Ground, and Rock-types but is vulnerable to Electric and Grass-type moves. It also has a Gigantamax form."
    },
    {
        "id": 194,
        "name": "Wooper",
        "isNfe": true,
        "types": [
            "Water",
            "Ground"
        ],
        "desc": "Wooper is a dual-type Water and Ground Pokemon with the abilities Damp and Water Absorb. It excels against Electric, Fire, Rock, and Steel-types but is vulnerable to Grass-type moves."
    },
    {
        "id": 195,
        "name": "Quagsire",
        "types": [
            "Water",
            "Ground"
        ],
        "desc": "Quagsire is a dual-type Water and Ground Pokemon with the abilities Damp and Water Absorb. It excels against Electric, Fire, Rock, and Steel-types but is vulnerable to Grass-type moves."
    },
    {
        "id": 341,
        "name": "Corphish",
        "isNfe": true,
        "types": [
            "Water"
        ],
        "desc": "Corphish is a Water-type Pokemon with the abilities Hyper Cutter and Shell Armor. It excels against Fire, Ground, and Rock-types but is vulnerable to Electric and Grass-type moves."
    },
    {
        "id": 342,
        "name": "Crawdaunt",
        "types": [
            "Water",
            "Dark"
        ],
        "desc": "Crawdaunt is a dual-type Water and Dark Pokemon with the abilities Hyper Cutter and Shell Armor. It excels against Fire, Ground, and Rock-types but is vulnerable to Electric, Fairy, Fighting, and Grass-type moves."
    },
    {
        "id": 290,
        "name": "Nincada",
        "isNfe": true,
        "types": [
            "Bug",
            "Ground"
        ],
        "desc": "Nincada is a dual-type Bug and Ground Pokemon with the abilities Compound Eyes and Run Away. It excels against Electric, Poison, and Rock-types but is vulnerable to Ice and Water-type moves."
    },
    {
        "id": 291,
        "name": "Ninjask",
        "types": [
            "Bug",
            "Flying"
        ],
        "desc": "Ninjask is a dual-type Bug and Flying Pokemon with the abilities Speed Boost and Infiltrator. It excels against Fighting, Grass, and Bug-types but is vulnerable to Electric, Fire, Flying, Ice, and Rock-type moves."
    },
    {
        "id": 292,
        "name": "Shedinja",
        "types": [
            "Bug",
            "Ghost"
        ],
        "desc": "Shedinja is a dual-type Bug and Ghost Pokemon with the abilities Wonder Guard. It has unique stats and abilities, making it immune to most moves but vulnerable to super-effective moves."
    },
    {
        "id": 236,
        "name": "Tyrogue",
        "isNfe": true,
        "types": [
            "Fighting"
        ],
        "desc": "Tyrogue is a Fighting-type Pokemon with the abilities Guts and Steadfast. It excels against Dark, Ice, Normal, Rock, and Steel-types but is vulnerable to Fairy and Flying-type moves."
    },
    {
        "id": 106,
        "name": "Hitmonlee",
        "types": [
            "Fighting"
        ],
        "desc": "Hitmonlee is a Fighting-type Pokemon with the abilities Limber and Reckless. It excels against Dark, Ice, Normal, Rock, and Steel-types but is vulnerable to Fairy and Flying-type moves."
    },
    {
        "id": 107,
        "name": "Hitmonchan",
        "types": [
            "Fighting"
        ],
        "desc": "Hitmonchan is a Fighting-type Pokemon with the abilities Keen Eye and Iron Fist. It excels against Dark, Ice, Normal, Rock, and Steel-types but is vulnerable to Fairy and Flying-type moves."
    },
    {
        "id": 237,
        "name": "Hitmontop",
        "types": [
            "Fighting"
        ],
        "desc": "Hitmontop is a Fighting-type Pokemon with the abilities Intimidate and Technician. It excels against Dark, Ice, Normal, Rock, and Steel-types but is vulnerable to Fairy and Flying-type moves."
    },
    {
        "id": 674,
        "name": "Pancham",
        "isNfe": true,
        "types": [
            "Fighting"
        ],
        "desc": "Pancham is a Fighting-type Pokemon with the abilities Iron Fist and Mold Breaker. It excels against Dark, Ice, Normal, Rock, and Steel-types but is vulnerable to Fairy and Flying-type moves."
    },
    {
        "id": 675,
        "name": "Pangoro",
        "types": [
            "Fighting",
            "Dark"
        ],
        "desc": "Pangoro is a dual-type Fighting and Dark Pokemon with the abilities Iron Fist and Mold Breaker. It excels against Dark, Ice, Normal, Rock, and Steel-types but is vulnerable to Fairy and Flying-type moves."
    },
    {
        "id": 599,
        "name": "Klink",
        "isNfe": true,
        "types": [
            "Steel"
        ],
        "desc": "Klink is a Steel-type Pokemon with the abilities Plus and Minus. It excels against Fairy, Ice, Rock, and Steel-types but is vulnerable to Electric, Fighting, and Ground-type moves."
    },
    {
        "id": 600,
        "name": "Klang",
        "isNfe": true,
        "types": [
            "Steel"
        ],
        "desc": "Klang is a Steel-type Pokemon with the abilities Plus and Minus. It excels against Fairy, Ice, Rock, and Steel-types but is vulnerable to Electric, Fighting, and Ground-type moves."
    },
    {
        "id": 601,
        "name": "Klinklang",
        "types": [
            "Steel"
        ],
        "desc": "Klinklang is a Steel-type Pokemon with the abilities Plus and Minus. It excels against Fairy, Ice, Rock, and Steel-types but is vulnerable to Electric, Fighting, and Ground-type moves."
    },
    {
        "id": 415,
        "name": "Combee",
        "isNfe": true,
        "types": [
            "Bug",
            "Flying"
        ],
        "desc": "Combee is a Bug and Flying-type Pokemon with the abilities Honey Gather and Hustle. It excels against Bug, Fighting, Grass, and Ground-types but is vulnerable to Electric, Fire, Ice, and Rock-type moves."
    },
    {
        "id": 416,
        "name": "Vespiquen",
        "types": [
            "Bug",
            "Flying"
        ],
        "desc": "Vespiquen is a Bug and Flying-type Pokemon with the abilities Pressure and Unnerve. It excels against Bug, Fighting, Grass, and Ground-types but is vulnerable to Electric, Fire, Ice, and Rock-type moves."
    },
    {
        "id": 436,
        "name": "Bronzor",
        "isNfe": true,
        "types": [
            "Steel",
            "Psychic"
        ],
        "desc": "Bronzor is a dual-type Steel and Psychic Pokemon with the abilities Levitate and Heatproof. It excels against Fighting, Ice, Normal, Poison, and Rock-types but is vulnerable to Dark, Fire, Ghost, and Ground-type moves."
    },
    {
        "id": 437,
        "name": "Bronzong",
        "types": [
            "Steel",
            "Psychic"
        ],
        "desc": "Bronzong is a dual-type Steel and Psychic Pokemon with the abilities Levitate and Heatproof. It excels against Fighting, Ice, Normal, Poison, and Rock-types but is vulnerable to Dark, Fire, Ghost, and Ground-type moves."
    },
    {
        "id": 280,
        "name": "Ralts",
        "isNfe": true,
        "types": [
            "Psychic",
            "Fairy"
        ],
        "desc": "Ralts is a dual-type Psychic and Fairy Pokemon with the abilities Synchronize and Trace. It excels against Fighting and Poison-types but is vulnerable to Ghost and Steel-type moves."
    },
    {
        "id": 281,
        "name": "Kirlia",
        "isNfe": true,
        "types": [
            "Psychic",
            "Fairy"
        ],
        "desc": "Kirlia is a dual-type Psychic and Fairy Pokemon with the abilities Synchronize and Trace. It excels against Fighting and Poison-types but is vulnerable to Ghost and Steel-type moves."
    },
    {
        "id": 282,
        "name": "Gardevoir",
        "types": [
            "Psychic",
            "Fairy"
        ],
        "desc": "Gardevoir is a dual-type Psychic and Fairy Pokemon with the abilities Synchronize and Trace. It excels against Fighting and Poison-types but is vulnerable to Ghost and Steel-type moves."
    },
    {
        "id": 475,
        "name": "Gallade",
        "types": [
            "Psychic",
            "Fighting"
        ],
        "desc": "Gallade is a dual-type Psychic and Fighting Pokemon with the abilities Steadfast and Justified. It excels against Fighting and Poison-types but is vulnerable to Fairy and Flying-type moves."
    },
    {
        "id": 425,
        "name": "Drifloon",
        "isNfe": true,
        "types": [
            "Ghost",
            "Flying"
        ],
        "desc": "Drifloon is a dual-type Ghost and Flying Pokemon with the abilities Aftermath and Unburden. It excels against Bug and Fighting-types but is vulnerable to Dark, Electric, Ghost, Ice, and Rock-type moves."
    },
    {
        "id": 426,
        "name": "Drifblim",
        "types": [
            "Ghost",
            "Flying"
        ],
        "desc": "Drifblim is a dual-type Ghost and Flying Pokemon with the abilities Aftermath and Unburden. It excels against Bug, Fighting, and Grass-types but is vulnerable to Dark, Electric, Ghost, Ice, and Rock-type moves."
    },
    {
        "id": 829,
        "name": "Gossifleur",
        "isNfe": true,
        "types": [
            "Grass"
        ],
        "desc": "Gossifleur is a Grass-type Pokemon with the abilities Cotton Down and Regenerator. It excels against Ground, Rock, and Water-types but is vulnerable to Bug, Fire, Flying, Ice, and Poison-type moves."
    },
    {
        "id": 830,
        "name": "Eldegoss",
        "types": [
            "Grass"
        ],
        "desc": "Eldegoss is a Grass-type Pokemon with the abilities Cotton Down and Regenerator. It excels against Ground, Rock, and Water-types but is vulnerable to Bug, Fire, Flying, Ice, and Poison-type moves."
    },
    {
        "id": 420,
        "name": "Cherubi",
        "isNfe": true,
        "types": [
            "Grass"
        ],
        "desc": "Cherubi is a Grass-type Pokemon with the abilities Chlorophyll and Flower Gift. It excels against Ground, Rock, and Water-types but is vulnerable to Bug, Fire, Flying, Ice, and Poison-type moves."
    },
    {
        "id": 421,
        "name": "Cherrim",
        "types": [
            "Grass"
        ],
        "forms": [
            {
                "name": "Cherrim",
                "types": [
                    "Grass"
                ]
            },
            {
                "name": "Cherrim",
                "types": [
                    "Grass"
                ],
                "spriteSuffix": "sunshine"
            }
        ],
        "desc": "Cherrim is a Grass-type Pokemon with the abilities Flower Gift and Flower Gift (Sunshine Form). It excels against Ground, Rock, and Water-types but is vulnerable to Bug, Fire, Flying, Ice, and Poison-type moves. It has a Sunshine Form."
    },
    {
        "id": 434,
        "name": "Stunky",
        "isNfe": true,
        "types": [
            "Poison",
            "Dark"
        ],
        "desc": "Stunky is a dual-type Poison and Dark Pokemon with the abilities Stench and Aftermath. It excels against Fairy and Grass-types but is vulnerable to Ground-type moves."
    },
    {
        "id": 435,
        "name": "Skuntank",
        "types": [
            "Poison",
            "Dark"
        ],
        "desc": "Skuntank is a dual-type Poison and Dark Pokemon with the abilities Stench and Aftermath. It excels against Fairy, Grass, and Psychic-types but is vulnerable to Ground-type moves."
    },
    {
        "id": 535,
        "name": "Tympole",
        "isNfe": true,
        "types": [
            "Water"
        ],
        "desc": "Tympole is a Water-type Pokemon with the abilities Swift Swim and Hydration. It excels against Fire, Ground, and Rock-types but is vulnerable to Electric and Grass-type moves."
    },
    {
        "id": 536,
        "name": "Palpitoad",
        "isNfe": true,
        "types": [
            "Water",
            "Ground"
        ],
        "desc": "Palpitoad is a dual-type Water and Ground Pokemon with the abilities Swift Swim and Hydration. It excels against Electric, Fire, Poison, Rock, and Steel-types but is vulnerable to Grass-type moves."
    },
    {
        "id": 537,
        "name": "Seismitoad",
        "types": [
            "Water",
            "Ground"
        ],
        "desc": "Seismitoad is a dual-type Water and Ground Pokemon with the abilities Swift Swim and Poison Touch. It excels against Electric, Fire, Poison, Rock, and Steel-types but is vulnerable to Grass-type moves."
    },
    {
        "id": 355,
        "name": "Duskull",
        "isNfe": true,
        "types": [
            "Ghost"
        ],
        "desc": "Duskull is a Ghost-type Pokemon with the abilities Levitate and Frisk. It excels against Normal and Fighting-types but is vulnerable to Dark and Ghost-type moves."
    },
    {
        "id": 356,
        "name": "Dusclops",
        "isNfe": true,
        "types": [
            "Ghost"
        ],
        "desc": "Dusclops is a Ghost-type Pokemon with the abilities Pressure and Frisk. It excels against Normal and Fighting-types but is vulnerable to Dark and Ghost-type moves."
    },
    {
        "id": 477,
        "name": "Dusknoir",
        "types": [
            "Ghost"
        ],
        "desc": "Dusknoir is a Ghost-type Pokemon with the abilities Pressure and Frisk. It excels against Normal and Fighting-types but is vulnerable to Dark and Ghost-type moves."
    },
    {
        "id": 66,
        "name": "Machop",
        "isNfe": true,
        "types": [
            "Fighting"
        ],
        "desc": "Machop is a Fighting-type Pokemon with the abilities Guts and No Guard. It excels against Dark, Ice, Normal, Rock, and Steel-types but is vulnerable to Fairy and Flying-type moves."
    },
    {
        "id": 67,
        "name": "Machoke",
        "isNfe": true,
        "types": [
            "Fighting"
        ],
        "desc": "Machoke is a Fighting-type Pokemon with the abilities Guts and No Guard. It excels against Dark, Ice, Normal, Rock, and Steel-types but is vulnerable to Fairy and Flying-type moves."
    },
    {
        "id": 68,
        "name": "Machamp",
        "types": [
            "Fighting"
        ],
        "forms": [
            {
                "name": "Machamp",
                "types": [
                    "Fighting"
                ]
            },
            {
                "name": "Machamp Gigantamax",
                "types": [
                    "Fighting"
                ],
                "spriteSuffix": "gigantamax",
                "isGigantamax": true
            }
        ],
        "desc": "Machamp is a Fighting-type Pokemon with the abilities Guts and No Guard. It excels against Dark, Ice, Normal, Rock, and Steel-types but is vulnerable to Fairy and Flying-type moves. It also has a Gigantamax form."
    },
    {
        "id": 92,
        "name": "Gastly",
        "isNfe": true,
        "types": [
            "Ghost",
            "Poison"
        ],
        "desc": "Gastly is a dual-type Ghost and Poison Pokemon with the abilities Levitate. It excels against Bug, Fairy, Fighting, Grass, and Poison-types but is vulnerable to Dark and Ground-type moves."
    },
    {
        "id": 93,
        "name": "Haunter",
        "isNfe": true,
        "types": [
            "Ghost",
            "Poison"
        ],
        "desc": "Haunter is a dual-type Ghost and Poison Pokemon with the abilities Levitate. It excels against Bug, Fairy, Fighting, Grass, and Poison-types but is vulnerable to Dark and Ground-type moves."
    },
    {
        "id": 94,
        "name": "Gengar",
        "types": [
            "Ghost",
            "Poison"
        ],
        "forms": [
            {
                "name": "Gengar",
                "types": [
                    "Ghost",
                    "Poison"
                ]
            },
            {
                "name": "Gengar Gigantamax",
                "types": [
                    "Ghost",
                    "Poison"
                ],
                "spriteSuffix": "gigantamax",
                "isGigantamax": true
            }
        ],
        "desc": "Gengar is a dual-type Ghost and Poison Pokemon with the abilities Cursed Body. It excels against Bug, Fairy, Fighting, Grass, Poison, and Psychic-types but is vulnerable to Dark and Ground-type moves. It also has a Gigantamax form."
    },
    {
        "id": 129,
        "name": "Magikarp",
        "isNfe": true,
        "types": [
            "Water"
        ],
        "desc": "Magikarp is a Water-type Pokemon with the ability Swift Swim. It excels against Electric and Steel-types but is vulnerable to Electric and Grass-type moves."
    },
    {
        "id": 130,
        "name": "Gyarados",
        "types": [
            "Water",
            "Flying"
        ],
        "desc": "Gyarados is a dual-type Water and Flying Pokemon with the abilities Intimidate and Moxie. It excels against Bug, Fighting, Fire, Ground, and Steel-types but is vulnerable to Electric and Rock-type moves."
    },
    {
        "id": 118,
        "name": "Goldeen",
        "isNfe": true,
        "types": [
            "Water"
        ],
        "desc": "Goldeen is a Water-type Pokemon with the abilities Swift Swim and Water Veil. It excels against Electric, Fire, Rock, and Steel-types but is vulnerable to Electric and Grass-type moves."
    },
    {
        "id": 119,
        "name": "Seaking",
        "types": [
            "Water"
        ],
        "desc": "Seaking is a Water-type Pokemon with the abilities Swift Swim and Water Veil. It excels against Electric, Fire, Rock, and Steel-types but is vulnerable to Electric and Grass-type moves."
    },
    {
        "id": 223,
        "name": "Remoraid",
        "isNfe": true,
        "types": [
            "Water"
        ],
        "desc": "Remoraid is a Water-type Pokemon with the abilities Hustle and Sniper. It excels against Fire, Ground, and Rock-types but is vulnerable to Electric and Grass-type moves."
    },
    {
        "id": 224,
        "name": "Octillery",
        "types": [
            "Water"
        ],
        "desc": "Octillery is a Water-type Pokemon with the abilities Suction Cups and Sniper. It excels against Fire, Ground, and Rock-types but is vulnerable to Electric and Grass-type moves."
    },
    {
        "id": 90,
        "name": "Shellder",
        "isNfe": true,
        "types": [
            "Water"
        ],
        "desc": "Shellder is a Water-type Pokemon with the ability Shell Armor. It excels against Fire, Ice, and Steel-types but is vulnerable to Electric and Grass-type moves."
    },
    {
        "id": 91,
        "name": "Cloyster",
        "types": [
            "Water",
            "Ice"
        ],
        "desc": "Cloyster is a dual-type Water and Ice Pokemon with the abilities Shell Armor. It excels against Dragon, Flying, Grass, and Ground-types but is vulnerable to Electric, Fighting, Rock, and Steel-type moves."
    },
    {
        "id": 349,
        "name": "Feebas",
        "isNfe": true,
        "types": [
            "Water"
        ],
        "desc": "Feebas is a Water-type Pokemon with the abilities Swift Swim and Adaptability. It excels against Electric, Fire, and Steel-types but is vulnerable to Electric and Grass-type moves."
    },
    {
        "id": 350,
        "name": "Milotic",
        "types": [
            "Water"
        ],
        "desc": "Milotic is a Water-type Pokemon with the abilities Marvel Scale and Competitive. It excels against Dragon, Grass, and Ground-types but is vulnerable to Electric and Grass-type moves."
    },
    {
        "id": 550,
        "name": "Basculin",
        "types": [
            "Water"
        ],
        "forms": [
            {
                "name": "Basculin",
                "types": [
                    "Water"
                ]
            },
            {
                "name": "Basculin",
                "types": [
                    "Water"
                ],
                "spriteSuffix": "bluestriped"
            }
        ],
        "desc": "Basculin is a Water-type Pokemon with the abilities Reckless and Adaptability. It excels against Fire, Rock, and Steel-types but is vulnerable to Electric and Grass-type moves. It has a Blue-striped Form."
    },
    {
        "id": 746,
        "name": "Wishiwashi",
        "types": [
            "Water"
        ],
        "forms": [
            {
                "name": "Wishiwashi School",
                "types": [
                    "Water"
                ],
                "spriteSuffix": "school"
            },
            {
                "name": "Wishiwashi",
                "types": [
                    "Water"
                ]
            }
        ],
        "desc": "Wishiwashi is a Water-type Pokemon with the ability Schooling. In its School Form, it excels against Electric, Rock, and Steel-types but is vulnerable to Electric and Grass-type moves. In its Solo Form, it has no specific strengths or weaknesses."
    },
    {
        "id": 771,
        "name": "Pyukumuku",
        "types": [
            "Water"
        ],
        "desc": "Pyukumuku is a Water-type Pokemon with the abilities Innards Out and Unaware. It excels against Ground, Rock, and Water-types but is vulnerable to Electric and Grass-type moves."
    },
    {
        "id": 568,
        "name": "Trubbish",
        "isNfe": true,
        "types": [
            "Poison"
        ],
        "desc": "Trubbish is a Poison-type Pokemon with the abilities Stench and Sticky Hold. It excels against Fairy, Grass, and Bug-types but is vulnerable to Ground and Psychic-type moves."
    },
    {
        "id": 569,
        "name": "Garbodor",
        "types": [
            "Poison"
        ],
        "forms": [
            {
                "name": "Garbodor",
                "types": [
                    "Poison"
                ]
            },
            {
                "name": "Garbodor Gigantamax",
                "types": [
                    "Poison"
                ],
                "spriteSuffix": "gigantamax",
                "isGigantamax": true
            }
        ],
        "desc": "Garbodor is a Poison-type Pokemon with the abilities Stench and Weak Armor. It excels against Fairy, Grass, and Bug-types but is vulnerable to Ground and Psychic-type moves. It also has a Gigantamax form."
    },
    {
        "id": 850,
        "name": "Sizzlipede",
        "isNfe": true,
        "types": [
            "Fire",
            "Bug"
        ],
        "desc": "Sizzlipede is a dual-type Fire and Bug Pokemon with the abilities Flash Fire and White Smoke. It excels against Bug, Grass, Ice, and Steel-types but is vulnerable to Rock and Water-type moves."
    },
    {
        "id": 851,
        "name": "Centiskorch",
        "types": [
            "Fire",
            "Bug"
        ],
        "forms": [
            {
                "name": "Centiskorch",
                "types": [
                    "Fire",
                    "Bug"
                ]
            },
            {
                "name": "Centiskorch Gigantamax",
                "types": [
                    "Fire",
                    "Bug"
                ],
                "spriteSuffix": "gigantamax",
                "isGigantamax": true
            }
        ],
        "desc": "Centiskorch is a dual-type Fire and Bug Pokemon with the abilities Flash Fire and White Smoke. It excels against Bug, Grass, Ice, and Steel-types but is vulnerable to Rock and Water-type moves. It also has a Gigantamax form."
    },
    {
        "id": 837,
        "name": "Rolycoly",
        "isNfe": true,
        "types": [
            "Rock"
        ],
        "desc": "Rolycoly is a Rock-type Pokemon with the abilities Steam Engine and Heatproof. It excels against Bug, Fire, Flying, Ice, and Normal-types but is vulnerable to Fighting, Ground, and Steel-type moves."
    },
    {
        "id": 838,
        "name": "Carkol",
        "isNfe": true,
        "types": [
            "Rock",
            "Fire"
        ],
        "desc": "Carkol is a dual-type Rock and Fire Pokemon with the abilities Steam Engine and Flame Body. It excels against Bug, Grass, Ice, Steel, and Fairy-types but is vulnerable to Fighting, Ground, Rock, and Water-type moves."
    },
    {
        "id": 839,
        "name": "Coalossal",
        "types": [
            "Rock",
            "Fire"
        ],
        "forms": [
            {
                "name": "Coalossal",
                "types": [
                    "Rock",
                    "Fire"
                ]
            },
            {
                "name": "Coalossal Gigantamax",
                "types": [
                    "Rock",
                    "Fire"
                ],
                "spriteSuffix": "gigantamax",
                "isGigantamax": true
            }
        ],
        "desc": "Coalossal is a dual-type Rock and Fire Pokemon with the abilities Steam Engine and Flame Body. It excels against Bug, Grass, Ice, Steel, and Fairy-types but is vulnerable to Fighting, Ground, Rock, and Water-type moves. It also has a Gigantamax form."
    },
    {
        "id": 50,
        "name": "Diglett",
        "isNfe": true,
        "types": [
            "Ground"
        ],
        "desc": "Diglett is a Ground-type Pokemon with the abilities Sand Veil and Arena Trap. It excels against Electric, Fire, Poison, Rock, and Steel-types but is vulnerable to Grass and Ice-type moves."
    },
    {
        "id": 51,
        "name": "Dugtrio",
        "types": [
            "Ground"
        ],
        "desc": "Dugtrio is a Ground-type Pokemon with the abilities Sand Veil and Arena Trap. It excels against Electric, Fire, Poison, Rock, and Steel-types but is vulnerable to Grass and Ice-type moves."
    },
    {
        "id": 529,
        "name": "Drilbur",
        "isNfe": true,
        "types": [
            "Ground"
        ],
        "desc": "Drilbur is a Ground-type Pokemon with the abilities Sand Rush and Sand Force. It excels against Electric, Fire, Poison, Rock, and Steel-types but is vulnerable to Grass and Ice-type moves."
    },
    {
        "id": 530,
        "name": "Excadrill",
        "types": [
            "Ground",
            "Steel"
        ],
        "desc": "Excadrill is a dual-type Ground and Steel Pokemon with the abilities Sand Rush and Mold Breaker. It excels against Electric, Fire, Poison, Rock, and Steel-types but is vulnerable to Fighting, Ground, and Water-type moves."
    },
    {
        "id": 460,
        "name": "Abomasnow",
        "types": [
            "grass",
            "ice"
        ],
        "desc": "Abomasnow is a Grass and Ice type Pokemon. It is weak to Fire, Fighting, Steel, and Rock types, but it's strong against Water, Ground, and Flying types. Its abilities include Snow Warning and Soundproof."
    },
    {
        "id": 98,
        "name": "Krabby",
        "isNfe": true,
        "types": [
            "water"
        ],
        "desc": "Krabby is a Water type Pokemon and is not fully evolved (NFE). It is weak to Electric and Grass types but has an advantage against Fire, Ground, and Rock types. Krabby's abilities include Hyper Cutter and Shell Armor."
    },
    {
        "id": 99,
        "name": "Kingler",
        "types": [
            "water"
        ],
        "forms": [
            {
                "name": "Kingler",
                "types": [
                    "water"
                ]
            },
            {
                "name": "Kingler Gigantamax",
                "types": [
                    "water"
                ],
                "spriteSuffix": "gigantamax",
                "isGigantamax": true
            }
        ],
        "desc": "Kingler is a Water type Pokemon. In its Gigantamax form, Kingler remains weak to Electric and Grass types but excels against Fire, Ground, and Rock types. Its abilities include Hyper Cutter and Shell Armor."
    },
    {
        "id": 194,
        "name": "Wooper",
        "isNfe": true,
        "types": [
            "water",
            "ground"
        ],
        "desc": "Wooper is a Water and Ground type Pokemon and is not fully evolved (NFE). It is vulnerable to Grass types but resists Rock types. Wooper has the abilities Damp and Water Absorb."
    },
    {
        "id": 195,
        "name": "Quagsire",
        "types": [
            "water",
            "ground"
        ],
        "desc": "Quagsire is a Water and Ground type Pokemon. It's weak to Grass types but resistant to Rock types. Quagsire's abilities include Damp and Water Absorb."
    },
    {
        "id": 341,
        "name": "Corphish",
        "isNfe": true,
        "types": [
            "water"
        ],
        "desc": "Corphish is a Water type Pokemon and is not fully evolved (NFE). It is vulnerable to Electric and Grass types but has an advantage against Fire, Ground, and Rock types. Corphish has the abilities Hyper Cutter and Shell Armor."
    },
    {
        "id": 342,
        "name": "Crawdaunt",
        "types": [
            "water",
            "dark"
        ],
        "desc": "Crawdaunt is a Water and Dark type Pokemon. It is weak to Electric, Grass, Fighting, and Bug types but strong against Ghost, Psychic, and Dark types. Crawdaunt's abilities include Hyper Cutter and Shell Armor."
    },
    {
        "id": 290,
        "name": "Nincada",
        "isNfe": true,
        "types": [
            "bug",
            "ground"
        ],
        "desc": "Nincada is a Bug and Ground type Pokemon and is not fully evolved (NFE). It is susceptible to Water, Ice, and Flying types but resistant to Poison and Rock types. Nincada has the abilities Compound Eyes and Run Away."
    },
    {
        "id": 291,
        "name": "Ninjask",
        "types": [
            "bug",
            "flying"
        ],
        "desc": "Ninjask is a Bug and Flying type Pokemon. It is weak to Electric, Rock, and Ice types but has an advantage against Fighting, Grass, and Bug types. Ninjask's abilities include Speed Boost and Infiltrator."
    },
    {
        "id": 292,
        "name": "Shedinja",
        "types": [
            "bug",
            "ghost"
        ],
        "desc": "Shedinja is a Bug and Ghost type Pokemon. It is vulnerable to Rock, Water, Electric, Ghost, and Dark types but has no weaknesses to Normal, Fighting, Poison, Bug, Grass, Psychic, Ice, Steel, and Fairy types. Shedinja has the abilities Wonder Guard."
    },
    {
        "id": 236,
        "name": "Tyrogue",
        "isNfe": true,
        "types": [
            "fighting"
        ],
        "desc": "Tyrogue is a Fighting type Pokemon and is not fully evolved (NFE). It is weak to Psychic and Flying types but has an advantage against Rock, Dark, Ice, Normal, and Steel types. Tyrogue's abilities include Guts and Steadfast."
    },
    {
        "id": 106,
        "name": "Hitmonlee",
        "types": [
            "fighting"
        ],
        "desc": "Hitmonlee is a Fighting type Pokemon. It is weak to Psychic and Flying types but strong against Rock, Dark, Ice, Normal, and Steel types. Hitmonlee's abilities include Limber and Reckless."
    },
    {
        "id": 107,
        "name": "Hitmonchan",
        "types": [
            "fighting"
        ],
        "desc": "Hitmonchan is a Fighting type Pokemon. It is vulnerable to Psychic and Flying types but has an advantage against Rock, Dark, Ice, Normal, and Steel types. Hitmonchan's abilities"
    },
    {
        "id": 237,
        "name": "Hitmontop",
        "types": [
            "fighting"
        ],
        "desc": "Hitmontop is a Fighting-type Pokemon. Its strengths include being strong against Normal, Ice, Rock, Dark, and Steel types. Its weaknesses include being weak to Flying, Psychic, and Fairy types."
    },
    {
        "id": 674,
        "name": "Pancham",
        "isNfe": true,
        "types": [
            "fighting"
        ],
        "desc": "Pancham is a Fighting-type Pokemon in its non-fully-evolved form. Its strengths include being strong against Normal, Ice, Rock, Dark, and Steel types. Its weaknesses include being weak to Flying, Psychic, and Fairy types."
    },
    {
        "id": 675,
        "name": "Pangoro",
        "types": [
            "fighting",
            "dark"
        ],
        "desc": "Pangoro is a dual-type Fighting and Dark Pokemon. Its Fighting type grants it strengths against Normal, Ice, Rock, Dark, and Steel types, while its Dark type gives it an additional strength against Psychic and Ghost types. However, it is weak to Flying and Fairy types."
    },
    {
        "id": 599,
        "name": "Klink",
        "isNfe": true,
        "types": [
            "steel"
        ],
        "desc": "Klink is a Steel-type Pokemon in its non-fully-evolved form. Its strength includes being resistant to Normal, Grass, Ice, Flying, Psychic, Bug, Rock, Dragon, Steel, and Fairy types. However, it is weak to Fire, Fighting, and Ground types."
    },
    {
        "id": 600,
        "name": "Klang",
        "isNfe": true,
        "types": [
            "steel"
        ],
        "desc": "Klang is a Steel-type Pokemon in its non-fully-evolved form. Its strength includes being resistant to Normal, Grass, Ice, Flying, Psychic, Bug, Rock, Dragon, Steel, and Fairy types. However, it is weak to Fire, Fighting, and Ground types."
    },
    {
        "id": 601,
        "name": "Klinklang",
        "types": [
            "steel"
        ],
        "desc": "Klinklang is a fully evolved Steel-type Pokemon. Its strength includes being resistant to Normal, Grass, Ice, Flying, Psychic, Bug, Rock, Dragon, Steel, and Fairy types. However, it is weak to Fire, Fighting, and Ground types."
    },
    {
        "id": 415,
        "name": "Combee",
        "isNfe": true,
        "types": [
            "bug",
            "flying"
        ],
        "desc": "Combee is a dual-type Bug and Flying Pokemon in its non-fully-evolved form. Its strengths include being strong against Grass, Fighting, Ground, and Bug types. However, it is weak to Rock, Electric, and Ice types."
    },
    {
        "id": 416,
        "name": "Vespiquen",
        "types": [
            "bug",
            "flying"
        ],
        "desc": "Vespiquen is a dual-type Bug and Flying Pokemon. Its strengths include being strong against Grass, Fighting, Ground, and Bug types. However, it is weak to Rock, Electric, and Ice types."
    },
    {
        "id": 436,
        "name": "Bronzor",
        "isNfe": true,
        "types": [
            "steel",
            "psychic"
        ],
        "desc": "Bronzor is a dual-type Steel and Psychic Pokemon in its non-fully-evolved form. Its strengths include being resistant to Normal, Grass, Ice, Psychic, Rock, Dragon, Steel, and Fairy types. However, it is weak to Fire, Ground, Ghost, and Dark types."
    },
    {
        "id": 437,
        "name": "Bronzong",
        "types": [
            "steel",
            "psychic"
        ],
        "desc": "Bronzong is a dual-type Steel and Psychic fully evolved Pokemon. Its strengths include being resistant to Normal, Grass, Ice, Psychic, Rock, Dragon, Steel, and Fairy types. However, it is weak to Fire, Ground, Ghost, and Dark types."
    },
    {
        "id": 280,
        "name": "Ralts",
        "isNfe": true,
        "types": [
            "psychic",
            "fairy"
        ],
        "desc": "Ralts is a dual-type Psychic and Fairy Pokemon in its non-fully-evolved form. Its strengths include being strong against Fighting, Dragon, and Dark types. However, it is weak to Poison and Steel types."
    },
    {
        "id": 281,
        "name": "Kirlia",
        "isNfe": true,
        "types": [
            "psychic",
            "fairy"
        ],
        "desc": "Kirlia is a dual-type Psychic and Fairy Pokemon in its non-fully-evolved form. Its strengths include being strong against Fighting, Dragon, and Dark types. However, it is weak to Poison and Steel types."
    },
    {
        "id": 282,
        "name": "Gardevoir",
        "types": [
            "psychic",
            "fairy"
        ],
        "desc": "Gardevoir is a dual-type Psychic and Fairy fully evolved Pokemon. Its strengths include being strong against Fighting, Dragon, and Dark types. However, it is weak to Poison and Steel types."
    },
    {
        "id": 475,
        "name": "Gallade",
        "types": [
            "psychic",
            "fighting"
        ],
        "desc": "Gallade is a dual-type Psychic and Fighting fully evolved Pokemon. Its strengths include being strong against Fighting, Ground, and Poison types. However, it is weak to Flying, Ghost, and Fairy types."
    },
    {
        "id": 425,
        "name": "Drifloon",
        "isNfe": true,
        "types": [
            "ghost",
            "flying"
        ],
        "desc": "Drifloon is a dual-type Ghost and Flying Pokemon in its non-fully-evolved form. Its strengths include being strong against Fighting, Bug, and Grass types. However, it is weak to Electric, Ice, Rock, Dark, and Ghost types."
    },
    {
        "id": 426,
        "name": "Drifblim",
        "types": [
            "ghost",
            "flying"
        ],
        "desc": "Drifblim is a dual-type Ghost and Flying fully evolved Pokemon. Its strengths include being strong against Fighting, Bug, and Grass types. However, it is weak to Electric, Ice, Rock, Dark, and Ghost types."
    },
    {
        "id": 829,
        "name": "Gossifleur",
        "isNfe": true,
        "types": [
            "grass"
        ],
        "desc": "Gossifleur is a Grass-type Pokemon in its non-fully-evolved form. Its strengths include being strong against Water, Ground, and Rock types. However, it is weak to Fire, Ice, Poison, Flying, and Bug types."
    },
    {
        "id": 830,
        "name": "Eldegoss",
        "types": [
            "grass"
        ],
        "desc": "Eldegoss is a fully evolved Grass-type Pokemon. Its strengths include being strong against Water, Ground, and Rock types. However, it is weak to Fire, Ice, Poison, Flying, and Bug types."
    },
    {
        "id": 420,
        "name": "Cherubi",
        "isNfe": true,
        "types": [
            "grass"
        ],
        "desc": "Cherubi is a Grass-type Pokemon in its non-fully-evolved form. Its strengths include being strong against Water, Ground, and Rock types. However, it is weak to Fire, Ice, Poison, Flying, and Bug types."
    },
    {
        "id": 421,
        "name": "Cherrim",
        "types": [
            "grass"
        ],
        "forms": [
            {
                "name": "Cherrim",
                "types": [
                    "grass"
                ],
                "desc": "Cherrim in its standard form is a Grass-type Pokemon. Its strengths include being strong against Water, Ground, and Rock types. However, it is weak to Fire, Ice, Poison, Flying, and Bug types."
            },
            {
                "name": "Cherrim",
                "types": [
                    "grass"
                ],
                "spriteSuffix": "sunshine",
                "desc": "Cherrim in its Sunshine Form is a Grass-type Pokemon. Its strengths include being strong against Water, Ground, and Rock types. However, it is weak to Fire, Ice, Poison, Flying, and Bug types."
            }
        ]
    },
    {
        "id": 434,
        "name": "Stunky",
        "isNfe": true,
        "types": [
            "poison",
            "dark"
        ],
        "desc": "Stunky is a dual-type Poison and Dark Pokemon in its non-fully-evolved form. Its Poison type grants strengths against Grass, Fairy, and Bug types. Its Dark type gives it additional strengths against Psychic and Ghost types. However, it is weak to Ground types."
    },
    {
        "id": 435,
        "name": "Skuntank",
        "types": [
            "poison",
            "dark"
        ],
        "desc": "Skuntank is a dual-type Poison and Dark fully evolved Pokemon. Its Poison type grants strengths against Grass, Fairy, and Bug types. Its Dark type gives it additional strengths against Psychic and Ghost types. However, it is weak to Ground types."
    },
    {
        "id": 535,
        "name": "Tympole",
        "isNfe": true,
        "types": [
            "water"
        ],
        "desc": "Tympole is a Water-type Pokemon in its non-fully-evolved form. Its strengths include being strong against Fire, Ground, and Rock types. However, it is weak to Electric and Grass types."
    },
    {
        "id": 536,
        "name": "Palpitoad",
        "isNfe": true,
        "types": [
            "water",
            "ground"
        ],
        "desc": "Palpitoad is a dual-type Water and Ground Pokemon in its non-fully-evolved form. Its Water type grants strengths against Fire, Ground, and Rock types. Its Ground type gives it additional strength against Electric and Steel types. However, it is weak to Grass types."
    },
    {
        "id": 537,
        "name": "Seismitoad",
        "types": [
            "water",
            "ground"
        ],
        "desc": "Seismitoad is a dual-type Water and Ground fully evolved Pokemon. Its Water type grants strengths against Fire, Ground, and Rock types. Its Ground type gives it additional strength against Electric and Steel types. However, it is weak to Grass types."
    },
    {
        "id": 355,
        "name": "Duskull",
        "isNfe": true,
        "types": [
            "ghost"
        ],
        "desc": "Duskull is a Ghost-type Pokemon in its non-fully-evolved form. Its strengths include being strong against Psychic and Ghost types. However, it is weak to Dark types."
    },
    {
        "id": 356,
        "name": "Dusclops",
        "isNfe": true,
        "types": [
            "ghost"
        ],
        "desc": "Dusclops is a Ghost-type Pokemon in its non-fully-evolved form. Its strengths include being strong against Psychic and Ghost types. However, it is weak to Dark types."
    },
    {
        "id": 477,
        "name": "Dusknoir",
        "types": [
            "ghost"
        ],
        "desc": "Dusknoir is a Ghost-type fully evolved Pokemon. Its strengths include being strong against Psychic and Ghost types. However, it is weak to Dark types."
    },
    {
        "id": 66,
        "name": "Machop",
        "isNfe": true,
        "types": [
            "fighting"
        ],
        "desc": "Machop is a Fighting-type Pokemon in its non-fully-evolved form. Its strengths include being strong against Normal, Ice, Rock, Dark, and Steel types. However, it is weak to Flying, Psychic, and Fairy types."
    },
    {
        "id": 67,
        "name": "Machoke",
        "isNfe": true,
        "types": [
            "fighting"
        ],
        "desc": "Machoke is a Fighting-type Pokemon in its non-fully-evolved form. Its strengths include being strong against Normal, Ice, Rock, Dark, and Steel types. However, it is weak to Flying, Psychic, and Fairy types."
    },
    {
        "id": 68,
        "name": "Machamp",
        "types": [
            "fighting"
        ],
        "forms": [
            {
                "name": "Machamp",
                "types": [
                    "fighting"
                ],
                "desc": "Machamp is a fully evolved Fighting-type Pokemon. Its strengths include being strong against Normal, Ice, Rock, Dark, and Steel types. However, it is weak to Flying, Psychic, and Fairy types."
            },
            {
                "name": "Machamp Gigantamax",
                "types": [
                    "fighting"
                ],
                "spriteSuffix": "gigantamax",
                "isGigantamax": true,
                "desc": "Machamp in its Gigantamax form retains its Fighting type strengths and weaknesses."
            }
        ]
    },
    {
        "id": 92,
        "name": "Gastly",
        "isNfe": true,
        "types": [
            "ghost",
            "poison"
        ],
        "desc": "Gastly is a dual-type Ghost and Poison Pokemon in its non-fully-evolved form. Its strengths include being strong against Grass, Fairy, Bug, Poison, and Fighting types. However, it is weak to Ground and Psychic types."
    },
    {
        "id": 93,
        "name": "Haunter",
        "isNfe": true,
        "types": [
            "ghost",
            "poison"
        ],
        "desc": "Haunter is a dual-type Ghost and Poison Pokemon in its non-fully-evolved form. Its strengths include being strong against Grass, Fairy, Bug, Poison, and Fighting types. However, it is weak to Ground and Psychic types."
    },
    {
        "id": 94,
        "name": "Gengar",
        "types": [
            "ghost",
            "poison"
        ],
        "forms": [
            {
                "name": "Gengar",
                "types": [
                    "ghost",
                    "poison"
                ],
                "desc": "Gengar is a dual-type Ghost and Poison fully evolved Pokemon. Its strengths include being strong against Grass, Fairy, Bug, Poison, and Fighting types. However, it is weak to Ground and Psychic types."
            },
            {
                "name": "Gengar Gigantamax",
                "types": [
                    "ghost",
                    "poison"
                ],
                "spriteSuffix": "gigantamax",
                "isGigantamax": true,
                "desc": "Gengar in its Gigantamax form retains its Ghost and Poison type strengths and weaknesses."
            }
        ]
    },
    {
        "id": 129,
        "name": "Magikarp",
        "isNfe": true,
        "types": [
            "water"
        ],
        "desc": "Magikarp is a Water-type Pokemon in its non-fully-evolved form. Its strengths include being strong against Fire, Ground, and Rock types. However, it is weak to Electric and Grass types."
    },
    {
        "id": 130,
        "name": "Gyarados",
        "types": [
            "water",
            "flying"
        ],
        "desc": "Gyarados is a dual-type Water and Flying fully evolved Pokemon. Its Water type grants strengths against Fire, Ground, and Rock types. Its Flying type gives it an additional strength against Fighting types. However, it is weak to Electric types."
    },
    {
        "id": 118,
        "name": "Goldeen",
        "isNfe": true,
        "types": [
            "water"
        ],
        "desc": "Goldeen is a Water-type Pokemon in its non-fully-evolved form. Its strengths include being strong against Fire, Ground, and Rock types. However, it is weak to Electric and Grass types."
    },
    {
        "id": 119,
        "name": "Seaking",
        "types": [
            "water"
        ],
        "desc": "Seaking is a Water-type fully evolved Pokemon. Its strengths include being strong against Fire, Ground, and Rock types. However, it is weak to Electric and Grass types."
    },
    {
        "id": 223,
        "name": "Remoraid",
        "isNfe": true,
        "types": [
            "water"
        ],
        "desc": "Remoraid is a Water-type Pokemon in its non-fully-evolved form. Its strengths include being strong against Fire, Ground, and Rock types. However, it is weak to Electric and Grass types."
    },
    {
        "id": 224,
        "name": "Octillery",
        "types": [
            "water"
        ],
        "desc": "Octillery is a Water-type fully evolved Pokemon. Its strengths include being strong against Fire, Ground, and Rock types. However, it is weak to Electric and Grass types."
    },
    {
        "id": 90,
        "name": "Shellder",
        "isNfe": true,
        "types": [
            "water"
        ],
        "desc": "Shellder is a Water-type Pokemon in its non-fully-evolved form. Its strengths include being strong against Fire, Ground, and Rock types. However, it is weak to Electric and Grass types."
    },
    {
        "id": 91,
        "name": "Cloyster",
        "types": [
            "water",
            "ice"
        ],
        "desc": "Cloyster is a dual-type Water and Ice fully evolved Pokemon. Its Water type grants strengths against Fire, Ground, and Rock types. Its Ice type gives it additional strengths against Flying, Ground, Grass, and Dragon types. However, it is weak to Electric, Fighting, Rock, and Steel types."
    },
    {
        "id": 349,
        "name": "Feebas",
        "isNfe": true,
        "types": [
            "water"
        ],
        "desc": "Feebas is a Water-type Pokemon in its non-fully-evolved form. Its strengths include being strong against Fire, Ground, and Rock types. However, it is weak to Electric and Grass types."
    },
    {
        "id": 350,
        "name": "Milotic",
        "types": [
            "water"
        ],
        "desc": "Milotic is a Water-type fully evolved Pokemon. Its strengths include being strong against Fire, Ground, and Rock types. However, it is weak to Electric and Grass types."
    },
    {
        "id": 550,
        "name": "Basculin",
        "types": [
            "water"
        ],
        "forms": [
            {
                "name": "Basculin",
                "types": [
                    "water"
                ],
                "desc": "Basculin is a Water-type Pokemon. Its strengths include being strong against Fire, Ground, and Rock types. However, it is weak to Electric and Grass types."
            },
            {
                "name": "Basculin",
                "types": [
                    "water"
                ],
                "spriteSuffix": "bluestriped",
                "desc": "Basculin in its Blue-Striped Form is also a Water-type Pokemon with the same strengths and weaknesses."
            }
        ]
    },
    {
        "id": 746,
        "name": "Wishiwashi",
        "types": [
            "water"
        ],
        "forms": [
            {
                "name": "Wishiwashi School",
                "types": [
                    "water"
                ],
                "spriteSuffix": "school",
                "desc": "Wishiwashi in its School Form is a Water-type Pokemon with strengths against Fire, Ground, and Rock types. However, it is weak to Electric and Grass types."
            },
            {
                "name": "Wishiwashi",
                "types": [
                    "water"
                ],
                "desc": "Wishiwashi in its Solo Form retains its Water type strengths and weaknesses."
            }
        ]
    },
    {
        "id": 771,
        "name": "Pyukumuku",
        "types": [
            "water"
        ],
        "desc": "Pyukumuku is a Water-type Pokemon with strengths against Fire, Ground, and Rock types. However, it is weak to Electric and Grass types."
    },
    {
        "id": 568,
        "name": "Trubbish",
        "isNfe": true,
        "types": [
            "poison"
        ],
        "desc": "Trubbish is a Poison-type Pokemon in its non-fully-evolved form. Its strengths include being strong against Grass, Fairy, Bug, and Poison types. However, it is weak to Ground and Psychic types."
    },
    {
        "id": 569,
        "name": "Garbodor",
        "types": [
            "poison"
        ],
        "forms": [
            {
                "name": "Garbodor",
                "types": [
                    "poison"
                ],
                "desc": "Garbodor is a Poison-type fully evolved Pokemon. Its strengths include being strong against Grass, Fairy, Bug, and Poison types. However, it is weak to Ground and Psychic types."
            },
            {
                "name": "Garbodor Gigantamax",
                "types": [
                    "poison"
                ],
                "spriteSuffix": "gigantamax",
                "isGigantamax": true,
                "desc": "Garbodor in its Gigantamax form retains its Poison type strengths and weaknesses."
            }
        ]
    },
    {
        "id": 850,
        "name": "Sizzlipede",
        "isNfe": true,
        "types": [
            "fire",
            "bug"
        ],
        "desc": "Sizzlipede is a dual-type Fire and Bug Pokemon in its non-fully-evolved form. Its Fire type grants strengths against Grass, Bug, Ice, and Steel types. However, it is weak to Water, Rock, and Electric types."
    },
    {
        "id": 851,
        "name": "Centiskorch",
        "types": [
            "fire",
            "bug"
        ],
        "forms": [
            {
                "name": "Centiskorch",
                "types": [
                    "fire",
                    "bug"
                ],
                "desc": "Centiskorch is a dual-type Fire and Bug fully evolved Pokemon. Its Fire type grants strengths against Grass, Bug, Ice, and Steel types. Its Bug type gives it additional strengths against Psychic, Dark, and Grass types. However, it is weak to Water and Rock types."
            },
            {
                "name": "Centiskorch Gigantamax",
                "types": [
                    "fire",
                    "bug"
                ],
                "spriteSuffix": "gigantamax",
                "isGigantamax": true,
                "desc": "Centiskorch in its Gigantamax form retains its dual-type Fire and Bug strengths and weaknesses."
            }
        ]
    },
    {
        "id": 837,
        "name": "Rolycoly",
        "isNfe": true,
        "types": [
            "rock"
        ],
        "desc": "Rolycoly is a Rock-type Pokemon in its non-fully-evolved form. Its strengths include being strong against Fire, Ice, Flying, and Bug types. However, it is weak to Water, Grass, Ground, Steel, and Fighting types."
    },
    {
        "id": 838,
        "name": "Carkol",
        "isNfe": true,
        "types": [
            "rock",
            "fire"
        ],
        "desc": "Carkol is a dual-type Rock and Fire Pokemon in its non-fully-evolved form. Its Rock type grants strengths against Fire, Ice, Flying, and Bug types. Its Fire type gives it additional strengths against Grass, Bug, Steel, and Ice types. However, it is weak to Water, Ground, and Fighting types."
    },
    {
        "id": 839,
        "name": "Coalossal",
        "types": [
            "rock",
            "fire"
        ],
        "forms": [
            {
                "name": "Coalossal",
                "types": [
                    "rock",
                    "fire"
                ],
                "desc": "Coalossal is a dual-type Rock and Fire fully evolved Pokemon. Its Rock type grants strengths against Fire, Ice, Flying, and Bug types. Its Fire type gives it additional strengths against Grass, Bug, Steel, and Ice types. However, it is weak to Water, Ground, and Fighting types."
            },
            {
                "name": "Coalossal Gigantamax",
                "types": [
                    "rock",
                    "fire"
                ],
                "spriteSuffix": "gigantamax",
                "isGigantamax": true,
                "desc": "Coalossal in its Gigantamax form retains its dual-type Rock and Fire strengths and weaknesses."
            }
        ]
    },
    {
        "id": 50,
        "name": "Diglett",
        "isNfe": true,
        "types": [
            "ground"
        ],
        "desc": "Diglett is a Ground-type Pokemon in its non-fully-evolved form. Its strengths include being strong against Fire, Electric, Poison, Rock, and Steel types. However, it is weak to Water, Ice, and Grass types."
    },
    {
        "id": 51,
        "name": "Dugtrio",
        "types": [
            "ground"
        ],
        "desc": "Dugtrio is a Ground-type fully evolved Pokemon. Its strengths include being strong against Fire, Electric, Poison, Rock, and Steel types. However, it is weak to Water, Ice, and Grass types."
    },
    {
        "id": 529,
        "name": "Drilbur",
        "isNfe": true,
        "types": [
            "ground"
        ],
        "desc": "Drilbur is a Ground-type Pokemon in its non-fully-evolved form. Its strengths include being strong against Fire, Electric, Poison, Rock, and Steel types. However, it is weak to Water, Ice, and Grass types."
    },
    {
        "id": 530,
        "name": "Excadrill",
        "types": [
            "ground",
            "steel"
        ],
        "desc": "Excadrill is a dual-type Ground and Steel fully evolved Pokemon. Its Ground type grants strengths against Fire, Electric, Poison, Rock, and Steel types. Its Steel type gives it additional strengths against Ice, Fairy, and Rock types. However, it is weak to Water, Ice, Grass, and Fighting types."
    },
    {
        "id": 524,
        "name": "Roggenrola",
        "isNfe": true,
        "types": [
            "rock"
        ],
        "desc": "Roggenrola is a Rock-type Pokemon in its non-fully-evolved form. Its strengths include being strong against Fire, Ice, Flying, Bug, and Normal types. However, it is weak to Water, Grass, Fighting, Ground, and Steel types."
    },
    {
        "id": 525,
        "name": "Boldore",
        "isNfe": true,
        "types": [
            "rock"
        ],
        "desc": "Boldore is a Rock-type Pokemon in its non-fully-evolved form. Its strengths include being strong against Fire, Ice, Flying, Bug, and Normal types. However, it is weak to Water, Grass, Fighting, Ground, and Steel types."
    },
    {
        "id": 526,
        "name": "Gigalith",
        "types": [
            "rock"
        ],
        "desc": "Gigalith is a Rock-type fully evolved Pokemon. Its strengths include being strong against Fire, Ice, Flying, Bug, and Normal types. However, it is weak to Water, Grass, Fighting, Ground, and Steel types."
    },
    {
        "id": 532,
        "name": "Timburr",
        "isNfe": true,
        "types": [
            "fighting"
        ],
        "desc": "Timburr is a Fighting-type Pokemon in its non-fully-evolved form. Its strengths include being strong against Normal, Ice, Rock, Dark, and Steel types. However, it is weak to Psychic and Flying types."
    },
    {
        "id": 533,
        "name": "Gurdurr",
        "isNfe": true,
        "types": [
            "fighting"
        ],
        "desc": "Gurdurr is a Fighting-type Pokemon in its non-fully-evolved form. Its strengths include being strong against Normal, Ice, Rock, Dark, and Steel types. However, it is weak to Psychic and Flying types."
    },
    {
        "id": 534,
        "name": "Conkeldurr",
        "types": [
            "fighting"
        ],
        "desc": "Conkeldurr is a Fighting-type fully evolved Pokemon. Its strengths include being strong against Normal, Ice, Rock, Dark, and Steel types. However, it is weak to Psychic and Flying types."
    },
    {
        "id": 527,
        "name": "Woobat",
        "isNfe": true,
        "types": [
            "psychic",
            "flying"
        ],
        "desc": "Woobat is a dual-type Psychic and Flying Pokemon in its non-fully-evolved form. Its Psychic type grants strengths against Fighting and Poison types. However, it is weak to Electric, Ice, Dark, Rock, Ghost, and Steel types."
    },
    {
        "id": 528,
        "name": "Swoobat",
        "types": [
            "psychic",
            "flying"
        ],
        "desc": "Swoobat is a dual-type Psychic and Flying fully evolved Pokemon. Its Psychic type grants strengths against Fighting and Poison types. However, it is weak to Electric, Ice, Dark, Rock, Ghost, and Steel types."
    },
    {
        "id": 714,
        "name": "Noibat",
        "isNfe": true,
        "types": [
            "flying",
            "dragon"
        ],
        "desc": "Noibat is a dual-type Flying and Dragon Pokemon in its non-fully-evolved form. Its Dragon type grants strengths against Dragon, Grass, Water, and Electric types. However, it is weak to Ice, Rock, Dragon, Fairy, and other Dragon types."
    },
    {
        "id": 715,
        "name": "Noivern",
        "types": [
            "flying",
            "dragon"
        ],
        "desc": "Noivern is a dual-type Flying and Dragon fully evolved Pokemon. Its Dragon type grants strengths against Dragon, Grass, Water, and Electric types. Its Flying type gives it additional strengths against Fighting and Bug types. However, it is weak to Ice, Rock, Dragon, Fairy, and other Dragon types."
    },
    {
        "id": 95,
        "name": "Onix",
        "isNfe": true,
        "types": [
            "rock",
            "ground"
        ],
        "desc": "Onix is a dual-type Rock and Ground Pokemon in its non-fully-evolved form. Its Rock type grants strengths against Fire, Ice, Flying, Bug, and Normal types. However, it is weak to Water, Grass, Ice, Fighting, Ground, and Steel types."
    },
    {
        "id": 208,
        "name": "Steelix",
        "types": [
            "steel",
            "ground"
        ],
        "desc": "Steelix is a dual-type Steel and Ground fully evolved Pokemon. Its Steel type grants strengths against Ice, Rock, Fairy, and other Steel types. Its Ground type gives it additional strengths against Poison, Steel, Electric, and Fire types. However, it is weak to Water, Ground, Fire, and Fighting types."
    },
    {
        "id": 846,
        "name": "Arrokuda",
        "isNfe": true,
        "types": [
            "water"
        ],
        "desc": "Arrokuda is a Water-type Pokemon in its non-fully-evolved form. Its strengths include being strong against Fire, Ground, and Rock types. However, it is weak to Electric and Grass types."
    },
    {
        "id": 847,
        "name": "Barraskewda",
        "types": [
            "water"
        ],
        "desc": "Barraskewda is a Water-type fully evolved Pokemon. Its strengths include being strong against Fire, Ground, and Rock types. However, it is weak to Electric and Grass types."
    },
    {
        "id": 52,
        "name": "Meowth",
        "isNfe": true,
        "types": [
            "normal"
        ],
        "forms": [
            {
                "name": "Meowth",
                "isNfe": true,
                "types": [
                    "normal"
                ],
                "desc": "Meowth is a Normal-type Pokemon in its non-fully-evolved form. Its strengths include being strong against Fighting types. However, it is weak to Fighting types."
            },
            {
                "name": "Meowth Galar",
                "isNfe": true,
                "types": [
                    "steel"
                ],
                "spriteSuffix": "galar",
                "desc": "Galarian Meowth is a Steel-type Pokemon in its non-fully-evolved form. Its strengths include being strong against Ice, Rock, and Fairy types. However, it is weak to Ground, Fire, and Fighting types."
            },
            {
                "name": "Meowth Gigantamax",
                "isNfe": true,
                "types": [
                    "normal"
                ],
                "spriteSuffix": "gigantamax",
                "isGigantamax": true,
                "desc": "Meowth in its Gigantamax form retains its Normal type strengths and weaknesses."
            }
        ]
    },
    {
        "id": 863,
        "name": "Perrserker",
        "types": [
            "steel"
        ],
        "desc": "Perrserker is a Steel-type Pokemon. Its strengths include being strong against Ice, Rock, Fairy, and other Steel types. However, it is weak to Ground and Fighting types."
    },
    {
        "id": 53,
        "name": "Persian",
        "types": [
            "normal"
        ],
        "desc": "Persian is a Normal-type Pokemon. Its strengths include being strong against Fighting types. However, it is weak to Fighting types."
    },
    {
        "id": 868,
        "name": "Milcery",
        "isNfe": true,
        "types": [
            "fairy"
        ],
        "desc": "Milcery is a Fairy-type Pokemon in its non-fully-evolved form. Its strengths include being strong against Fighting and Dragon types. However, it is weak to Poison and Steel types."
    },
    {
        "id": 869,
        "name": "Alcremie",
        "types": [
            "fairy"
        ],
        "forms": [
            {
                "name": "Alcremie",
                "types": [
                    "fairy"
                ],
                "desc": "Alcremie is a Fairy-type fully evolved Pokemon. Its strengths include being strong against Fighting and Dragon types. However, it is weak to Poison and Steel types."
            },
            {
                "name": "Alcremie Gigantamax",
                "types": [
                    "fairy"
                ],
                "spriteSuffix": "gigantamax",
                "isGigantamax": true,
                "desc": "Alcremie in its Gigantamax form retains its Fairy type strengths and weaknesses."
            }
        ]
    },
    {
        "id": 742,
        "name": "Cutiefly",
        "isNfe": true,
        "types": [
            "bug",
            "fairy"
        ],
        "desc": "Cutiefly is a dual-type Bug and Fairy Pokemon in its non-fully-evolved form. Its Bug type grants strengths against Grass, Psychic, and Dark types. However, it is weak to Flying, Rock, Fire, Steel, and other Bug types."
    },
    {
        "id": 743,
        "name": "Ribombee",
        "types": [
            "bug",
            "fairy"
        ],
        "desc": "Ribombee is a dual-type Bug and Fairy fully evolved Pokemon. Its Bug type grants strengths against Grass, Psychic, and Dark types. However, it is weak to Flying, Rock, Fire, Steel, and other Bug types."
    },
    {
        "id": 597,
        "name": "Ferroseed",
        "isNfe": true,
        "types": [
            "grass",
            "steel"
        ],
        "desc": "Ferroseed is a dual-type Grass and Steel Pokemon in its non-fully-evolved form. Its Grass type grants strengths against Water and Ground types. However, it is weak to Fire, Ice, Poison, Flying, and Steel types."
    },
    {
        "id": 598,
        "name": "Ferrothorn",
        "types": [
            "grass",
            "steel"
        ],
        "desc": "Ferrothorn is a dual-type Grass and Steel fully evolved Pokemon. Its Grass type grants strengths against Water and Ground types. Its Steel type gives it additional strengths against Ice, Rock, Fairy, and other Steel types. However, it is weak to Fire, Fighting, and Ground types."
    },
    {
        "id": 710,
        "name": "Pumpkaboo",
        "isNfe": true,
        "types": [
            "ghost",
            "grass"
        ],
        "forms": [
            {
                "name": "Pumpkaboo",
                "isNfe": true,
                "types": [
                    "ghost",
                    "grass"
                ],
                "spriteSuffix": "super",
                "desc": "Pumpkaboo in its Super Size form is a dual-type Ghost and Grass Pokemon in its non-fully-evolved form. Its Grass type grants strengths against Water and Ground types. However, it is weak to Fire, Ice, Ghost, and Dark types."
            },
            {
                "name": "Pumpkaboo",
                "isNfe": true,
                "types": [
                    "ghost",
                    "grass"
                ],
                "spriteSuffix": "large",
                "desc": "Pumpkaboo in its Large Size form is a dual-type Ghost and Grass Pokemon in its non-fully-evolved form. Its Grass type grants strengths against Water and Ground types. However, it is weak to Fire, Ice, Ghost, and Dark types."
            },
            {
                "name": "Pumpkaboo",
                "isNfe": true,
                "types": [
                    "ghost",
                    "grass"
                ],
                "spriteSuffix": "small",
                "desc": "Pumpkaboo in its Small Size form is a dual-type Ghost and Grass Pokemon in its non-fully-evolved form. Its Grass type grants strengths against Water and Ground types. However, it is weak to Fire, Ice, Ghost, and Dark types."
            }
        ]
    },
    {
        "id": 711,
        "name": "Gourgeist",
        "types": [
            "ghost",
            "grass"
        ],
        "forms": [
            {
                "name": "Gourgeist",
                "types": [
                    "ghost",
                    "grass"
                ],
                "spriteSuffix": "large",
                "desc": "Gourgeist in its Large Size form is a dual-type Ghost and Grass fully evolved Pokemon. Its Grass type grants strengths against Water and Ground types. However, it is weak to Fire, Ice, Ghost, and Dark types."
            },
            {
                "name": "Gourgeist",
                "types": [
                    "ghost",
                    "grass"
                ],
                "spriteSuffix": "small",
                "desc": "Gourgeist in its Small Size form is a dual-type Ghost and Grass fully evolved Pokemon. Its Grass type grants strengths against Water and Ground types. However, it is weak to Fire, Ice, Ghost, and Dark types."
            },
            {
                "name": "Gourgeist",
                "types": [
                    "ghost",
                    "grass"
                ],
                "spriteSuffix": "super",
                "desc": "Gourgeist in its Super Size form is a dual-type Ghost and Grass fully evolved Pokemon. Its Grass type grants strengths against Water and Ground types. However, it is weak to Fire, Ice, Ghost, and Dark types."
            }
        ]
    },
    {
        "id": 172,
        "name": "Pichu",
        "isNfe": true,
        "types": [
            "electric"
        ],
        "desc": "Pichu is an Electric-type Pokemon in its non-fully-evolved form. Its Electric type grants strengths against Water and Flying types. However, it is weak to Ground types."
    },
    {
        "id": 25,
        "name": "Pikachu",
        "isNfe": true,
        "types": [
            "electric"
        ],
        "forms": [
            {
                "name": "Pikachu",
                "isNfe": true,
                "types": [
                    "electric"
                ],
                "desc": "Pikachu is an Electric-type Pokemon in its non-fully-evolved form. Its Electric type grants strengths against Water and Flying types. However, it is weak to Ground types."
            },
            {
                "name": "Pikachu",
                "isNfe": true,
                "types": [
                    "electric"
                ],
                "spriteSuffix": "hat",
                "desc": "Pikachu in its Hat-wearing form retains its Electric type strengths and weaknesses."
            },
            {
                "name": "Pikachu Gigantamax",
                "isNfe": true,
                "types": [
                    "electric"
                ],
                "spriteSuffix": "gigantamax",
                "isGigantamax": true,
                "desc": "Pikachu in its Gigantamax form retains its Electric type strengths and weaknesses."
            }
        ]
    },
    {
        "id": 26,
        "name": "Raichu",
        "types": [
            "electric"
        ],
        "desc": "Raichu is an Electric-type fully evolved Pokemon. Its Electric type grants strengths against Water and Flying types. However, it is weak to Ground types."
    },
    {
        "id": 133,
        "name": "Eevee",
        "isNfe": true,
        "types": [
            "normal"
        ],
        "forms": [
            {
                "name": "Eevee",
                "isNfe": true,
                "types": [
                    "normal"
                ],
                "desc": "Eevee is a Normal-type Pokemon in its non-fully-evolved form. Its strengths include being strong against Fighting types. However, it is weak to Fighting types."
            },
            {
                "name": "Eevee Gigantamax",
                "isNfe": true,
                "types": [
                    "normal"
                ],
                "spriteSuffix": "gigantamax",
                "isGigantamax": true,
                "desc": "Eevee in its Gigantamax form retains its Normal type strengths and weaknesses."
            }
        ]
    },
    {
        "id": 134,
        "name": "Vaporeon",
        "types": [
            "water"
        ],
        "desc": "Vaporeon is a Water-type Pokemon. Its strengths include being strong against Fire, Ground, and Rock types. However, it is weak to Electric and Grass types."
    },
    {
        "id": 135,
        "name": "Jolteon",
        "types": [
            "electric"
        ],
        "desc": "Jolteon is an Electric-type Pokemon known for its lightning-fast speed and sharp spiky fur. It can release powerful electric shocks from its fur when threatened."
    },
    {
        "id": 136,
        "name": "Flareon",
        "types": [
            "fire"
        ],
        "desc": "Flareon is a Fire-type Pokemon with a fiery mane of fur and a fiery temperament. It can unleash intense flames to protect itself."
    },
    {
        "id": 196,
        "name": "Espeon",
        "types": [
            "psychic"
        ],
        "desc": "Espeon is a Psychic-type Pokemon with mystical abilities. It is known for its elegant appearance and its ability to predict its trainer's feelings."
    },
    {
        "id": 197,
        "name": "Umbreon",
        "types": [
            "dark"
        ],
        "desc": "Umbreon is a Dark-type Pokemon with a mysterious and nocturnal nature. It is said to have the ability to purify foul water."
    },
    {
        "id": 470,
        "name": "Leafeon",
        "types": [
            "grass"
        ],
        "desc": "Leafeon is a Grass-type Pokemon with the power to manipulate nature. Its body is covered in lush foliage, and it can cause plants to bloom."
    },
    {
        "id": 471,
        "name": "Glaceon",
        "types": [
            "ice"
        ],
        "desc": "Glaceon is an Ice-type Pokemon with a frosty appearance. It can freeze the moisture in the air to create ice crystals and cold gusts of wind."
    },
    {
        "id": 700,
        "name": "Sylveon",
        "types": [
            "fairy"
        ],
        "desc": "Sylveon is a Fairy-type Pokemon known for its graceful and affectionate nature. It can calm hostile emotions with its ribbon-like feelers."
    },
    {
        "id": 840,
        "name": "Applin",
        "types": [
            "grass",
            "dragon"
        ],
        "desc": "Applin is a unique Grass and Dragon-type Pokemon known for its apple-shaped appearance. It's often found in orchards and occasionally eaten by humans."
    },
    {
        "id": 841,
        "name": "Flapple",
        "types": [
            "grass",
            "dragon"
        ],
        "desc": "Flapple is the evolved form of Applin and retains its apple motif. It is a Grass and Dragon-type Pokemon with a mischievous personality."
    },
    {
        "id": 842,
        "name": "Appletun",
        "types": [
            "grass",
            "dragon"
        ],
        "desc": "Appletun is another evolved form of Applin, resembling an apple pie. It's a Grass and Dragon-type Pokemon known for its calm and gentle nature."
    },
    {
        "id": 677,
        "name": "Espurr",
        "types": [
            "psychic"
        ],
        "desc": "Espurr is a Psychic-type Pokemon with intense psychic power. Despite its cute appearance, it can exhibit destructive psychic energy when upset."
    },
    {
        "id": 678,
        "name": "Meowstic",
        "types": [
            "psychic"
        ],
        "desc": "Meowstic is the evolved form of Espurr and is also a Psychic-type Pokemon. It has strong psychic abilities and is known for its intelligence."
    },
    {
        "id": 684,
        "name": "Swirlix",
        "types": [
            "fairy"
        ],
        "desc": "Swirlix is a Fairy-type Pokemon with a cotton candy-like appearance. It can create sweet, cottony threads to ensnare and immobilize its prey."
    },
    {
        "id": 685,
        "name": "Slurpuff",
        "types": [
            "fairy"
        ],
        "desc": "Slurpuff is the evolved form of Swirlix, known for its love of sweets. It can identify the feelings of others by the scents they give off."
    },
    {
        "id": 682,
        "name": "Spritzee",
        "types": [
            "fairy"
        ],
        "desc": "Spritzee is a Fairy-type Pokemon that emits a sweet, fragrant scent. Its scent has healing properties and is used in making perfume."
    },
    {
        "id": 683,
        "name": "Aromatisse",
        "types": [
            "fairy"
        ],
        "desc": "Aromatisse is the evolved form of Spritzee, known for its elegant dances. Its captivating dance moves have a soothing and calming effect."
    },
    {
        "id": 751,
        "name": "Dewpider",
        "types": [
            "water",
            "bug"
        ],
        "desc": "Dewpider is a Water and Bug-type Pokemon found near bodies of water. It uses water bubbles for both mobility and hunting."
    },
    {
        "id": 752,
        "name": "Araquanid",
        "types": [
            "water",
            "bug"
        ],
        "desc": "Araquanid is the evolved form of Dewpider, known for its strong and sturdy webbing. It's a skilled water hunter and can be aggressive when provoked."
    },
    {
        "id": 360,
        "name": "Wynaut",
        "types": [
            "psychic"
        ],
        "desc": "Wynaut is a Psychic-type Pokemon that loves to mimic others. It's often seen with a cheerful disposition and enjoys spreading happiness."
    },
    {
        "id": 202,
        "name": "Wobbuffet",
        "types": [
            "psychic"
        ],
        "desc": "Wobbuffet is a Psychic-type Pokemon known for its counterattacking abilities. It may seem passive, but it can strike back with powerful moves."
    },
    {
        "id": 83,
        "name": "Farfetch'd",
        "types": [
            "normal",
            "flying"
        ],
        "desc": "Farfetch'd is a Normal and Flying-type Pokemon with a leak of green onions that it uses as a weapon. In the Galar region, it has an evolved form."
    },
    {
        "id": 865,
        "name": "Sirfetch'd",
        "types": [
            "fighting"
        ],
        "desc": "Sirfetch'd is the Galarian evolved form of Farfetch'd. It's a Fighting-type Pokemon that wields a mighty leek lance in battle."
    },
    {
        "id": 170,
        "name": "Chinchou",
        "types": [
            "water",
            "electric"
        ],
        "desc": "Chinchou is a Water and Electric-type Pokemon. It emits a soft glow from its antennae while swimming at night and has a docile nature."
    },
    {
        "id": 171,
        "name": "Lanturn",
        "types": [
            "water",
            "electric"
        ],
        "desc": "Lanturn is the evolved form of Chinchou, known for its bioluminescent abilities. It lights up the ocean floor and can communicate using light patterns."
    },
    {
        "id": 453,
        "name": "Croagunk",
        "isNfe": true,
        "types": [
            "poison",
            "fighting"
        ],
        "desc": "Croagunk is a Poison and Fighting-type Pokemon known for its toxic skin secretions. It uses its poison for both offense and defense."
    },
    {
        "id": 454,
        "name": "Toxicroak",
        "types": [
            "poison",
            "fighting"
        ],
        "desc": "Toxicroak is the evolved form of Croagunk and retains its Poison and Fighting typing. It uses its fists to deliver powerful, toxic punches."
    },
    {
        "id": 559,
        "name": "Scraggy",
        "isNfe": true,
        "types": [
            "dark",
            "fighting"
        ],
        "desc": "Scraggy is a Dark and Fighting-type Pokemon with a relaxed attitude. It has a unique appearance with sagging pants and a hood."
    },
    {
        "id": 560,
        "name": "Scrafty",
        "types": [
            "dark",
            "fighting"
        ],
        "desc": "Scrafty is the evolved form of Scraggy and maintains its Dark and Fighting typing. It has a rebellious and confrontational nature."
    },
    {
        "id": 618,
        "name": "Stunfisk",
        "types": [
            "ground",
            "electric"
        ],
        "desc": "Stunfisk is a Ground and Electric-type Pokemon that hides beneath mud and shocks unsuspecting prey. In the Galar region, it has a Steel-type variant."
    },
    {
        "id": 213,
        "name": "Shuckle",
        "types": [
            "bug",
            "rock"
        ],
        "desc": "Shuckle is a unique Bug and Rock-type Pokemon known for its extremely high defenses. It stores berries inside its rocky shell."
    },
    {
        "id": 339,
        "name": "Barboach",
        "isNfe": true,
        "types": [
            "water",
            "ground"
        ],
        "desc": "Barboach is a Water and Ground-type Pokemon found in muddy water. It can live in harsh conditions and adapt to different environments."
    },
    {
        "id": 340,
        "name": "Whiscash",
        "types": [
            "water",
            "ground"
        ],
        "desc": "Whiscash is the evolved form of Barboach and retains its Water and Ground typing. It has a large, powerful tail it uses for swimming and attacks."
    },
    {
        "id": 422,
        "name": "Shellos",
        "isNfe": true,
        "types": [
            "water"
        ],
        "desc": "Shellos is a Water-type Pokemon known for its soft, jelly-like body. It has different appearances depending on its habitat, with an East Sea form."
    },
    {
        "id": 423,
        "name": "Gastrodon",
        "types": [
            "water",
            "ground"
        ],
        "desc": "Gastrodon is the evolved form of Shellos and maintains its Water and Ground typing. It has an East Sea form and is skilled in battling in water environments."
    },
    {
        "id": 767,
        "name": "Wimpod",
        "isNfe": true,
        "types": [
            "bug",
            "water"
        ],
        "desc": "Wimpod is a timid and cowardly Pokemon that often flees from danger."
    },
    {
        "id": 768,
        "name": "Golisopod",
        "types": [
            "bug",
            "water"
        ],
        "desc": "Golisopod is a formidable Bug/Water-type Pokemon known for its strength and resilience."
    },
    {
        "id": 688,
        "name": "Binacle",
        "isNfe": true,
        "types": [
            "rock",
            "water"
        ],
        "desc": "Binacle is a unique dual-type Rock/Water Pokemon, resembling two barnacles."
    },
    {
        "id": 689,
        "name": "Barbaracle",
        "types": [
            "rock",
            "water"
        ],
        "desc": "Barbaracle is the evolved form of Binacle, known for its powerful limbs and rock-crushing abilities."
    },
    {
        "id": 222,
        "name": "Corsola",
        "types": [
            "water",
            "rock"
        ],
        "forms": [
            {
                "name": "Corsola",
                "types": [
                    "water",
                    "rock"
                ]
            },
            {
                "name": "Corsola Galar",
                "isNfe": true,
                "types": [
                    "ghost"
                ],
                "spriteSuffix": "galar"
            }
        ],
        "desc": "Corsola is a Water/Rock-type Pokemon with a gentle and coral-like appearance."
    },
    {
        "id": 864,
        "name": "Cursola",
        "types": [
            "ghost"
        ],
        "desc": "Cursola is the evolved form of Galarian Corsola, and it's known for its eerie, ghostly presence."
    },
    {
        "id": 859,
        "name": "Impidimp",
        "isNfe": true,
        "types": [
            "dark",
            "fairy"
        ],
        "desc": "Impidimp is a mischievous and playful Dark/Fairy-type Pokemon."
    },
    {
        "id": 860,
        "name": "Morgrem",
        "isNfe": true,
        "types": [
            "dark",
            "fairy"
        ],
        "desc": "Morgrem is the evolved form of Impidimp, and it continues to be a trickster."
    },
    {
        "id": 861,
        "name": "Grimmsnarl",
        "types": [
            "dark",
            "fairy"
        ],
        "forms": [
            {
                "name": "Grimmsnarl",
                "types": [
                    "dark",
                    "fairy"
                ]
            },
            {
                "name": "Grimmsnarl Gigantamax",
                "types": [
                    "dark",
                    "fairy"
                ],
                "spriteSuffix": "gigantamax",
                "isGigantamax": true
            }
        ],
        "desc": "Grimmsnarl is a menacing Dark/Fairy-type Pokemon known for its Gigantamax form."
    },
    {
        "id": 856,
        "name": "Hatenna",
        "isNfe": true,
        "types": [
            "psychic"
        ],
        "desc": "Hatenna is a young and Psychic-type Pokemon known for its psychic abilities."
    },
    {
        "id": 857,
        "name": "Hattrem",
        "isNfe": true,
        "types": [
            "psychic"
        ],
        "desc": "Hattrem is the evolved form of Hatenna, and it continues to develop its psychic powers."
    },
    {
        "id": 858,
        "name": "Hatterene",
        "types": [
            "psychic",
            "fairy"
        ],
        "forms": [
            {
                "name": "Hatterene",
                "types": [
                    "psychic",
                    "fairy"
                ]
            },
            {
                "name": "Hatterene Gigantamax",
                "types": [
                    "psychic",
                    "fairy"
                ],
                "spriteSuffix": "gigantamax",
                "isGigantamax": true
            }
        ],
        "desc": "Hatterene is a Psychic/Fairy-type Pokemon known for its Gigantamax form."
    },
    {
        "id": 757,
        "name": "Salandit",
        "isNfe": true,
        "types": [
            "poison",
            "fire"
        ],
        "desc": "Salandit is a Poison/Fire-type Pokemon known for its toxic fumes and fiery attacks."
    },
    {
        "id": 758,
        "name": "Salazzle",
        "types": [
            "poison",
            "fire"
        ],
        "desc": "Salazzle is the evolved form of Salandit, and it's a fiery and venomous Pokemon."
    },
    {
        "id": 624,
        "name": "Pawniard",
        "isNfe": true,
        "types": [
            "dark",
            "steel"
        ],
        "desc": "Pawniard is a dual-type Dark/Steel Pokemon with sharp blades and a cunning nature."
    },
    {
        "id": 625,
        "name": "Bisharp",
        "types": [
            "dark",
            "steel"
        ],
        "desc": "Bisharp is the evolved form of Pawniard, known for its strategic and calculating personality."
    },
    {
        "id": 538,
        "name": "Throh",
        "types": [
            "fighting"
        ],
        "desc": "Throh is a powerful Fighting-type Pokemon known for its judo-inspired fighting style."
    },
    {
        "id": 539,
        "name": "Sawk",
        "types": [
            "fighting"
        ],
        "desc": "Sawk is a dedicated Fighting-type Pokemon with a strong sense of discipline."
    },
    {
        "id": 109,
        "name": "Koffing",
        "isNfe": true,
        "types": [
            "poison"
        ],
        "desc": "Koffing is a Poison-type Pokemon known for emitting poisonous gases."
    },
    {
        "id": 110,
        "name": "Weezing",
        "types": [
            "poison"
        ],
        "forms": [
            {
                "name": "Weezing",
                "types": [
                    "poison"
                ]
            },
            {
                "name": "Weezing Galar",
                "types": [
                    "poison",
                    "fairy"
                ],
                "spriteSuffix": "galar"
            }
        ],
        "desc": "Weezing is a Poison-type Pokemon that comes in two regional forms, one of which is part Fairy-type."
    },
    {
        "id": 438,
        "name": "Bonsly",
        "isNfe": true,
        "types": [
            "rock"
        ],
        "desc": "Bonsly is a Rock-type Pokemon known for its rocky appearance and tendency to mimic Sudowoodo."
    },
    {
        "id": 185,
        "name": "Sudowoodo",
        "types": [
            "rock"
        ],
        "desc": "Sudowoodo is a deceptive Rock-type Pokemon that often disguises itself as a tree."
    },
    {
        "id": 173,
        "name": "Cleffa",
        "isNfe": true,
        "types": [
            "fairy"
        ],
        "desc": "Cleffa is a cute and Fairy-type Pokemon often associated with celestial events."
    },
    {
        "id": 35,
        "name": "Clefairy",
        "isNfe": true,
        "types": [
            "fairy"
        ],
        "desc": "Clefairy is a Fairy-type Pokemon known for its moon-related lore and love of dancing."
    },
    {
        "id": 36,
        "name": "Clefable",
        "types": [
            "fairy"
        ],
        "desc": "Clefable is the evolved form of Clefairy, and it's a Fairy-type Pokemon with a mystical presence."
    },
    {
        "id": 175,
        "name": "Togepi",
        "isNfe": true,
        "types": [
            "fairy"
        ],
        "desc": "Togepi is a Fairy-type Pokemon known for its eggshell and the happiness it brings to those who encounter it."
    },
    {
        "id": 176,
        "name": "Togetic",
        "isNfe": true,
        "types": [
            "fairy",
            "flying"
        ],
        "desc": "Togetic is the evolved form of Togepi, and it's known for its joyful and flying abilities."
    },
    {
        "id": 468,
        "name": "Togekiss",
        "types": [
            "fairy",
            "flying"
        ],
        "desc": "Togekiss is the final evolution of Togepi, and it's a graceful and compassionate Fairy/Flying-type Pokemon."
    },
    {
        "id": 446,
        "name": "Munchlax",
        "isNfe": true,
        "types": [
            "normal"
        ],
        "desc": "Munchlax is a Normal-type Pokemon with a big appetite and a love for eating."
    },
    {
        "id": 143,
        "name": "Snorlax",
        "types": [
            "normal"
        ],
        "forms": [
            {
                "name": "Snorlax",
                "types": [
                    "normal"
                ]
            },
            {
                "name": "Snorlax Gigantamax",
                "types": [
                    "normal"
                ],
                "spriteSuffix": "gigantamax",
                "isGigantamax": true
            }
        ],
        "desc": "Snorlax is a massive and powerful Normal-type Pokemon with a Gigantamax form."
    },
    {
        "id": 546,
        "name": "Cottonee",
        "isNfe": true,
        "types": [
            "grass",
            "fairy"
        ],
        "desc": "Cottonee is a Grass/Fairy-type Pokemon known for its cotton-like appearance and seeds."
    },
    {
        "id": 547,
        "name": "Whimsicott",
        "isNfe": true,
        "types": [
            "grass",
            "fairy"
        ],
        "desc": "Whimsicott is the evolved form of Cottonee and is known for its playful and mischievous nature."
    },
    {
        "id": 111,
        "name": "Rhyhorn",
        "isNfe": true,
        "types": [
            "ground",
            "rock"
        ],
        "desc": "Rhyhorn is a Ground/Rock-type Pokemon known for its tough, armored appearance."
    },
    {
        "id": 112,
        "name": "Rhydon",
        "isNfe": true,
        "types": [
            "ground",
            "rock"
        ],
        "desc": "Rhydon is the evolved form of Rhyhorn, and it's a powerful Ground/Rock-type Pokemon."
    },
    {
        "id": 464,
        "name": "Rhyperior",
        "types": [
            "ground",
            "rock"
        ],
        "desc": "Rhyperior is the final evolution of Rhydon, known for its formidable strength and rocky armor."
    },
    {
        "id": 574,
        "name": "Gothita",
        "isNfe": true,
        "types": [
            "psychic"
        ],
        "desc": "Gothita is a Psychic-type Pokemon known for its psychic abilities and gothic appearance."
    },
    {
        "id": 575,
        "name": "Gothorita",
        "isNfe": true,
        "types": [
            "psychic"
        ],
        "desc": "Gothorita is the evolved form of Gothita, and it continues to develop its psychic powers."
    },
    {
        "id": 576,
        "name": "Gothitelle",
        "types": [
            "psychic"
        ],
        "desc": "Gothitelle is the final evolution of Gothita, known for its psychic prowess and elegant demeanor."
    },
    {
        "id": 577,
        "name": "Solosis",
        "isNfe": true,
        "types": [
            "psychic"
        ],
        "desc": "Solosis is a Psychic-type Pokemon known for its cellular structure and psychic potential."
    },
    {
        "id": 578,
        "name": "Duosion",
        "isNfe": true,
        "types": [
            "psychic"
        ],
        "desc": "Duosion is the evolved form of Solosis, and it possesses psychic abilities and a dual-cell structure."
    },
    {
        "id": 579,
        "name": "Reuniclus",
        "types": [
            "psychic"
        ],
        "desc": "Reuniclus is the final evolution of Solosis, and it's a Psychic-type Pokemon with powerful psychic abilities."
    },
    {
        "id": 588,
        "name": "Karrablast",
        "isNfe": true,
        "types": [
            "bug"
        ],
        "desc": "Karrablast is a Bug-type Pokemon known for its sharp horn and adaptability."
    },
    {
        "id": 589,
        "name": "Escavalier",
        "types": [
            "bug",
            "steel"
        ],
        "desc": "Escavalier is the evolved form of Karrablast, and it's a unique Bug/Steel-type Pokemon."
    },
    {
        "id": 616,
        "name": "Shelmet",
        "isNfe": true,
        "types": [
            "bug"
        ],
        "desc": "Shelmet is a Bug-type Pokemon known for its helmet-like appearance and interactions with Karrablast."
    },
    {
        "id": 617,
        "name": "Accelgor",
        "types": [
            "bug"
        ],
        "desc": "Accelgor is the evolved form of Shelmet, and it's a speedy and agile Bug-type Pokemon."
    },
    {
        "id": 605,
        "name": "Elgyem",
        "isNfe": true,
        "types": [
            "psychic"
        ],
        "desc": "Elgyem is a Psychic-type Pokemon with a mysterious extraterrestrial origin."
    },
    {
        "id": 606,
        "name": "Beheeyem",
        "types": [
            "psychic"
        ],
        "desc": "Beheeyem is the evolved form of Elgyem, known for its psychic powers and alien-like appearance."
    },
    {
        "id": 613,
        "name": "Cubchoo",
        "isNfe": true,
        "types": [
            "ice"
        ],
        "desc": "Cubchoo is an Ice-type Pokemon known for its cute yet chilly demeanor."
    },
    {
        "id": 614,
        "name": "Beartic",
        "types": [
            "ice"
        ],
        "desc": "Beartic is the evolved form of Cubchoo, known for its power over ice and frigid climate."
    },
    {
        "id": 627,
        "name": "Rufflet",
        "isNfe": true,
        "types": [
            "normal",
            "flying"
        ],
        "desc": "Rufflet is a Normal/Flying-type Pokemon known for its courage and desire to evolve into Braviary."
    },
    {
        "id": 628,
        "name": "Braviary",
        "types": [
            "normal",
            "flying"
        ],
        "desc": "Braviary is the evolved form of Rufflet, known for its bravery and strong sense of justice."
    },
    {
        "id": 629,
        "name": "Vullaby",
        "isNfe": true,
        "types": [
            "dark",
            "flying"
        ],
        "desc": "Vullaby is a Dark/Flying-type Pokemon with a vulture-like appearance and demeanor."
    },
    {
        "id": 630,
        "name": "Mandibuzz",
        "types": [
            "dark",
            "flying"
        ],
        "desc": "Mandibuzz is the evolved form of Vullaby, known for its scavenging and imposing presence."
    },
    {
        "id": 451,
        "name": "Skorupi",
        "isNfe": true,
        "types": [
            "poison",
            "bug"
        ],
        "desc": "Skorupi is a Poison/Bug-type Pokemon known for its scorpion-like appearance and venomous sting."
    },
    {
        "id": 452,
        "name": "Drapion",
        "types": [
            "poison",
            "dark"
        ],
        "desc": "Drapion is the evolved form of Skorupi, and it's a Poison/Dark-type Pokemon with a formidable presence."
    },
    {
        "id": 607,
        "name": "Litwick",
        "isNfe": true,
        "types": [
            "ghost",
            "fire"
        ],
        "desc": "Litwick is a Ghost/Fire-type Pokemon known for its cute yet spooky appearance."
    },
    {
        "id": 608,
        "name": "Lampent",
        "isNfe": true,
        "types": [
            "ghost",
            "fire"
        ],
        "desc": "Lampent is the evolved form of Litwick, and it's a Ghost/Fire-type Pokemon with a haunting presence."
    },
    {
        "id": 609,
        "name": "Chandelure",
        "types": [
            "ghost",
            "fire"
        ],
        "desc": "Chandelure is the final evolution of Litwick, known for its mesmerizing and eerie glow."
    },
    {
        "id": 686,
        "name": "Inkay",
        "isNfe": true,
        "types": [
            "dark",
            "psychic"
        ],
        "desc": "Inkay is a Dark/Psychic-type Pokemon known for its unique evolution method and psychic abilities."
    },
    {
        "id": 687,
        "name": "Malamar",
        "types": [
            "dark",
            "psychic"
        ],
        "desc": "Malamar is the evolved form of Inkay, known for its hypnotic powers and mysterious nature."
    },
    {
        "id": 215,
        "name": "Sneasel",
        "isNfe": true,
        "types": [
            "dark",
            "ice"
        ],
        "desc": "Sneasel is a Dark/Ice-type Pokemon known for its sneaky and agile behavior."
    },
    {
        "id": 461,
        "name": "Weavile",
        "types": [
            "dark",
            "ice"
        ],
        "desc": "Weavile is the evolved form of Sneasel, known for its speed, cunning, and icy abilities."
    },
    {
        "id": 302,
        "name": "Sableye",
        "types": [
            "dark",
            "ghost"
        ],
        "desc": "Sableye is a Dark/Ghost-type Pokemon with gem-like eyes and a mischievous demeanor."
    },
    {
        "id": 303,
        "name": "Mawile",
        "types": [
            "steel",
            "fairy"
        ],
        "desc": "Mawile is a Steel/Fairy-type Pokemon known for its intimidating appearance and dual steel jaws."
    },
    {
        "id": 556,
        "name": "Maractus",
        "types": [
            "grass"
        ],
        "desc": "Maractus is a Grass-type Pokemon known for its dancing and musical talents, resembling a cactus."
    },
    {
        "id": 561,
        "name": "Sigilyph",
        "types": [
            "psychic",
            "flying"
        ],
        "desc": "Sigilyph is a Psychic/Flying-type Pokemon known for its mysterious and ancient-looking appearance."
    },
    {
        "id": 447,
        "name": "Riolu",
        "isNfe": true,
        "types": [
            "fighting"
        ],
        "desc": "Riolu is a Fighting-type Pokemon known for its strong aura and potential to evolve into Lucario."
    },
    {
        "id": 448,
        "name": "Lucario",
        "types": [
            "fighting",
            "steel"
        ],
        "desc": "Lucario is a Fighting/Steel-type Pokemon known for its combat skills and aura sensing abilities."
    },
    {
        "id": 324,
        "name": "Torkoal",
        "types": [
            "fire"
        ],
        "desc": "Torkoal is a Fire-type Pokemon known for its steam-producing abilities and turtle-like appearance."
    },
    {
        "id": 778,
        "name": "Mimikyu",
        "types": [
            "ghost",
            "fairy"
        ],
        "desc": "Mimikyu is a Ghost/Fairy-type Pokemon known for its disguise and desire for friendship."
    },
    {
        "id": 878,
        "name": "Cufant",
        "isNfe": true,
        "types": [
            "steel"
        ],
        "desc": "Cufant is a Steel-type Pokemon known for its baby elephant appearance and hardy nature."
    },
    {
        "id": 879,
        "name": "Copperajah",
        "types": [
            "steel"
        ],
        "forms": [
            {
                "name": "Copperajah",
                "types": [
                    "steel"
                ],
                "desc": "Copperajah is a formidable Steel-type Pokemon with a large copper body and impressive power."
            },
            {
                "name": "Copperajah Gigantamax",
                "types": [
                    "steel"
                ],
                "spriteSuffix": "gigantamax",
                "isGigantamax": true,
                "desc": "Copperajah Gigantamax is a Gigantamax form of Copperajah, known for its gigantic size and unique abilities."
            }
        ]
    },
    {
        "id": 211,
        "name": "Qwilfish",
        "isNfe": true,
        "types": [
            "water",
            "poison"
        ],
        "desc": "Qwilfish is a Water/Poison-type Pokemon known for its spiky body and ability to inflate itself."
    },
    {
        "id": 592,
        "name": "Frillish",
        "isNfe": true,
        "types": [
            "water",
            "ghost"
        ],
        "forms": [
            {
                "name": "Frillish",
                "isNfe": true,
                "types": [
                    "water",
                    "ghost"
                ],
                "desc": "Frillish is a Water/Ghost-type Pokemon known for its ghostly appearance and its pre-evolution form."
            },
            {
                "name": "Frillish",
                "isNfe": true,
                "types": [
                    "water",
                    "ghost"
                ],
                "spriteSuffix": "f",
                "desc": "Frillish (F) is the female form of Frillish, known for its elegant and ghostly presence."
            }
        ]
    },
    {
        "id": 593,
        "name": "Jellicent",
        "types": [
            "water",
            "ghost"
        ],
        "forms": [
            {
                "name": "Jellicent",
                "types": [
                    "water",
                    "ghost"
                ],
                "spriteSuffix": "f",
                "desc": "Jellicent (F) is the female form of Jellicent, known for its grace and its ghostly aquatic nature."
            },
            {
                "name": "Jellicent",
                "types": [
                    "water",
                    "ghost"
                ],
                "desc": "Jellicent is a Water/Ghost-type Pokemon known for its ghostly appearance and its male form."
            }
        ]
    },
    {
        "id": 747,
        "name": "Mareanie",
        "isNfe": true,
        "types": [
            "poison",
            "water"
        ],
        "desc": "Mareanie is a Poison/Water-type Pokemon known for its underwater habitat and toxic spikes."
    },
    {
        "id": 748,
        "name": "Toxapex",
        "types": [
            "poison",
            "water"
        ],
        "desc": "Toxapex is the evolved form of Mareanie, known for its formidable defenses and venomous tentacles."
    },
    {
        "id": 845,
        "name": "Cramorant",
        "types": [
            "flying",
            "water"
        ],
        "desc": "Cramorant is a Flying/Water-type Pokemon known for its fishing skills and the ability to launch Gulp Missile attacks."
    },
    {
        "id": 848,
        "name": "Toxel",
        "isNfe": true,
        "types": [
            "electric",
            "poison"
        ],
        "desc": "Toxel is an Electric/Poison-type Pokemon known for its unique dual-typing and baby dragon-like appearance."
    },
    {
        "id": 849,
        "name": "Toxtricity",
        "types": [
            "electric",
            "poison"
        ],
        "forms": [
            {
                "name": "Toxtricity",
                "types": [
                    "electric",
                    "poison"
                ],
                "desc": "Toxtricity is an Electric/Poison-type Pokemon known for its electric guitar-inspired appearance and rebellious nature."
            },
            {
                "name": "Toxtricity",
                "types": [
                    "electric",
                    "poison"
                ],
                "spriteSuffix": "l",
                "desc": "Toxtricity (Low Key Form) is a special form of Toxtricity known for its calmer disposition and unique G-Max move."
            },
            {
                "name": "Toxtricity Gigantamax",
                "types": [
                    "electric",
                    "poison"
                ],
                "spriteSuffix": "gigantamax",
                "isGigantamax": true,
                "desc": "Toxtricity Gigantamax is a Gigantamax form of Toxtricity, known for its gigantic size and electrifying performances."
            }
        ]
    },
    {
        "id": 843,
        "name": "Silicobra",
        "isNfe": true,
        "types": [
            "ground"
        ],
        "desc": "Silicobra is a Ground-type Pokemon known for its burrowing abilities and snake-like appearance."
    },
    {
        "id": 844,
        "name": "Sandaconda",
        "types": [
            "ground"
        ],
        "forms": [
            {
                "name": "Sandaconda",
                "types": [
                    "ground"
                ],
                "desc": "Sandaconda is a Ground-type Pokemon known for its coiled body and sandy whirlwind attacks."
            },
            {
                "name": "Sandaconda Gigantamax",
                "types": [
                    "ground"
                ],
                "spriteSuffix": "gigantamax",
                "isGigantamax": true,
                "desc": "Sandaconda Gigantamax is a Gigantamax form of Sandaconda, known for its massive size and powerful G-Max move."
            }
        ]
    },
    {
        "id": 449,
        "name": "Hippopotas",
        "isNfe": true,
        "types": [
            "ground"
        ],
        "desc": "Hippopotas is a Ground-type Pokemon known for its sandy hide and its ability to summon sandstorms."
    },
    {
        "id": 450,
        "name": "Hippowdon",
        "types": [
            "ground"
        ],
        "forms": [
            {
                "name": "Hippowdon",
                "types": [
                    "ground"
                ],
                "desc": "Hippowdon is a Ground-type Pokemon known for its impressive bulk and the ability to control sandstorms."
            },
            {
                "name": "Hippowdon",
                "types": [
                    "ground"
                ],
                "spriteSuffix": "f",
                "desc": "Hippowdon (Female) is the female form of Hippowdon, known for its territorial behavior and strength."
            }
        ]
    },
    {
        "id": 632,
        "name": "Durant",
        "types": [
            "bug",
            "steel"
        ],
        "desc": "Durant is a Bug/Steel-type Pokemon known for its teamwork and underground tunneling."
    },
    {
        "id": 631,
        "name": "Heatmor",
        "types": [
            "fire"
        ],
        "desc": "Heatmor is a Fire-type Pokemon known for its long tongue and its rivalry with Durant."
    },
    {
        "id": 694,
        "name": "Helioptile",
        "isNfe": true,
        "types": [
            "electric",
            "normal"
        ],
        "desc": "Helioptile is an Electric/Normal-type Pokemon known for its solar energy absorption and lizard-like appearance."
    },
    {
        "id": 695,
        "name": "Heliolisk",
        "types": [
            "electric",
            "normal"
        ],
        "desc": "Heliolisk is the evolved form of Helioptile, known for its ability to convert sunlight into energy and its frilled appearance."
    },
    {
        "id": 701,
        "name": "Hawlucha",
        "types": [
            "fighting",
            "flying"
        ],
        "desc": "Hawlucha is a Fighting/Flying-type Pokemon known for its luchador-inspired fighting style and high-flying moves."
    },
    {
        "id": 328,
        "name": "Trapinch",
        "isNfe": true,
        "types": [
            "ground"
        ],
        "desc": "Trapinch is a Ground-type Pokemon known for its powerful jaws and sand trap abilities."
    },
    {
        "id": 329,
        "name": "Vibrava",
        "isNfe": true,
        "types": [
            "ground",
            "dragon"
        ],
        "desc": "Vibrava is a Ground/Dragon-type Pokemon known for its graceful flight and its pre-evolution form."
    },
    {
        "id": 330,
        "name": "Flygon",
        "types": [
            "ground",
            "dragon"
        ],
        "desc": "Flygon is the evolved form of Vibrava, known for its ability to create sandstorms and its dragon-like appearance."
    },
    {
        "id": 610,
        "name": "Axew",
        "isNfe": true,
        "types": [
            "dragon"
        ],
        "desc": "Axew is a Dragon-type Pokemon known for its powerful tusks and the potential to evolve into a formidable dragon."
    },
    {
        "id": 611,
        "name": "Fraxure",
        "isNfe": true,
        "types": [
            "dragon"
        ],
        "desc": "Fraxure is a Dragon-type Pokemon known for its intimidating appearance, sharp tusks, and potential to evolve into Haxorus."
    },
    {
        "id": 612,
        "name": "Haxorus",
        "types": [
            "dragon"
        ],
        "desc": "Haxorus is a powerful Dragon-type Pokemon known for its massive tusks and fearsome presence."
    },
    {
        "id": 562,
        "name": "Yamask",
        "isNfe": true,
        "types": [
            "ghost"
        ],
        "forms": [
            {
                "name": "Yamask",
                "isNfe": true,
                "types": [
                    "ghost"
                ],
                "desc": "Yamask is a Ghost-type Pokemon known for its spirit attachment to a mask."
            },
            {
                "name": "Yamask Galar",
                "isNfe": true,
                "types": [
                    "ground",
                    "ghost"
                ],
                "spriteSuffix": "galar",
                "desc": "Yamask Galar is a variant of Yamask found in the Galar region, known for its unique Ground/Ghost typing."
            }
        ]
    },
    {
        "id": 867,
        "name": "Runerigus",
        "types": [
            "ground",
            "ghost"
        ],
        "desc": "Runerigus is an eerie Ground/Ghost-type Pokemon known for its ancient origins and the ability to evolve from Galarian Yamask."
    },
    {
        "id": 563,
        "name": "Cofagrigus",
        "types": [
            "ghost"
        ],
        "desc": "Cofagrigus is a Ghost-type Pokemon known for its royal and mummy-like appearance."
    },
    {
        "id": 679,
        "name": "Honedge",
        "isNfe": true,
        "types": [
            "steel",
            "ghost"
        ],
        "desc": "Honedge is a unique Steel/Ghost-type Pokemon known for its living sword appearance and ghostly nature."
    },
    {
        "id": 680,
        "name": "Doublade",
        "isNfe": true,
        "types": [
            "steel",
            "ghost"
        ],
        "desc": "Doublade is a dual-wielding Steel/Ghost-type Pokemon known for its strategic battle style."
    },
    {
        "id": 681,
        "name": "Aegislash",
        "types": [
            "steel",
            "ghost"
        ],
        "forms": [
            {
                "name": "Aegislash",
                "types": [
                    "steel",
                    "ghost"
                ],
                "desc": "Aegislash is a regal Steel/Ghost-type Pokemon known for its unique ability to change forms in battle."
            },
            {
                "name": "Aegislash",
                "types": [
                    "steel",
                    "ghost"
                ],
                "spriteSuffix": "blade",
                "desc": "Aegislash Blade Form is the offensive form of Aegislash, known for its high attack power and sharp blade."
            }
        ]
    },
    {
        "id": 77,
        "name": "Ponyta",
        "isNfe": true,
        "types": [
            "fire"
        ],
        "forms": [
            {
                "name": "Ponyta",
                "isNfe": true,
                "types": [
                    "fire"
                ],
                "desc": "Ponyta is a Fire-type Pokemon known for its elegant and fiery mane."
            },
            {
                "name": "Ponyta Galar",
                "isNfe": true,
                "types": [
                    "psychic"
                ],
                "spriteSuffix": "galar",
                "desc": "Galarian Ponyta is a variant of Ponyta found in the Galar region, known for its unique Psychic typing."
            }
        ]
    },
    {
        "id": 78,
        "name": "Rapidash",
        "types": [
            "fire"
        ],
        "forms": [
            {
                "name": "Rapidash",
                "types": [
                    "fire"
                ],
                "desc": "Rapidash is a majestic Fire-type Pokemon known for its blazing speed and graceful appearance."
            },
            {
                "name": "Rapidash Galar",
                "types": [
                    "psychic",
                    "fairy"
                ],
                "spriteSuffix": "galar",
                "desc": "Galarian Rapidash is a variant of Rapidash found in the Galar region, known for its Psychic/Fairy typing and unique mane."
            }
        ]
    },
    {
        "id": 854,
        "name": "Sinistea",
        "isNfe": true,
        "types": [
            "ghost"
        ],
        "desc": "Sinistea is a Ghost-type Pokemon known for its ghostly appearance and the teacup it inhabits."
    },
    {
        "id": 855,
        "name": "Polteageist",
        "types": [
            "ghost"
        ],
        "desc": "Polteageist is an eerie Ghost-type Pokemon known for its teapot form and its habit of haunting teapots."
    },
    {
        "id": 876,
        "name": "Indeedee",
        "types": [
            "psychic",
            "normal"
        ],
        "forms": [
            {
                "name": "Indeedee",
                "types": [
                    "psychic",
                    "normal"
                ],
                "desc": "Indeedee is a Psychic/Normal-type Pokemon known for its supportive abilities and psychic powers."
            },
            {
                "name": "Indeedee",
                "types": [
                    "psychic",
                    "normal"
                ],
                "spriteSuffix": "f",
                "desc": "Female Indeedee is known for its nurturing nature and psychic powers."
            }
        ]
    },
    {
        "id": 708,
        "name": "Phantump",
        "isNfe": true,
        "types": [
            "ghost",
            "grass"
        ],
        "desc": "Phantump is a Ghost/Grass-type Pokemon known for its stump-like appearance and the spirit of a child inside."
    },
    {
        "id": 709,
        "name": "Trevenant",
        "types": [
            "ghost",
            "grass"
        ],
        "desc": "Trevenant is a Ghost/Grass-type Pokemon known for its tree-like form and its ability to control the forest."
    },
    {
        "id": 755,
        "name": "Morelull",
        "isNfe": true,
        "types": [
            "grass",
            "fairy"
        ],
        "desc": "Morelull is a Grass/Fairy-type Pokemon known for its mushroom cap and its soothing spores."
    },
    {
        "id": 756,
        "name": "Shiinotic",
        "types": [
            "grass",
            "fairy"
        ],
        "desc": "Shiinotic is the evolved form of Morelull, known for its bioluminescent cap and the calming effects of its spores."
    },
    {
        "id": 765,
        "name": "Oranguru",
        "types": [
            "normal",
            "psychic"
        ],
        "desc": "Oranguru is a Normal/Psychic-type Pokemon known for its wisdom and its role as a guardian in the jungle."
    },
    {
        "id": 766,
        "name": "Passimian",
        "types": [
            "fighting"
        ],
        "desc": "Passimian is a Fighting-type Pokemon known for its team-based battles and competitive nature."
    },
    {
        "id": 877,
        "name": "Morpeko",
        "types": [
            "electric",
            "dark"
        ],
        "desc": "Morpeko is an Electric/Dark-type Pokemon known for its hangry mode, which changes its type and behavior."
    },
    {
        "id": 870,
        "name": "Falinks",
        "types": [
            "fighting"
        ],
        "desc": "Falinks is a unique Fighting-type Pokemon known for its formation-style battles and strong teamwork."
    },
    {
        "id": 780,
        "name": "Drampa",
        "types": [
            "normal",
            "dragon"
        ],
        "desc": "Drampa is a Normal/Dragon-type Pokemon known for its grandparent-like demeanor and its dragon-like features."
    },
    {
        "id": 776,
        "name": "Turtonator",
        "types": [
            "fire",
            "dragon"
        ],
        "desc": "Turtonator is a Fire/Dragon-type Pokemon known for its explosive shell and fiery attacks."
    },
    {
        "id": 777,
        "name": "Togedemaru",
        "types": [
            "electric",
            "steel"
        ],
        "desc": "Togedemaru is an Electric/Steel-type Pokemon known for its spiky appearance and its ability to generate electricity."
    },
    {
        "id": 872,
        "name": "Snom",
        "isNfe": true,
        "types": [
            "ice",
            "bug"
        ],
        "desc": "Snom is an Ice/Bug-type Pokemon known for its small size and icy spewing abilities."
    },
    {
        "id": 873,
        "name": "Frosmoth",
        "types": [
            "ice",
            "bug"
        ],
        "desc": "Frosmoth is the evolved form of Snom, known for its elegant and icy wings."
    },
    {
        "id": 852,
        "name": "Clobbopus",
        "isNfe": true,
        "types": [
            "fighting"
        ],
        "desc": "Clobbopus is a Fighting-type Pokemon known for its octopus-like appearance and boxing prowess."
    },
    {
        "id": 853,
        "name": "Grapploct",
        "types": [
            "fighting"
        ],
        "desc": "Grapploct is the evolved form of Clobbopus, known for its martial arts skills and powerful tentacles."
    },
    {
        "id": 871,
        "name": "Pincurchin",
        "types": [
            "electric"
        ],
        "desc": "Pincurchin is an Electric-type Pokemon known for its spiky appearance and ability to generate electricity."
    },
    {
        "id": 458,
        "name": "Mantyke",
        "isNfe": true,
        "types": [
            "water",
            "flying"
        ],
        "desc": "Mantyke is a Water/Flying-type Pokemon known for its gentle nature and manta ray-like appearance."
    },
    {
        "id": 226,
        "name": "Mantine",
        "types": [
            "water",
            "flying"
        ],
        "desc": "Mantine is the evolved form of Mantyke, known for its graceful swimming and manta ray-like appearance."
    },
    {
        "id": 320,
        "name": "Wailmer",
        "isNfe": true,
        "types": [
            "water"
        ],
        "desc": "Wailmer is a Water-type Pokemon known for its large size and cheerful demeanor."
    },
    {
        "id": 321,
        "name": "Wailord",
        "types": [
            "water"
        ],
        "desc": "Wailord is the evolved form of Wailmer, known for being one of the largest Pokemon in the world."
    },
    {
        "id": 712,
        "name": "Bergmite",
        "isNfe": true,
        "types": [
            "ice"
        ],
        "desc": "Bergmite is an Ice-type Pokemon known for its icy body and its ability to freeze its opponents."
    },
    {
        "id": 713,
        "name": "Avalugg",
        "types": [
            "ice"
        ],
        "desc": "Avalugg is the evolved form of Bergmite, known for its massive ice mountain-like body and defensive capabilities."
    },
    {
        "id": 781,
        "name": "Dhelmise",
        "types": [
            "ghost",
            "grass"
        ],
        "desc": "Dhelmise is a unique Ghost/Grass-type Pokemon known for its anchor and shipwheel form, which it uses to capture prey."
    },
    {
        "id": 131,
        "name": "Lapras",
        "types": [
            "water",
            "ice"
        ],
        "forms": [
            {
                "name": "Lapras",
                "types": [
                    "water",
                    "ice"
                ],
                "desc": "Lapras is a Water/Ice-type Pokemon known for its gentle nature and its ability to carry people across the sea."
            },
            {
                "name": "Lapras Gigantamax",
                "types": [
                    "water",
                    "ice"
                ],
                "spriteSuffix": "gigantamax",
                "isGigantamax": true,
                "desc": "Gigantamax Lapras is known for its massive size and unique Gigantamax form."
            }
        ]
    },
    {
        "id": 337,
        "name": "Lunatone",
        "types": [
            "rock",
            "psychic"
        ],
        "desc": "Lunatone is a mysterious Rock/Psychic-type Pokemon known for its lunar associations and its connection to the moon."
    },
    {
        "id": 338,
        "name": "Solrock",
        "types": [
            "rock",
            "psychic"
        ],
        "desc": "Solrock is a Rock/Psychic-type Pokemon known for its solar associations and its connection to the sun."
    },
    {
        "id": 439,
        "name": "Mime Jr.",
        "isNfe": true,
        "types": [
            "psychic",
            "fairy"
        ],
        "desc": "Mime Jr. is a Psychic/Fairy-type Pokemon known for its mime-like behavior and playful nature."
    },
    {
        "id": 122,
        "name": "Mr. Mime",
        "types": [
            "psychic",
            "fairy"
        ],
        "forms": [
            {
                "name": "Mr. Mime",
                "types": [
                    "psychic",
                    "fairy"
                ],
                "desc": "Mr. Mime is a Psychic/Fairy-type Pokemon known for its mime skills and elegant appearance."
            },
            {
                "name": "Mr. Mime Galar",
                "isNfe": true,
                "types": [
                    "ice",
                    "psychic"
                ],
                "spriteSuffix": "galar",
                "desc": "Galarian Mr. Mime is a variant of Mr. Mime found in the Galar region, known for its Ice/Psychic typing and unique look."
            }
        ]
    },
    {
        "id": 866,
        "name": "Mr. Rime",
        "types": [
            "psychic",
            "ice"
        ],
        "desc": "Mr. Rime is the evolved form of Mr. Mime, known for its sophisticated dancing and icy abilities."
    },
    {
        "id": 554,
        "name": "Darumaka",
        "isNfe": true,
        "types": [
            "fire"
        ],
        "forms": [
            {
                "name": "Darumaka",
                "isNfe": true,
                "types": [
                    "fire"
                ],
                "desc": "Darumaka is a Fire-type Pokemon known for its round shape and fiery nature."
            },
            {
                "name": "Darumaka Galar",
                "isNfe": true,
                "types": [
                    "ice"
                ],
                "spriteSuffix": "galar",
                "desc": "Galarian Darumaka is a variant of Darumaka found in the Galar region, known for its Ice typing and snowy appearance."
            }
        ]
    },
    {
        "id": 555,
        "name": "Darmanitan",
        "types": [
            "fire"
        ],
        "forms": [
            {
                "name": "Darmanitan",
                "types": [
                    "fire"
                ],
                "desc": "Darmanitan is known for its fierce fire powers and its Zen Mode, which changes its appearance and abilities."
            },
            {
                "name": "Darmanitan Galar",
                "types": [
                    "ice"
                ],
                "spriteSuffix": "galar",
                "desc": "Galarian Darmanitan is a variant of Darmanitan found in the Galar region, known for its Ice typing and chilly nature."
            }
        ]
    },
    {
        "id": 874,
        "name": "Stonjourner",
        "types": [
            "rock"
        ],
        "desc": "Stonjourner is a Rock-type Pokemon known for its towering stone body and its role in ancient ceremonies."
    },
    {
        "id": 875,
        "name": "Eiscue",
        "types": [
            "ice"
        ],
        "forms": [
            {
                "name": "Eiscue",
                "types": [
                    "ice"
                ],
                "desc": "Eiscue is an Ice-type Pokemon known for its ice cube head, which can change in size and appearance."
            },
            {
                "name": "Eiscue",
                "types": [
                    "ice"
                ],
                "spriteSuffix": "n",
                "desc": "Eiscue Ice Face Form is a special form of Eiscue when its head is in its ice form."
            }
        ]
    },
    {
        "id": 884,
        "name": "Duraludon",
        "types": [
            "steel",
            "dragon"
        ],
        "forms": [
            {
                "name": "Duraludon",
                "types": [
                    "steel",
                    "dragon"
                ],
                "desc": "Duraludon is a Steel/Dragon-type Pokemon known for its metallic body and dragon-like abilities."
            },
            {
                "name": "Duraludon Gigantamax",
                "types": [
                    "steel",
                    "dragon"
                ],
                "spriteSuffix": "gigantamax",
                "isGigantamax": true,
                "desc": "Gigantamax Duraludon is known for its massive size and unique Gigantamax form."
            }
        ]
    },
    {
        "id": 479,
        "name": "Rotom",
        "types": [
            "electric",
            "ghost"
        ],
        "forms": [
            {
                "name": "Rotom",
                "types": [
                    "electric",
                    "ghost"
                ],
                "desc": "Rotom is an Electric/Ghost-type Pokemon known for its ability to possess appliances and change forms."
            },
            {
                "name": "Rotom Fan",
                "types": [
                    "electric",
                    "flying"
                ],
                "spriteSuffix": "fan",
                "desc": "Rotom Fan Form is one of Rotom's appliance forms, known for its electric fan-like appearance."
            },
            {
                "name": "Rotom Frost",
                "types": [
                    "electric",
                    "ice"
                ],
                "spriteSuffix": "frost",
                "desc": "Rotom Frost Form is one of Rotom's appliance forms, known for its refrigerator-like appearance."
            },
            {
                "name": "Rotom Heat",
                "types": [
                    "electric",
                    "fire"
                ],
                "spriteSuffix": "heat",
                "desc": "Rotom Heat Form is one of Rotom's appliance forms, known for its oven-like appearance."
            },
            {
                "name": "Rotom Mow",
                "types": [
                    "electric",
                    "grass"
                ],
                "spriteSuffix": "mow",
                "desc": "Rotom Mow Form is one of Rotom's appliance forms, known for its lawnmower-like appearance."
            },
            {
                "name": "Rotom Wash",
                "types": [
                    "electric",
                    "water"
                ],
                "spriteSuffix": "wash",
                "desc": "Rotom Wash Form is one of Rotom's appliance forms, known for its washing machine-like appearance."
            }
        ]
    },
    {
        "id": 132,
        "name": "Ditto",
        "types": [
            "normal"
        ],
        "desc": "Ditto is a Normal-type Pokemon known for its ability to transform into any other Pokemon."
    },
    {
        "id": 880,
        "name": "Dracozolt",
        "types": [
            "electric",
            "dragon"
        ],
        "desc": "Dracozolt is an Electric/Dragon-type Pokemon known for its unique fossilized form and electrical abilities."
    },
    {
        "id": 881,
        "name": "Arctozolt",
        "types": [
            "electric",
            "ice"
        ],
        "desc": "Arctozolt is an Electric/Ice-type Pokemon known for its unique fossilized form and icy abilities."
    },
    {
        "id": 882,
        "name": "Dracovish",
        "types": [
            "water",
            "dragon"
        ],
        "desc": "Dracovish is a Water/Dragon-type Pokemon known for its unique fossilized form and aquatic abilities."
    },
    {
        "id": 883,
        "name": "Arctovish",
        "types": [
            "water",
            "ice"
        ],
        "desc": "Arctovish is a Water/Ice-type Pokemon known for its unique fossilized form and icy aquatic abilities."
    },
    {
        "id": 4,
        "name": "Charmander",
        "isNfe": true,
        "types": [
            "fire"
        ],
        "desc": "Charmander is a Fire-type Pokemon known for its fiery tail and its potential to evolve into Charizard."
    },
    {
        "id": 5,
        "name": "Charmeleon",
        "isNfe": true,
        "types": [
            "fire"
        ],
        "desc": "Charmeleon is a Fire-type Pokemon known for its more mature appearance and its evolution from Charmander."
    },
    {
        "id": 6,
        "name": "Charizard",
        "types": [
            "fire",
            "flying"
        ],
        "forms": [
            {
                "name": "Charizard",
                "types": [
                    "fire",
                    "flying"
                ],
                "desc": "Charizard is a Fire/Flying-type Pokemon known for its powerful wings and its fearsome fire-based attacks."
            },
            {
                "name": "Charizard Gigantamax",
                "types": [
                    "fire",
                    "flying"
                ],
                "spriteSuffix": "gigantamax",
                "isGigantamax": true,
                "desc": "Gigantamax Charizard is known for its massive size and unique Gigantamax form, which intensifies its flames."
            }
        ]
    },
    {
        "id": 772,
        "name": "Type: Null",
        "isNfe": true,
        "types": [
            "normal"
        ],
        "isLegendary": true,
        "desc": "Type: Null is a unique Normal-type Pokemon created for the purpose of battling Ultra Beasts. It has a powerful and adaptable multi-format structure."
    },
    {
        "id": 773,
        "name": "Silvally",
        "types": [
            "normal"
        ],
        "forms": [
            {
                "name": "Silvally",
                "types": [
                    "bug"
                ],
                "spriteSuffix": "bug",
                "desc": "Silvally Bug Form is one of its unique forms, known for its Bug-type abilities and adaptability."
            },
            {
                "name": "Silvally",
                "types": [
                    "dark"
                ],
                "spriteSuffix": "dark",
                "desc": "Silvally Dark Form is one of its unique forms, known for its Dark-type abilities and adaptability."
            },
            {
                "name": "Silvally",
                "types": [
                    "dragon"
                ],
                "spriteSuffix": "dragon",
                "desc": "Silvally Dragon Form is one of its unique forms, known for its Dragon-type abilities and adaptability."
            },
            {
                "name": "Silvally",
                "types": [
                    "electric"
                ],
                "spriteSuffix": "electric",
                "desc": "Silvally Electric Form is one of its unique forms, known for its Electric-type abilities and adaptability."
            },
            {
                "name": "Silvally",
                "types": [
                    "fairy"
                ],
                "spriteSuffix": "fairy",
                "desc": "Silvally Fairy Form is one of its unique forms, known for its Fairy-type abilities and adaptability."
            },
            {
                "name": "Silvally",
                "types": [
                    "fighting"
                ],
                "spriteSuffix": "fighting",
                "desc": "Silvally Fighting Form is one of its unique forms, known for its Fighting-type abilities and adaptability."
            },
            {
                "name": "Silvally",
                "types": [
                    "fire"
                ],
                "spriteSuffix": "fire",
                "desc": "Silvally Fire Form is one of its unique forms, known for its Fire-type abilities and adaptability."
            },
            {
                "name": "Silvally",
                "types": [
                    "flying"
                ],
                "spriteSuffix": "flying",
                "desc": "Silvally Flying Form is one of its unique forms, known for its Flying-type abilities and adaptability."
            },
            {
                "name": "Silvally",
                "types": [
                    "ghost"
                ],
                "spriteSuffix": "ghost",
                "desc": "Silvally Ghost Form is one of its unique forms, known for its Ghost-type abilities and adaptability."
            },
            {
                "name": "Silvally",
                "types": [
                    "grass"
                ],
                "spriteSuffix": "grass",
                "desc": "Silvally Grass Form is one of its unique forms, known for its Grass-type abilities and adaptability."
            },
            {
                "name": "Silvally",
                "types": [
                    "ground"
                ],
                "spriteSuffix": "ground",
                "desc": "Silvally Ground Form is one of its unique forms, known for its Ground-type abilities and adaptability."
            },
            {
                "name": "Silvally",
                "types": [
                    "ice"
                ],
                "spriteSuffix": "ice",
                "desc": "Silvally Ice Form is one of its unique forms, known for its Ice-type abilities and adaptability."
            },
            {
                "name": "Silvally",
                "types": [
                    "normal"
                ],
                "desc": "Silvally Normal Form is its default form, known for its adaptability and Normal-type abilities."
            },
            {
                "name": "Silvally",
                "types": [
                    "poison"
                ],
                "spriteSuffix": "poison",
                "desc": "Silvally Poison Form is one of its unique forms, known for its Poison-type abilities and adaptability."
            },
            {
                "name": "Silvally",
                "types": [
                    "psychic"
                ],
                "spriteSuffix": "psychic",
                "desc": "Silvally Psychic Form is one of its unique forms, known for its Psychic-type abilities and adaptability."
            },
            {
                "name": "Silvally",
                "types": [
                    "rock"
                ],
                "spriteSuffix": "rock",
                "desc": "Silvally Rock Form is one of its unique forms, known for its Rock-type abilities and adaptability."
            },
            {
                "name": "Silvally",
                "types": [
                    "steel"
                ],
                "spriteSuffix": "steel",
                "desc": "Silvally Steel Form is one of its unique forms, known for its Steel-type abilities and adaptability."
            },
            {
                "name": "Silvally",
                "types": [
                    "water"
                ],
                "spriteSuffix": "water",
                "desc": "Silvally Water Form is one of its unique forms, known for its Water-type abilities and adaptability."
            }
        ],
        "isLegendary": true,
        "desc": "Silvally is known as the Synthetic Pokemon and is said to have been created to combat threats like Ultra Beasts. It can change its type by holding special items."
    },
    {
        "id": 246,
        "name": "Larvitar",
        "isNfe": true,
        "types": [
            "rock",
            "ground"
        ],
        "desc": "Larvitar is a Rock/Ground-type Pokemon known for its rocky hide and its potential to evolve into Tyranitar."
    },
    {
        "id": 247,
        "name": "Pupitar",
        "isNfe": true,
        "types": [
            "rock",
            "ground"
        ],
        "desc": "Pupitar is a Rock/Ground-type Pokemon and the evolved form of Larvitar. It's known for its durable shell."
    },
    {
        "id": 248,
        "name": "Tyranitar",
        "types": [
            "rock",
            "dark"
        ],
        "desc": "Tyranitar is a powerful Rock/Dark-type Pokemon known for its imposing size and its ability to cause sandstorms."
    },
    {
        "id": 633,
        "name": "Deino",
        "isNfe": true,
        "types": [
            "dark",
            "dragon"
        ],
        "desc": "Deino is a Dark/Dragon-type Pokemon known for its blindfolded appearance and its potential to evolve into Hydreigon."
    },
    {
        "id": 634,
        "name": "Zweilous",
        "isNfe": true,
        "types": [
            "dark",
            "dragon"
        ],
        "desc": "Zweilous is a Dark/Dragon-type Pokemon and the evolved form of Deino. It's known for having two heads."
    },
    {
        "id": 635,
        "name": "Hydreigon",
        "types": [
            "dark",
            "dragon"
        ],
        "desc": "Hydreigon is a formidable Dark/Dragon-type Pokemon known for its three heads and its destructive capabilities."
    },
    {
        "id": 704,
        "name": "Goomy",
        "isNfe": true,
        "types": [
            "dragon"
        ],
        "desc": "Goomy is a Dragon-type Pokemon known for its gooey and slimy appearance. It has the potential to evolve into Sliggoo."
    },
    {
        "id": 705,
        "name": "Sliggoo",
        "isNfe": true,
        "types": [
            "dragon"
        ],
        "desc": "Sliggoo is a Dragon-type Pokemon and the evolved form of Goomy. It's known for its rain-based evolution."
    },
    {
        "id": 706,
        "name": "Goodra",
        "types": [
            "dragon"
        ],
        "desc": "Goodra is a friendly and Dragon-type Pokemon known for its slimy body and powerful dragon abilities."
    },
    {
        "id": 782,
        "name": "Jangmo-o",
        "isNfe": true,
        "types": [
            "dragon"
        ],
        "desc": "Jangmo-o is a Dragon-type Pokemon known for its scales and its potential to evolve into Hakamo-o."
    },
    {
        "id": 783,
        "name": "Hakamo-o",
        "isNfe": true,
        "types": [
            "dragon",
            "fighting"
        ],
        "desc": "Hakamo-o is a Dragon/Fighting-type Pokemon and the evolved form of Jangmo-o. It's known for its dancing fighting style."
    },
    {
        "id": 784,
        "name": "Kommo-o",
        "types": [
            "dragon",
            "fighting"
        ],
        "desc": "Kommo-o is a Dragon/Fighting-type Pokemon known for its unique dance-based fighting style and its powerful moves."
    },
    {
        "id": 885,
        "name": "Dreepy",
        "isNfe": true,
        "types": [
            "dragon",
            "ghost"
        ],
        "desc": "Dreepy is a Dragon/Ghost-type Pokemon known for its timid nature and its potential to evolve into Drakloak."
    },
    {
        "id": 886,
        "name": "Drakloak",
        "isNfe": true,
        "types": [
            "dragon",
            "ghost"
        ],
        "desc": "Drakloak is a Dragon and Ghost-type Pokemon. It is the evolved form of Dreepy."
    },
    {
        "id": 887,
        "name": "Dragapult",
        "types": [
            "dragon",
            "ghost"
        ],
        "desc": "Dragapult is a Dragon and Ghost-type Pokemon. It is the evolved form of Drakloak."
    },
    {
        "id": 888,
        "name": "Zacian",
        "types": [
            "fairy"
        ],
        "forms": [
            {
                "name": "Zacian",
                "types": [
                    "fairy"
                ]
            },
            {
                "name": "Zacian",
                "types": [
                    "fairy",
                    "steel"
                ],
                "spriteSuffix": "c"
            }
        ],
        "isLegendary": true,
        "desc": "Zacian is a Fairy-type Pokemon and is also considered a Legendary Pokemon. It has an alternate form known as Zacian Crowned Sword."
    },
    {
        "id": 889,
        "name": "Zamazenta",
        "types": [
            "fighting"
        ],
        "forms": [
            {
                "name": "Zamazenta",
                "types": [
                    "fighting"
                ]
            },
            {
                "name": "Zamazenta",
                "types": [
                    "fighting",
                    "steel"
                ],
                "spriteSuffix": "c"
            }
        ],
        "isLegendary": true,
        "desc": "Zamazenta is a Fighting-type Pokemon and is also considered a Legendary Pokemon. It has an alternate form known as Zamazenta Crowned Shield."
    },
    {
        "id": 890,
        "name": "Eternatus",
        "types": [
            "poison",
            "dragon"
        ],
        "forms": [
            {
                "name": "Eternatus",
                "types": [
                    "poison",
                    "dragon"
                ]
            },
            {
                "name": "Eternatus Eternamax",
                "types": [
                    "poison",
                    "dragon"
                ],
                "spriteSuffix": "eternamax"
            }
        ],
        "isLegendary": true,
        "desc": "Eternatus is a Poison and Dragon-type Pokemon and is also considered a Legendary Pokemon. It has a powerful alternate form known as Eternatus Eternamax."
    },
    {
        "id": 891,
        "name": "Kubfu",
        "isNfe": true,
        "types": [
            "fighting"
        ],
        "isLegendary": true,
        "desc": "Kubfu is a Fighting-type Pokemon and is also considered a Legendary Pokemon. It evolves into Urshifu."
    },
    {
        "id": 892,
        "name": "Urshifu",
        "types": [
            "fighting",
            "dark"
        ],
        "forms": [
            {
                "name": "Urshifu Single Strike",
                "types": [
                    "fighting",
                    "dark"
                ]
            },
            {
                "name": "Urshifu Rapid Strike",
                "types": [
                    "fighting",
                    "water"
                ],
                "spriteSuffix": "rs"
            },
            {
                "name": "Urshifu Single Strike Gigantamax",
                "types": [
                    "fighting",
                    "dark"
                ],
                "spriteSuffix": "ss-gigantamax",
                "isGigantamax": true
            },
            {
                "name": "Urshifu Rapid Strike Gigantamax",
                "types": [
                    "fighting",
                    "water"
                ],
                "spriteSuffix": "rs-gigantamax",
                "isGigantamax": true
            }
        ],
        "isLegendary": true,
        "desc": "Urshifu is a Fighting and Dark-type Pokemon and is also considered a Legendary Pokemon. It has two different forms: Single Strike and Rapid Strike."
    },
    {
        "id": 893,
        "name": "Zarude",
        "types": [
            "dark",
            "grass"
        ],
        "forms": [
            {
                "name": "Zarude",
                "types": [
                    "dark",
                    "grass"
                ]
            },
            {
                "name": "Zarude Dada",
                "types": [
                    "dark",
                    "grass"
                ],
                "spriteSuffix": "dada"
            }
        ],
        "isLegendary": true,
        "desc": "Zarude is a Dark and Grass-type Pokemon and is also considered a Legendary Pokemon. It has an alternate form known as Zarude Dada."
    },
    {
        "id": 894,
        "name": "Regieleki",
        "types": [
            "electric"
        ],
        "isLegendary": true,
        "desc": "Regieleki is an Electric-type Pokemon and is also considered a Legendary Pokemon."
    },
    {
        "id": 895,
        "name": "Regidrago",
        "types": [
            "dragon"
        ],
        "isLegendary": true,
        "desc": "Regidrago is a Dragon-type Pokemon and is also considered a Legendary Pokemon."
    },
    {
        "id": 896,
        "name": "Glastrier",
        "types": [
            "ice"
        ],
        "isLegendary": true,
        "desc": "Glastrier is an Ice-type Pokemon and is also considered a Legendary Pokemon."
    },
    {
        "id": 897,
        "name": "Spectrier",
        "types": [
            "ghost"
        ],
        "isLegendary": true,
        "desc": "Spectrier is a Ghost-type Pokemon and is also considered a Legendary Pokemon."
    },
    {
        "id": 898,
        "name": "Calyrex",
        "types": [
            "psychic",
            "grass"
        ],
        "forms": [
            {
                "name": "Calyrex",
                "types": [
                    "psychic",
                    "grass"
                ]
            },
            {
                "name": "Calyrex Ice Rider",
                "types": [
                    "psychic",
                    "ice"
                ],
                "spriteSuffix": "ice",
                "desc": "Calyrex Ice Rider is a Psychic and Ice-type form of Calyrex."
            },
            {
                "name": "Calyrex Shadow Rider",
                "types": [
                    "psychic",
                    "shadow"
                ],
                "spriteSuffix": "shadow",
                "desc": "Calyrex Shadow Rider is a Psychic and Shadow-type form of Calyrex."
            }
        ],
        "isLegendary": true,
        "desc": "Calyrex is a Psychic and Grass-type Pokemon and is also considered a Legendary Pokemon. It has two alternate forms: Calyrex Ice Rider and Calyrex Shadow Rider."
    },
    {
        "id": 79,
        "name": "Slowpoke",
        "isNfe": true,
        "types": [
            "water",
            "psychic"
        ],
        "forms": [
            {
                "name": "Slowpoke Galar",
                "types": [
                    "psychic"
                ],
                "spriteSuffix": "galar",
                "isNfe": true,
                "desc": "Slowpoke Galar is a regional variant of Slowpoke found in the Galar region."
            }
        ]
    },
    {
        "id": 80,
        "name": "Slowbro",
        "types": [
            "water",
            "psychic"
        ],
        "forms": [
            {
                "name": "Slowbro Galar",
                "types": [
                    "poison",
                    "psychic"
                ],
                "spriteSuffix": "galar",
                "desc": "Slowbro Galar is a regional variant of Slowbro found in the Galar region."
            }
        ]
    },
    {
        "id": 199,
        "name": "Slowking",
        "types": [
            "water",
            "psychic"
        ],
        "forms": [
            {
                "name": "Slowking Galar",
                "types": [
                    "poison",
                    "psychic"
                ],
                "spriteSuffix": "galar",
                "desc": "Slowking Galar is a regional variant of Slowking found in the Galar region."
            }
        ]
    },
    {
        "id": 144,
        "name": "Articuno",
        "types": [
            "ice",
            "flying"
        ],
        "forms": [
            {
                "name": "Articuno Galar",
                "types": [
                    "psychic",
                    "flying"
                ],
                "spriteSuffix": "galar",
                "isLegendary": true,
                "desc": "Articuno Galar is a regional variant of Articuno found in the Galar region and is considered a Legendary Pokemon."
            }
        ]
    },
    {
        "id": 145,
        "name": "Zapdos",
        "types": [
            "electric",
            "flying"
        ],
        "forms": [
            {
                "name": "Zapdos Galar",
                "types": [
                    "fighting",
                    "flying"
                ],
                "spriteSuffix": "galar",
                "isLegendary": true,
                "desc": "Zapdos Galar is a regional variant of Zapdos found in the Galar region and is considered a Legendary Pokemon."
            }
        ]
    },
    {
        "id": 146,
        "name": "Moltres",
        "types": [
            "fire",
            "flying"
        ],
        "forms": [
            {
                "name": "Moltres Galar",
                "types": [
                    "dark",
                    "flying"
                ],
                "spriteSuffix": "galar",
                "isLegendary": true,
                "desc": "Moltres Galar is a regional variant of Moltres found in the Galar region and is considered a Legendary Pokemon."
            }
        ]
    },
    {
        "id": 427,
        "name": "Buneary",
        "isNfe": true,
        "types": [
            "normal"
        ],
        "desc": "Buneary is a Normal-type Pokemon and is the pre-evolved form of Lopunny."
    },
    {
        "id": 428,
        "name": "Lopunny",
        "types": [
            "normal"
        ],
        "desc": "Lopunny is a Normal-type Pokemon and is the evolved form of Buneary."
    },
    {
        "id": 440,
        "name": "Happiny",
        "isNfe": true,
        "types": [
            "normal"
        ],
        "desc": "Happiny is a Normal-type Pokemon and is the baby form of Chansey."
    },
    {
        "id": 113,
        "name": "Chansey",
        "isNfe": true,
        "types": [
            "normal"
        ],
        "desc": "Chansey is a Normal-type Pokemon and is the evolved form of Happiny."
    },
    {
        "id": 242,
        "name": "Blissey",
        "types": [
            "normal"
        ],
        "desc": "Blissey is a Normal-type Pokemon and is the evolved form of Chansey."
    },
    {
        "id": 174,
        "name": "Igglybuff",
        "isNfe": true,
        "types": [
            "normal",
            "fairy"
        ],
        "desc": "Igglybuff is a Normal and Fairy-type Pokemon and is the baby form of Jigglypuff."
    },
    {
        "id": 39,
        "name": "Jigglypuff",
        "isNfe": true,
        "types": [
            "normal",
            "fairy"
        ],
        "desc": "Jigglypuff is a Normal and Fairy-type Pokemon and is the pre-evolved form of Wigglytuff."
    },
    {
        "id": 40,
        "name": "Wigglytuff",
        "types": [
            "normal",
            "fairy"
        ],
        "desc": "Wigglytuff is a Normal and Fairy-type Pokemon and is the evolved form of Jigglypuff."
    },
    {
        "id": 753,
        "name": "Fomantis",
        "isNfe": true,
        "types": [
            "grass"
        ],
        "desc": "Fomantis is a Grass-type Pokemon and is the pre-evolved form of Lurantis."
    },
    {
        "id": 754,
        "name": "Lurantis",
        "types": [
            "grass"
        ],
        "desc": "Lurantis is a Grass-type Pokemon and is the evolved form of Fomantis."
    },
    {
        "id": 661,
        "name": "Fletchling",
        "isNfe": true,
        "types": [
            "normal",
            "flying"
        ],
        "desc": "Fletchling is a Normal and Flying-type Pokemon and is the pre-evolved form of Fletchinder."
    },
    {
        "id": 662,
        "name": "Fletchinder",
        "isNfe": true,
        "types": [
            "fire",
            "flying"
        ],
        "desc": "Fletchinder is a Fire/Flying type Pokemon that evolves from Fletchling. It has fiery plumage and can fly at high speeds. It's strong against Bug, Grass, Steel, and Fairy types and weak to Water, Electric, and Rock types. Fletchinder can have the abilities Flame Body or Gale Wings."
    },
    {
        "id": 663,
        "name": "Talonflame",
        "types": [
            "fire",
            "flying"
        ],
        "desc": "Talonflame is the final evolution of Fletchling, a Fire/Flying type Pokemon. It's known for its incredible speed and agility. It's strong against Bug, Grass, Steel, and Fairy types and weak to Water, Electric, and Rock types. Talonflame can have the abilities Flame Body or Gale Wings."
    },
    {
        "id": 403,
        "name": "Shinx",
        "isNfe": true,
        "types": [
            "electric"
        ],
        "desc": "Shinx is an Electric type Pokemon known for its cute appearance. It's the first stage of its evolutionary line. It's strong against Water and Flying types and weak to Ground types. Shinx can have the abilities Rivalry or Intimidate."
    },
    {
        "id": 404,
        "name": "Luxio",
        "isNfe": true,
        "types": [
            "electric"
        ],
        "desc": "Luxio is the second stage in Shinx's evolutionary line. It's an Electric type Pokemon with a fierce appearance. It's strong against Water and Flying types and weak to Ground types. Luxio can have the abilities Rivalry or Intimidate."
    },
    {
        "id": 405,
        "name": "Luxray",
        "types": [
            "electric"
        ],
        "desc": "Luxray is the final evolution of Shinx, an Electric type Pokemon. It has a majestic appearance with an electric mane. It's strong against Water and Flying types and weak to Ground types. Luxray can have the abilities Rivalry or Intimidate."
    },
    {
        "id": 707,
        "name": "Klefki",
        "types": [
            "steel",
            "fairy"
        ],
        "desc": "Klefki is a unique Steel/Fairy type Pokemon resembling a set of keys. It's known for its Prankster ability. It's strong against Ice, Rock, and Fairy types and weak to Ground and Fire types. Klefki's notable ability is Prankster, which gives priority to status moves."
    },
    {
        "id": 63,
        "name": "Abra",
        "isNfe": true,
        "types": [
            "psychic"
        ],
        "desc": "Abra is a Psychic type Pokemon with a timid nature. It's the first stage in its evolutionary line. It's strong against Fighting and Poison types and weak to Bug, Ghost, and Dark types. Abra can have the abilities Synchronize or Inner Focus."
    },
    {
        "id": 64,
        "name": "Kadabra",
        "isNfe": true,
        "types": [
            "psychic"
        ],
        "desc": "Kadabra is the evolved form of Abra, a Psychic type Pokemon known for its psychic powers. It's strong against Fighting and Poison types and weak to Bug, Ghost, and Dark types. Kadabra can have the abilities Synchronize or Inner Focus."
    },
    {
        "id": 65,
        "name": "Alakazam",
        "types": [
            "psychic"
        ],
        "desc": "Alakazam is the final evolution of Abra, a Psychic type Pokemon with an exceptionally high IQ. It's strong against Fighting and Poison types and weak to Bug, Ghost, and Dark types. Alakazam can have the abilities Synchronize or Inner Focus."
    },
    {
        "id": 72,
        "name": "Tentacool",
        "isNfe": true,
        "types": [
            "water",
            "poison"
        ],
        "desc": "Tentacool is a Water/Poison type Pokemon with a jellyfish-like appearance. It's the first stage in its evolutionary line. It's strong against Grass and Electric types but weak to Ground and Psychic types. Tentacool can have the abilities Clear Body or Liquid Ooze."
    },
    {
        "id": 73,
        "name": "Tentacruel",
        "types": [
            "water",
            "poison"
        ],
        "desc": "Tentacruel is the final evolution of Tentacool, a Water/Poison type Pokemon. It has numerous tentacles and can be quite dangerous. It's strong against Grass and Electric types but weak to Ground and Psychic types. Tentacruel can have the abilities Clear Body or Liquid Ooze."
    },
    {
        "id": 206,
        "name": "Dunsparce",
        "types": [
            "normal"
        ],
        "desc": "Dunsparce is a Normal type Pokemon with a unique appearance. It's known for its serpentine shape and burrowing habits. It's strong against Rock and Steel types but weak to Fighting types. Dunsparce can have the abilities Serene Grace or Run Away."
    },
    {
        "id": 626,
        "name": "Bouffalant",
        "types": [
            "normal"
        ],
        "desc": "Bouffalant is a powerful Normal type Pokemon with a distinctive afro-like mane. It's known for its strong headbutts. It's strong against Rock and Steel types but weak to Fighting types. Bouffalant can have the abilities Reckless or Sap Sipper."
    },
    {
        "id": 108,
        "name": "Lickitung",
        "isNfe": true,
        "types": [
            "normal"
        ],
        "desc": "Lickitung is a Normal type Pokemon with a long, sticky tongue. It's the first stage in its evolutionary line. It's strong against Rock and Steel types but weak to Fighting types. Lickitung can have the abilities Own Tempo or Oblivious."
    },
    {
        "id": 463,
        "name": "Lickilicky",
        "types": [
            "normal"
        ],
        "desc": "Lickilicky is the final evolution of Lickitung, a Normal type Pokemon. It's known for its enormous tongue and strong licking attacks. It's strong against Rock and Steel types but weak to Fighting types. Lickilicky can have the abilities Own Tempo or Oblivious."
    },
    {
        "id": 621,
        "name": "Druddigon",
        "types": [
            "dragon"
        ],
        "desc": "Druddigon is a Dragon type Pokemon with a unique, jagged appearance. It's known for its powerful dragon-type moves. It's strong against other Dragon types but weak to Ice types. Druddigon can have the abilities Rough Skin or Sheer Force."
    },
    {
        "id": 1,
        "name": "Bulbasaur",
        "isNfe": true,
        "types": [
            "grass",
            "poison"
        ],
        "desc": "Bulbasaur is a Grass/Poison type Pokemon and is the pre-evolved form of Ivysaur. It has a plant bulb on its back, which grows as it evolves. It's strong against Water, Ground, Electric, and Fighting types but weak to Ice, Psychic, Flying, and Fire types. Bulbasaur can have the abilities Overgrow or Chlorophyll."
    },
    {
        "id": 2,
        "name": "Ivysaur",
        "isNfe": true,
        "types": [
            "grass",
            "poison"
        ],
        "desc": "Ivysaur is the evolved form of Bulbasaur, a Grass/Poison type Pokemon. It has a larger plant bulb on its back. It's strong against Water, Ground, Electric, and Fighting types but weak to Ice, Psychic, Flying, and Fire types. Ivysaur can have the abilities Overgrow or Chlorophyll."
    },
    {
        "id": 3,
        "name": "Venusaur",
        "types": [
            "grass",
            "poison"
        ],
        "desc": "Venusaur is the final evolution of Bulbasaur, a Grass/Poison type Pokemon. It's a powerful and majestic creature with a massive plant bulb on its back. It's strong against Water, Ground, Electric, and Fighting types but weak to Ice, Psychic, Flying, and Fire types. Venusaur can have the abilities Overgrow or Chlorophyll."
    },
    {
        "id": 7,
        "name": "Squirtle",
        "isNfe": true,
        "types": [
            "water"
        ],
        "desc": "Squirtle is a Water type Pokemon and is the pre-evolved form of Wartortle. It's known for its turtle-like appearance and powerful water-based attacks. It's strong against Fire, Ground, and Rock types but weak to Electric and Grass types. Squirtle can have the abilities Torrent or Rain Dish."
    },
    {
        "id": 8,
        "name": "Wartortle",
        "isNfe": true,
        "types": [
            "water"
        ],
        "desc": "Wartortle is the evolved form of Squirtle, a Water type Pokemon. It's a bipedal turtle with more powerful water cannons. It's strong against Fire, Ground, and Rock types but weak to Electric and Grass types. Wartortle can have the abilities Torrent or Rain Dish."
    },
    {
        "id": 9,
        "name": "Blastoise",
        "types": [
            "water"
        ],
        "desc": "Blastoise is the final evolution of Squirtle, a Water type Pokemon. It's a massive turtle with powerful water cannons on its back. It's strong against Fire, Ground, and Rock types but weak to Electric and Grass types. Blastoise can have the abilities Torrent or Rain Dish."
    },
    {
        "id": 543,
        "name": "Venipede",
        "isNfe": true,
        "types": [
            "bug",
            "poison"
        ],
        "desc": "Venipede is a Bug/Poison type Pokemon known for its segmented body. It's the first stage in its evolutionary line. It's strong against Grass, Fairy, and Fighting types but weak to Fire, Flying, Psychic, and Rock types. Venipede can have the abilities Poison Point or Swarm."
    },
    {
        "id": 544,
        "name": "Whirlipede",
        "isNfe": true,
        "types": [
            "bug",
            "poison"
        ],
        "desc": "Whirlipede is the evolved form of Venipede, a Bug/Poison type Pokemon. It has a wheel-like body and spiky segments. It's strong against Grass, Fairy, and Fighting types but weak to Fire, Flying, Psychic, and Rock types. Whirlipede can have the abilities Poison Point or Swarm."
    },
    {
        "id": 545,
        "name": "Scolipede",
        "types": [
            "bug",
            "poison"
        ],
        "desc": "Scolipede is the final evolution of Whirlipede, a Bug/Poison type Pokemon. It's known for its impressive speed and agility. It's strong against Grass, Fairy, and Fighting types but weak to Fire, Flying, Psychic, and Rock types. Scolipede can have the abilities Poison Point or Swarm."
    },
    {
        "id": 590,
        "name": "Foongus",
        "isNfe": true,
        "types": [
            "grass",
            "poison"
        ],
        "desc": "Foongus is a Grass/Poison type Pokemon that resembles a Pok Ball. It's the first stage in its evolutionary line. It's strong against Water, Ground, and Rock types but weak to Bug, Fire, Ice, Flying, and Psychic types. Foongus can have the abilities Effect Spore or Regenerator."
    },
    {
        "id": 591,
        "name": "Amoonguss",
        "types": [
            "grass",
            "poison"
        ],
        "desc": "Amoonguss is the evolved form of Foongus, a Grass/Poison type Pokemon. It looks like a mushroom with a deceptive appearance. It's strong against Water, Ground, and Rock types but weak to Bug, Fire, Ice, Flying, and Psychic types. Amoonguss can have the abilities Effect Spore or Regenerator."
    },
    {
        "id": 764,
        "name": "Comfey",
        "types": [
            "fairy"
        ],
        "desc": "Comfey is a Fairy type Pokemon known for its floral appearance and ability to create floral garlands. It's strong against Fighting, Dragon, and Dark types but weak to Steel and Poison types. Comfey can have the abilities Flower Veil or Triage."
    },
    {
        "id": 114,
        "name": "Tangela",
        "isNfe": true,
        "types": [
            "grass"
        ],
        "desc": "Tangela is a Grass type Pokemon known for its tangled vines and enigmatic nature. It's the first stage in its evolutionary line. It's strong against Water, Ground, and Rock types but weak to Bug, Fire, Flying, Ice, and Poison types. Tangela can have the abilities Chlorophyll or Leaf Guard."
    },
    {
        "id": 465,
        "name": "Tangrowth",
        "types": [
            "grass"
        ],
        "desc": "Tangrowth is the final evolution of Tangela, a Grass type Pokemon. It's known for its enormous vine-like arms and power. It's strong against Water, Ground, and Rock types but weak to Bug, Fire, Flying, Ice, and Poison types. Tangrowth can have the abilities Chlorophyll or Leaf Guard."
    },
    {
        "id": 570,
        "name": "Zorua",
        "isNfe": true,
        "types": [
            "dark"
        ],
        "desc": "Zorua is a Dark type Pokemon known for its illusion abilities and cunning nature. It's the first stage in its evolutionary line. It's strong against Ghost and Psychic types but weak to Fighting and Bug types. Zorua can have the abilities Illusion or Cacophony."
    },
    {
        "id": 571,
        "name": "Zoroark",
        "types": [
            "dark"
        ],
        "desc": "Zoroark is the final evolution of Zorua, a Dark type Pokemon. It's known for its masterful illusion abilities and cunning tricks. It's strong against Ghost and Psychic types but weak to Fighting and Bug types. Zoroark can have the abilities Illusion or Cacophony."
    },
    {
        "id": 120,
        "name": "Staryu",
        "isNfe": true,
        "types": [
            "water"
        ],
        "desc": "Staryu is a Water type Pokemon known for its star shape and regenerative abilities. It's the first stage in its evolutionary line. It's strong against Fire, Ground, and Rock types but weak to Electric and Grass types. Staryu can have the abilities Illuminate or Natural Cure."
    },
    {
        "id": 121,
        "name": "Starmie",
        "types": [
            "water",
            "psychic"
        ],
        "desc": "Starmie is the evolved form of Staryu, a Water/Psychic type Pokemon. It's known for its psychic and water-based powers. It's strong against Fire, Ground, Rock, Fighting, and Poison types but weak to Electric, Grass, Bug, Ghost, and Dark types. Starmie can have the abilities Illuminate or Natural Cure."
    },
    {
        "id": 587,
        "name": "Emolga",
        "types": [
            "electric",
            "flying"
        ],
        "desc": "Emolga is an Electric/Flying type Pokemon known for its flying squirrel-like appearance and electric powers. It's strong against Water, Flying, and Steel types but weak to Rock and Ice types. Emolga can have the abilities Static or Motor Drive."
    },
    {
        "id": 702,
        "name": "Dedenne",
        "types": [
            "electric",
            "fairy"
        ],
        "desc": "Dedenne is an Electric/Fairy type Pokemon resembling a small, cute mouse. It's known for its ability to generate electricity. It's strong against Dragon, Fighting, and Dark types but weak to Ground and Poison types. Dedenne can have the abilities Cheek Pouch or Pickup."
    },
    {
        "id": 81,
        "name": "Magnemite",
        "isNfe": true,
        "types": [
            "electric",
            "steel"
        ],
        "desc": "Magnemite is an Electric/Steel type Pokemon known for its magnetic properties and the ability to generate electrical power. It's the first stage in its evolutionary line. It's strong against Ice, Rock, Fairy, and Flying types but weak to Ground, Fire, and Fighting types. Magnemite can have the abilities Magnet Pull or Sturdy."
    },
    {
        "id": 82,
        "name": "Magneton",
        "isNfe": true,
        "types": [
            "electric",
            "steel"
        ],
        "desc": "Magneton is the evolved form of Magnemite, an Electric/Steel type Pokemon. It has multiple magnets and electrical power. It's strong against Ice, Rock, Fairy, and Flying types but weak to Ground, Fire, and Fighting types. Magneton can have the abilities Magnet Pull or Sturdy."
    },
    {
        "id": 462,
        "name": "Magnezone",
        "types": [
            "electric",
            "steel"
        ],
        "desc": "Magnezone is the final evolution of Magneton, an Electric/Steel type Pokemon. It has a unique appearance with three magnets. It's strong against Ice, Rock, Fairy, and Flying types but weak to Ground, Fire, and Fighting types. Magnezone can have the abilities Magnet Pull or Sturdy."
    },
    {
        "id": 318,
        "name": "Carvanha",
        "isNfe": true,
        "types": [
            "water",
            "dark"
        ],
        "desc": "Carvanha is a Water/Dark type Pokemon known for its sharp teeth and aggressive nature. It's the first stage in its evolutionary line. It's strong against Fire, Water, Ice, Ghost, Dark, and Psychic types but weak to Electric, Fighting, Bug, and Fairy types. Carvanha can have the abilities Rough Skin or Speed Boost."
    },
    {
        "id": 319,
        "name": "Sharpedo",
        "types": [
            "water",
            "dark"
        ],
        "desc": "Sharpedo is the final evolution of Carvanha, a Water/Dark type Pokemon. It's a fast and powerful predator of the seas. It's strong against Fire, Water, Ice, Ghost, Dark, and Psychic types but weak to Electric, Fighting, Bug, and Fairy types. Sharpedo can have the abilities Rough Skin or Speed Boost."
    },
    {
        "id": 506,
        "name": "Lillipup",
        "isNfe": true,
        "types": [
            "normal"
        ],
        "desc": "Lillipup is a Normal type Pokemon known for its adorable appearance. It's the first stage in its evolutionary line. It's strong against Rock and Steel types but weak to Fighting types. Lillipup can have the abilities Vital Spirit or Pickup."
    },
    {
        "id": 507,
        "name": "Herdier",
        "isNfe": true,
        "types": [
            "normal"
        ],
        "desc": "Herdier is a Normal-type Pokemon and is the pre-evolved form of Stoutland."
    },
    {
        "id": 508,
        "name": "Stoutland",
        "types": [
            "normal"
        ],
        "desc": "Stoutland is a Normal-type Pokemon known for its keen senses and powerful appearance."
    },
    {
        "id": 128,
        "name": "Tauros",
        "types": [
            "normal"
        ],
        "desc": "Tauros is a Normal-type Pokemon known for its wild and aggressive nature."
    },
    {
        "id": 241,
        "name": "Miltank",
        "types": [
            "normal"
        ],
        "desc": "Miltank is a Normal-type Pokemon known for its milk production and nurturing qualities."
    },
    {
        "id": 123,
        "name": "Scyther",
        "isNfe": true,
        "types": [
            "bug",
            "flying"
        ],
        "desc": "Scyther is a Bug/Flying-type Pokemon and is the pre-evolved form of Scizor."
    },
    {
        "id": 212,
        "name": "Scizor",
        "types": [
            "bug",
            "steel"
        ],
        "desc": "Scizor is a Bug/Steel-type Pokemon known for its powerful and sleek appearance."
    },
    {
        "id": 127,
        "name": "Pinsir",
        "types": [
            "bug"
        ],
        "desc": "Pinsir is a Bug-type Pokemon known for its strong pincers and formidable appearance."
    },
    {
        "id": 214,
        "name": "Heracross",
        "types": [
            "bug",
            "fighting"
        ],
        "desc": "Heracross is a Bug/Fighting-type Pokemon known for its impressive horn and combat abilities."
    },
    {
        "id": 769,
        "name": "Sandygast",
        "isNfe": true,
        "types": [
            "ghost",
            "ground"
        ],
        "desc": "Sandygast is a Ghost/Ground-type Pokemon and is the pre-evolved form of Palossand."
    },
    {
        "id": 770,
        "name": "Palossand",
        "types": [
            "ghost",
            "ground"
        ],
        "desc": "Palossand is a Ghost/Ground-type Pokemon known for its sandcastle-like appearance and mysterious powers."
    },
    {
        "id": 298,
        "name": "Azurill",
        "isNfe": true,
        "types": [
            "normal",
            "fairy"
        ],
        "desc": "Azurill is a Normal/Fairy type Pokemon and is the pre-evolved form of Marill."
    },
    {
        "id": 183,
        "name": "Marill",
        "isNfe": true,
        "types": [
            "water",
            "fairy"
        ],
        "desc": "Marill is a Water/Fairy type Pokemon and is the pre-evolved form of Azumarill."
    },
    {
        "id": 184,
        "name": "Azumarill",
        "types": [
            "water",
            "fairy"
        ],
        "desc": "Azumarill is a Water/Fairy type Pokemon known for its round body and aquatic abilities."
    },
    {
        "id": 60,
        "name": "Poliwag",
        "isNfe": true,
        "types": [
            "water"
        ],
        "desc": "Poliwag is a Water type Pokemon and is the pre-evolved form of Poliwhirl."
    },
    {
        "id": 61,
        "name": "Poliwhirl",
        "isNfe": true,
        "types": [
            "water"
        ],
        "desc": "Poliwhirl is a Water type Pokemon and is the pre-evolved form of Poliwrath."
    },
    {
        "id": 62,
        "name": "Poliwrath",
        "types": [
            "water",
            "fighting"
        ],
        "desc": "Poliwrath is a Water/Fighting-type Pokemon known for its amphibious nature and martial arts skills."
    },
    {
        "id": 186,
        "name": "Politoed",
        "types": [
            "water"
        ],
        "desc": "Politoed is a Water type Pokemon known for its connection to rain and water-related abilities."
    },
    {
        "id": 54,
        "name": "Psyduck",
        "isNfe": true,
        "types": [
            "water"
        ],
        "desc": "Psyduck is a Water type Pokemon known for its chronic headaches and psychic potential."
    },
    {
        "id": 55,
        "name": "Golduck",
        "types": [
            "water"
        ],
        "desc": "Golduck is a Water type Pokemon known for its serene appearance and powerful psychic abilities."
    },
    {
        "id": 293,
        "name": "Whismur",
        "isNfe": true,
        "types": [
            "normal"
        ],
        "desc": "Whismur is a Normal type Pokemon known for its timid and quiet nature."
    },
    {
        "id": 294,
        "name": "Loudred",
        "isNfe": true,
        "types": [
            "normal"
        ],
        "desc": "Loudred is a Normal type Pokemon known for its loud vocalizations and imposing appearance."
    },
    {
        "id": 295,
        "name": "Exploud",
        "types": [
            "normal"
        ],
        "desc": "Exploud is a Normal type Pokemon known for its ear-splitting cries and formidable sound-based attacks."
    },
    {
        "id": 227,
        "name": "Skarmory",
        "types": [
            "steel",
            "flying"
        ],
        "desc": "Skarmory is a Steel/Flying-type Pokemon known for its steel feathers and swift flying abilities."
    },
    {
        "id": 744,
        "name": "Rockruff",
        "isNfe": true,
        "types": [
            "rock"
        ],
        "desc": "Rockruff is a Rock type Pokemon known for its rocky appearance and is the pre-evolved form of Lycanroc."
    },
    {
        "id": 745,
        "name": "Lycanroc",
        "types": [
            "rock"
        ],
        "desc": "Lycanroc is a Rock type Pokemon known for its wolf-like appearance. It has different forms: Dusk, Midday, and Midnight."
    },
    {
        "id": 619,
        "name": "Mienfoo",
        "isNfe": true,
        "types": [
            "fighting"
        ],
        "desc": "Mienfoo is a Fighting type Pokemon known for its martial arts skills and agility."
    },
    {
        "id": 620,
        "name": "Mienshao",
        "types": [
            "fighting"
        ],
        "desc": "Mienshao is a Fighting type Pokemon known for its graceful and powerful fighting techniques."
    },
    {
        "id": 27,
        "name": "Sandshrew",
        "isNfe": true,
        "types": [
            "ground"
        ],
        "forms": [
            {
                "name": "Sandshrew",
                "isNfe": true,
                "types": [
                    "ground"
                ]
            },
            {
                "name": "Sandshrew Alola",
                "isNfe": true,
                "types": [
                    "ice",
                    "steel"
                ],
                "spriteSuffix": "alola"
            }
        ],
        "desc": "Sandshrew is a Ground type Pokemon known for its burrowing abilities. It has two forms: Regular and Alola."
    },
    {
        "id": 28,
        "name": "Sandslash",
        "types": [
            "ground"
        ],
        "forms": [
            {
                "name": "Sandslash",
                "types": [
                    "ground"
                ]
            },
            {
                "name": "Sandslash Alola",
                "types": [
                    "ice",
                    "steel"
                ],
                "spriteSuffix": "alola"
            }
        ],
        "desc": "Sandslash is a Ground type Pokemon known for its sharp quills. It has two forms: Regular and Alola."
    },
    {
        "id": 104,
        "name": "Cubone",
        "isNfe": true,
        "types": [
            "ground"
        ],
        "desc": "Cubone is a Ground type Pokemon known for wearing the skull of its deceased mother. It is the pre-evolved form of Marowak."
    },
    {
        "id": 105,
        "name": "Marowak",
        "types": [
            "ground"
        ],
        "forms": [
            {
                "name": "Marowak",
                "types": [
                    "ground"
                ]
            },
            {
                "name": "Marowak Alola",
                "types": [
                    "fire",
                    "ghost"
                ],
                "spriteSuffix": "alola"
            }
        ],
        "desc": "Marowak is a Ground type Pokemon known for its loyalty and powerful attacks. It has two forms: Regular and Alola."
    },
    {
        "id": 115,
        "name": "Kangaskhan",
        "types": [
            "normal"
        ],
        "desc": "Kangaskhan is a Normal-type Pokemon known for its maternal and protective nature."
    },
    {
        "id": 551,
        "name": "Sandile",
        "isNfe": true,
        "types": [
            "ground",
            "dark"
        ],
        "desc": "Sandile is a Ground/Dark-type Pokemon and is the pre-evolved form of Krokorok."
    },
    {
        "id": 552,
        "name": "Krokorok",
        "isNfe": true,
        "types": [
            "ground",
            "dark"
        ],
        "desc": "Krokorok is a Ground/Dark-type Pokemon and is the pre-evolved form of Krookodile."
    },
    {
        "id": 553,
        "name": "Krookodile",
        "types": [
            "ground",
            "dark"
        ],
        "desc": "Krookodile is a Ground/Dark-type Pokemon known for its fierce appearance and powerful abilities."
    },
    {
        "id": 636,
        "name": "Larvesta",
        "isNfe": true,
        "types": [
            "bug",
            "fire"
        ],
        "desc": "Larvesta is a Bug/Fire-type Pokemon and is the pre-evolved form of Volcarona."
    },
    {
        "id": 637,
        "name": "Volcarona",
        "types": [
            "bug",
            "fire"
        ],
        "desc": "Volcarona is a Bug/Fire-type Pokemon known for its fiery and majestic appearance."
    },
    {
        "id": 690,
        "name": "Skrelp",
        "isNfe": true,
        "types": [
            "poison",
            "water"
        ],
        "desc": "Skrelp is a Poison/Water-type Pokemon and is the pre-evolved form of Dragalge."
    },
    {
        "id": 691,
        "name": "Dragalge",
        "types": [
            "poison",
            "dragon"
        ],
        "desc": "Dragalge is a Poison/Dragon-type Pokemon known for its unique appearance and poisonous abilities."
    },
    {
        "id": 692,
        "name": "Clauncher",
        "isNfe": true,
        "types": [
            "water"
        ],
        "desc": "Clauncher is a Water-type Pokemon known for its appearance and is the pre-evolved form of Clawitzer."
    },
    {
        "id": 693,
        "name": "Clawitzer",
        "types": [
            "water"
        ],
        "desc": "Clawitzer is a Water-type Pokemon known for its powerful water-based attacks."
    },
    {
        "id": 116,
        "name": "Horsea",
        "isNfe": true,
        "types": [
            "water"
        ],
        "desc": "Horsea is a Water-type Pokemon and is the pre-evolved form of Seadra."
    },
    {
        "id": 117,
        "name": "Seadra",
        "isNfe": true,
        "types": [
            "water"
        ],
        "desc": "Seadra is a Water-type Pokemon known for its aquatic abilities and is the pre-evolved form of Kingdra."
    },
    {
        "id": 230,
        "name": "Kingdra",
        "types": [
            "water",
            "dragon"
        ],
        "desc": "Kingdra is a Water/Dragon-type Pokemon known for its regal appearance and control over water."
    },
    {
        "id": 548,
        "name": "Petilil",
        "isNfe": true,
        "types": [
            "grass"
        ],
        "desc": "Petilil is a Grass-type Pokemon and is the pre-evolved form of Lilligant."
    },
    {
        "id": 549,
        "name": "Lilligant",
        "types": [
            "grass"
        ],
        "desc": "Lilligant is a Grass-type Pokemon known for its elegant appearance and graceful dancing."
    },
    {
        "id": 102,
        "name": "Exeggcute",
        "isNfe": true,
        "types": [
            "grass",
            "psychic"
        ],
        "desc": "Exeggcute is a Grass/Psychic-type Pokemon known for its unusual appearance and psychic abilities."
    },
    {
        "id": 103,
        "name": "Exeggutor",
        "types": [
            "grass",
            "psychic"
        ],
        "forms": [
            {
                "name": "Exeggutor",
                "types": [
                    "grass",
                    "psychic"
                ]
            },
            {
                "name": "Exeggutor Alola",
                "types": [
                    "grass",
                    "dragon"
                ],
                "spriteSuffix": "alola"
            }
        ],
        "desc": "Exeggutor is a Grass/Psychic-type Pokemon known for its tall stature. It has two forms: Regular and Alola."
    },
    {
        "id": 137,
        "name": "Porygon",
        "isNfe": true,
        "types": [
            "normal"
        ],
        "desc": "Porygon is a Normal-type Pokemon known for its digital and artificial nature."
    },
    {
        "id": 233,
        "name": "Porygon2",
        "isNfe": true,
        "types": [
            "normal"
        ],
        "desc": "Porygon2 is a Normal-type Pokemon and is the pre-evolved form of Porygon-Z."
    },
    {
        "id": 474,
        "name": "Porygon-Z",
        "types": [
            "normal"
        ],
        "desc": "Porygon-Z is a Normal-type Pokemon known for its glitchy and unpredictable behavior."
    },
    {
        "id": 29,
        "name": "Nidoran ",
        "isNfe": true,
        "types": [
            "poison"
        ],
        "desc": "Nidoran  is a Poison-type Pokemon and is the pre-evolved form of Nidorina."
    },
    {
        "id": 30,
        "name": "Nidorina",
        "isNfe": true,
        "types": [
            "poison"
        ],
        "desc": "Nidorina is a Poison-type Pokemon and is the pre-evolved form of Nidoqueen."
    },
    {
        "id": 31,
        "name": "Nidoqueen",
        "types": [
            "poison",
            "ground"
        ],
        "desc": "Nidoqueen is a Poison/Ground-type Pokemon known for its regal appearance and powerful abilities."
    },
    {
        "id": 32,
        "name": "Nidoran ",
        "isNfe": true,
        "types": [
            "poison"
        ],
        "desc": "Nidoran  is a Poison-type Pokemon and is the pre-evolved form of Nidorino."
    },
    {
        "id": 33,
        "name": "Nidorino",
        "isNfe": true,
        "types": [
            "poison"
        ],
        "desc": "Nidorino is a Poison-type Pokemon and is the pre-evolved form of Nidoking."
    },
    {
        "id": 34,
        "name": "Nidoking",
        "types": [
            "poison",
            "ground"
        ],
        "desc": "Nidoking is a Poison/Ground-type Pokemon known for its powerful and imposing presence."
    },
    {
        "id": 41,
        "name": "Zubat",
        "isNfe": true,
        "types": [
            "poison",
            "flying"
        ],
        "desc": "Zubat is a Poison/Flying-type Pokemon and is the pre-evolved form of Golbat."
    },
    {
        "id": 42,
        "name": "Golbat",
        "isNfe": true,
        "types": [
            "poison",
            "flying"
        ],
        "desc": "Golbat is a Poison/Flying-type Pokemon known for its intimidating appearance and supersonic abilities."
    },
    {
        "id": 125,
        "name": "Electabuzz",
        "isNfe": true,
        "types": [
            "electric"
        ],
        "desc": "Electabuzz is an Electric-type Pokemon known for its electrical powers. It is the pre-evolved form of Electivire."
    },
    {
        "id": 126,
        "name": "Magmar",
        "isNfe": true,
        "types": [
            "fire"
        ],
        "desc": "Magmar is a Fire-type Pokemon known for its fiery appearance and scorching abilities."
    },
    {
        "id": 147,
        "name": "Dratini",
        "isNfe": true,
        "types": [
            "dragon"
        ],
        "desc": "Dratini is a Dragon-type Pokemon and is the pre-evolved form of Dragonair."
    },
    {
        "id": 148,
        "name": "Dragonair",
        "isNfe": true,
        "types": [
            "dragon"
        ],
        "desc": "Dragonair is a Dragon-type Pokemon and is the pre-evolved form of Dragonite."
    },
    {
        "id": 149,
        "name": "Dragonite",
        "types": [
            "dragon",
            "flying"
        ],
        "desc": "Dragonite is a Dragon/Flying-type Pokemon known for its majestic and powerful presence."
    },
    {
        "id": 169,
        "name": "Crobat",
        "types": [
            "poison",
            "flying"
        ],
        "desc": "Crobat is a Poison/Flying-type Pokemon known for its speed and agility in flight."
    },
    {
        "id": 239,
        "name": "Elekid",
        "isNfe": true,
        "types": [
            "electric"
        ],
        "desc": "Elekid is an Electric-type Pokemon and is the pre-evolved form of Electabuzz."
    },
    {
        "id": 240,
        "name": "Magby",
        "isNfe": true,
        "types": [
            "fire"
        ],
        "desc": "Magby is a Fire-type Pokemon and is the pre-evolved form of Magmar."
    },
    {
        "id": 304,
        "name": "Aron",
        "isNfe": true,
        "types": [
            "steel",
            "rock"
        ],
        "desc": "Aron is a Steel/Rock-type Pokemon and is the pre-evolved form of Lairon."
    },
    {
        "id": 305,
        "name": "Lairon",
        "isNfe": true,
        "types": [
            "steel",
            "rock"
        ],
        "desc": "Lairon is a Steel/Rock-type Pokemon and is the pre-evolved form of Aggron."
    },
    {
        "id": 306,
        "name": "Aggron",
        "types": [
            "steel",
            "rock"
        ],
        "desc": "Aggron is a Steel/Rock-type Pokemon known for its incredible defensive capabilities."
    },
    {
        "id": 333,
        "name": "Swablu",
        "isNfe": true,
        "types": [
            "normal",
            "flying"
        ],
        "desc": "Swablu is a Normal/Flying-type Pokemon and is the pre-evolved form of Altaria."
    },
    {
        "id": 334,
        "name": "Altaria",
        "types": [
            "dragon",
            "flying"
        ],
        "desc": "Altaria is a Dragon/Flying-type Pokemon known for its graceful appearance and singing abilities."
    },
    {
        "id": 345,
        "name": "Lileep",
        "isNfe": true,
        "types": [
            "rock",
            "grass"
        ],
        "desc": "Lileep is a Rock/Grass-type Pokemon and is the pre-evolved form of Cradily."
    },
    {
        "id": 346,
        "name": "Cradily",
        "types": [
            "rock",
            "grass"
        ],
        "desc": "Cradily is a Rock/Grass-type Pokemon known for its plant-like features and regenerative abilities."
    },
    {
        "id": 359,
        "name": "Absol",
        "types": [
            "dark"
        ],
        "desc": "Absol is a Dark-type Pokemon known for its ability to sense disasters and its striking appearance."
    },
    {
        "id": 363,
        "name": "Spheal",
        "isNfe": true,
        "types": [
            "ice",
            "water"
        ],
        "desc": "Spheal is an Ice/Water-type Pokemon and is the pre-evolved form of Sealeo."
    },
    {
        "id": 364,
        "name": "Sealeo",
        "isNfe": true,
        "types": [
            "ice",
            "water"
        ],
        "desc": "Sealeo is an Ice/Water-type Pokemon and is the pre-evolved form of Walrein."
    },
    {
        "id": 365,
        "name": "Walrein",
        "types": [
            "ice",
            "water"
        ],
        "desc": "Walrein is an Ice/Water-type Pokemon known for its blubber and resilience."
    },
    {
        "id": 369,
        "name": "Relicanth",
        "types": [
            "water",
            "rock"
        ],
        "desc": "Relicanth is a Water/Rock-type Pokemon known for its ancient lineage and tough scales."
    },
    {
        "id": 374,
        "name": "Beldum",
        "isNfe": true,
        "types": [
            "steel",
            "psychic"
        ],
        "desc": "Beldum is a Steel/Psychic-type Pokemon and is the pre-evolved form of Metang."
    },
    {
        "id": 375,
        "name": "Metang",
        "isNfe": true,
        "types": [
            "steel",
            "psychic"
        ],
        "desc": "Metang is a Steel/Psychic-type Pokemon and is the pre-evolved form of Metagross."
    },
    {
        "id": 376,
        "name": "Metagross",
        "types": [
            "steel",
            "psychic"
        ],
        "desc": "Metagross is a Steel/Psychic-type Pokemon known for its high intelligence and powerful abilities."
    },
    {
        "id": 443,
        "name": "Gible",
        "isNfe": true,
        "types": [
            "dragon",
            "ground"
        ],
        "desc": "Gible is a Dragon/Ground-type Pokemon and is the pre-evolved form of Gabite."
    },
    {
        "id": 444,
        "name": "Gabite",
        "isNfe": true,
        "types": [
            "dragon",
            "ground"
        ],
        "desc": "Gabite is a Dragon/Ground-type Pokemon and is the pre-evolved form of Garchomp."
    },
    {
        "id": 445,
        "name": "Garchomp",
        "types": [
            "dragon",
            "ground"
        ],
        "desc": "Garchomp is a Dragon/Ground-type Pokemon known for its powerful and fearsome appearance."
    },
    {
        "id": 466,
        "name": "Electivire",
        "types": [
            "electric"
        ],
        "desc": "Electivire is an Electric-type Pokemon known for its electrifying abilities."
    },
    {
        "id": 467,
        "name": "Magmortar",
        "types": [
            "fire"
        ],
        "desc": "Magmortar is a Fire-type Pokemon known for its fiery artillery-like attacks."
    },
    {
        "id": 531,
        "name": "Audino",
        "types": [
            "normal"
        ],
        "desc": "Audino is a Normal-type Pokemon known for its healing abilities and kind demeanor."
    },
    {
        "id": 615,
        "name": "Cryogonal",
        "types": [
            "ice"
        ],
        "desc": "Cryogonal is an Ice-type Pokemon known for its icy and geometric appearance."
    },
    {
        "id": 696,
        "name": "Tyrunt",
        "isNfe": true,
        "types": [
            "rock",
            "dragon"
        ],
        "desc": "Tyrunt is a Rock/Dragon-type Pokemon and is the pre-evolved form of Tyrantrum."
    },
    {
        "id": 697,
        "name": "Tyrantrum",
        "types": [
            "rock",
            "dragon"
        ],
        "desc": "Tyrantrum is a Rock/Dragon-type Pokemon known for its kingly appearance and fierce nature."
    },
    {
        "id": 698,
        "name": "Amaura",
        "isNfe": true,
        "types": [
            "rock",
            "ice"
        ],
        "desc": "Amaura is a Rock/Ice-type Pokemon and is the pre-evolved form of Aurorus."
    },
    {
        "id": 699,
        "name": "Aurorus",
        "types": [
            "rock",
            "ice"
        ],
        "desc": "Aurorus is a Rock/Ice-type Pokemon known for its majestic and ancient presence."
    },
    {
        "id": 703,
        "name": "Carbink",
        "types": [
            "rock",
            "fairy"
        ],
        "desc": "Carbink is a Rock/Fairy-type Pokemon known for its crystalline appearance and defensive capabilities."
    },
    {
        "id": 243,
        "name": "Raikou",
        "types": [
            "electric"
        ],
        "isLegendary": true,
        "desc": "Raikou is a Legendary Electric-type Pokemon known for its lightning-fast speed and electric abilities."
    },
    {
        "id": 244,
        "name": "Entei",
        "types": [
            "fire"
        ],
        "isLegendary": true,
        "desc": "Entei is a Legendary Fire-type Pokemon known for its fiery presence and powerful flames."
    },
    {
        "id": 245,
        "name": "Suicune",
        "types": [
            "water"
        ],
        "isLegendary": true,
        "desc": "Suicune is a Legendary Water-type Pokemon known for its graceful appearance and purifying abilities."
    },
    {
        "id": 249,
        "name": "Lugia",
        "types": [
            "psychic",
            "flying"
        ],
        "isLegendary": true,
        "desc": "Lugia is a Legendary Psychic/Flying-type Pokemon known for its role as a guardian of the sea."
    },
    {
        "id": 250,
        "name": "Ho-oh",
        "types": [
            "fire",
            "flying"
        ],
        "isLegendary": true,
        "desc": "Ho-oh is a Legendary Fire/Flying-type Pokemon known for its association with the rainbow and eternal life."
    },
    {
        "id": 377,
        "name": "Regirock",
        "types": [
            "rock"
        ],
        "isLegendary": true,
        "desc": "Regirock is a Legendary Rock-type Pokemon known for its incredibly durable and rocky body."
    },
    {
        "id": 378,
        "name": "Regice",
        "types": [
            "ice"
        ],
        "isLegendary": true,
        "desc": "Regice is a Legendary Ice-type Pokemon known for its ability to freeze anything with its icy aura."
    },
    {
        "id": 379,
        "name": "Registeel",
        "types": [
            "steel"
        ],
        "isLegendary": true,
        "desc": "Registeel is a Legendary Steel-type Pokemon known for its extremely sturdy and metallic body."
    },
    {
        "id": 380,
        "name": "Latias",
        "types": [
            "dragon",
            "psychic"
        ],
        "isLegendary": true,
        "desc": "Latias is a Legendary Dragon/Psychic-type Pokemon known for its caring and protective nature."
    },
    {
        "id": 381,
        "name": "Latios",
        "types": [
            "dragon",
            "psychic"
        ],
        "isLegendary": true,
        "desc": "Latios is a Legendary Dragon/Psychic-type Pokemon known for its intelligence and agility."
    },
    {
        "id": 382,
        "name": "Kyogre",
        "types": [
            "water"
        ],
        "isLegendary": true,
        "forms": [
            {
                "name": "Kyogre",
                "types": [
                    "water"
                ]
            },
            {
                "name": "Kyogre Primal",
                "types": [
                    "water"
                ],
                "spriteSuffix": "primal"
            }
        ],
        "desc": "Kyogre is a Legendary Water-type Pokemon known for its control over the sea. It has a Primal form that enhances its power."
    },
    {
        "id": 383,
        "name": "Groudon",
        "types": [
            "ground"
        ],
        "isLegendary": true,
        "forms": [
            {
                "name": "Groudon",
                "types": [
                    "ground"
                ]
            },
            {
                "name": "Groudon Primal",
                "types": [
                    "ground",
                    "fire"
                ],
                "spriteSuffix": "primal"
            }
        ],
        "desc": "Groudon is a Legendary Ground-type Pokemon known for its ability to shape the earth. It has a Primal form that intensifies its power."
    },
    {
        "id": 384,
        "name": "Rayquaza",
        "types": [
            "dragon",
            "flying"
        ],
        "isLegendary": true,
        "desc": "Rayquaza is a Legendary Dragon/Flying-type Pokemon known for its mastery over the skies and its role in balancing Kyogre and Groudon."
    },
    {
        "id": 480,
        "name": "Uxie",
        "types": [
            "psychic"
        ],
        "isLegendary": true,
        "desc": "Uxie is a Legendary Psychic-type Pokemon known for its ability to represent knowledge and memory."
    },
    {
        "id": 481,
        "name": "Mesprit",
        "types": [
            "psychic"
        ],
        "isLegendary": true,
        "desc": "Mesprit is a Legendary Psychic-type Pokemon known for its ability to represent emotion and willpower."
    },
    {
        "id": 482,
        "name": "Azelf",
        "types": [
            "psychic"
        ],
        "isLegendary": true,
        "desc": "Azelf is a Legendary Psychic-type Pokemon known for its ability to represent willpower and determination."
    },
    {
        "id": 483,
        "name": "Dialga",
        "types": [
            "steel",
            "dragon"
        ],
        "isLegendary": true,
        "desc": "Dialga is a Legendary Steel/Dragon-type Pokemon known for its control over time and its diamond-like body."
    },
    {
        "id": 484,
        "name": "Palkia",
        "types": [
            "water",
            "dragon"
        ],
        "isLegendary": true,
        "desc": "Palkia is a Legendary Water/Dragon-type Pokemon known for its control over space and its spatial abilities."
    },
    {
        "id": 485,
        "name": "Heatran",
        "types": [
            "fire",
            "steel"
        ],
        "isLegendary": true,
        "desc": "Heatran is a Legendary Fire/Steel-type Pokemon known for its association with volcanoes and its molten appearance."
    },
    {
        "id": 486,
        "name": "Regigigas",
        "types": [
            "normal"
        ],
        "isLegendary": true,
        "desc": "Regigigas is a Legendary Normal-type Pokemon known for its incredible strength and its role as the master of the Regis."
    },
    {
        "id": 487,
        "name": "Giratina",
        "types": [
            "ghost",
            "dragon"
        ],
        "forms": [
            {
                "name": "Giratina",
                "types": [
                    "ghost",
                    "dragon"
                ]
            },
            {
                "name": "Giratina Origin",
                "types": [
                    "ghost",
                    "dragon"
                ],
                "spriteSuffix": "origin"
            }
        ],
        "isLegendary": true,
        "desc": "Giratina is a Legendary Ghost/Dragon-type Pokemon known for its connection to the Distortion World. It has an Origin form with altered stats."
    },
    {
        "id": 488,
        "name": "Cresselia",
        "types": [
            "psychic"
        ],
        "isLegendary": true,
        "desc": "Cresselia is a Legendary Psychic-type Pokemon known for its lunar associations and its ability to bring pleasant dreams."
    },
    {
        "id": 641,
        "name": "Tornadus",
        "types": [
            "flying"
        ],
        "forms": [
            {
                "name": "Tornadus",
                "types": [
                    "flying"
                ]
            },
            {
                "name": "Tornadus Therian",
                "types": [
                    "flying"
                ],
                "spriteSuffix": "therian"
            }
        ],
        "isLegendary": true,
        "desc": "Tornadus is a Legendary Flying-type Pokemon with a Therian form that has altered stats and appearance."
    },
    {
        "id": 642,
        "name": "Thundurus",
        "types": [
            "electric",
            "flying"
        ],
        "forms": [
            {
                "name": "Thundurus",
                "types": [
                    "electric",
                    "flying"
                ]
            },
            {
                "name": "Thundurus Therian",
                "types": [
                    "electric",
                    "flying"
                ],
                "spriteSuffix": "therian"
            }
        ],
        "isLegendary": true,
        "desc": "Thundurus is a Legendary Electric/Flying-type Pokemon with a Therian form that has altered stats and appearance."
    },
    {
        "id": 645,
        "name": "Landorus",
        "types": [
            "ground",
            "flying"
        ],
        "forms": [
            {
                "name": "Landorus",
                "types": [
                    "ground",
                    "flying"
                ]
            },
            {
                "name": "Landorus Therian",
                "types": [
                    "ground",
                    "flying"
                ],
                "spriteSuffix": "therian"
            }
        ],
        "isLegendary": true,
        "desc": "Landorus is a Legendary Ground/Flying-type Pokemon with a Therian form that has altered stats and appearance."
    },
    {
        "id": 716,
        "name": "Xerneas",
        "types": [
            "fairy"
        ],
        "forms": [
            {
                "name": "Xerneas",
                "types": [
                    "fairy"
                ]
            },
            {
                "name": "Xerneas",
                "types": [
                    "fairy"
                ],
                "spriteSuffix": "neutral"
            }
        ],
        "isLegendary": true,
        "desc": "Xerneas is a Legendary Fairy-type Pokemon known for its control over life energy and its Neutral form that retains its stats."
    },
    {
        "id": 717,
        "name": "Yveltal",
        "types": [
            "dark",
            "flying"
        ],
        "isLegendary": true,
        "desc": "Yveltal is a Legendary Dark/Flying-type Pokemon known for its power to absorb life energy and its association with destruction."
    },
    {
        "id": 718,
        "name": "Zygarde",
        "types": [
            "dragon",
            "ground"
        ],
        "forms": [
            {
                "name": "Zygarde Complete",
                "types": [
                    "dragon",
                    "ground"
                ],
                "spriteSuffix": "complete"
            },
            {
                "name": "Zygarde 10%",
                "types": [
                    "dragon",
                    "ground"
                ],
                "spriteSuffix": "10"
            },
            {
                "name": "Zygarde",
                "types": [
                    "dragon",
                    "ground"
                ]
            }
        ],
        "isLegendary": true,
        "desc": "Zygarde is a Legendary Dragon/Ground-type Pokemon known for its role in maintaining balance and its different forms with altered stats."
    },
    {
        "id": 785,
        "name": "Tapu Koko",
        "types": [
            "electric",
            "fairy"
        ],
        "isLegendary": true,
        "desc": "Tapu Koko is a Legendary Electric/Fairy-type Pokemon known as the guardian deity of Melemele Island."
    },
    {
        "id": 786,
        "name": "Tapu Lele",
        "types": [
            "psychic",
            "fairy"
        ],
        "isLegendary": true,
        "desc": "Tapu Lele is a Legendary Psychic/Fairy-type Pokemon known as the guardian deity of Akala Island."
    },
    {
        "id": 787,
        "name": "Tapu Bulu",
        "types": [
            "grass",
            "fairy"
        ],
        "isLegendary": true,
        "desc": "Tapu Bulu is a Legendary Grass/Fairy-type Pokemon known as the guardian deity of Ula'ula Island."
    },
    {
        "id": 788,
        "name": "Tapu Fini",
        "types": [
            "water",
            "fairy"
        ],
        "isLegendary": true,
        "desc": "Tapu Fini is a Legendary Water/Fairy-type Pokemon known as the guardian deity of Poni Island."
    },
    {
        "id": 124,
        "name": "Jynx",
        "types": [
            "ice",
            "psychic"
        ],
        "desc": "Jynx is an Ice/Psychic-type Pokemon known for its graceful and dance-like movements."
    },
    {
        "id": 138,
        "name": "Omanyte",
        "isNfe": true,
        "types": [
            "rock",
            "water"
        ],
        "desc": "Omanyte is a Rock/Water-type Pokemon that resembles a prehistoric marine creature."
    },
    {
        "id": 139,
        "name": "Omastar",
        "types": [
            "rock",
            "water"
        ],
        "desc": "Omastar is a Rock/Water-type Pokemon that evolved from Omanyte and is known for its coiled shell."
    },
    {
        "id": 140,
        "name": "Kabuto",
        "isNfe": true,
        "types": [
            "rock",
            "water"
        ],
        "desc": "Kabuto is a Rock/Water-type Pokemon resembling a prehistoric arthropod."
    },
    {
        "id": 141,
        "name": "Kabutops",
        "types": [
            "rock",
            "water"
        ],
        "desc": "Kabutops is a Rock/Water-type Pokemon known for its scythes and its evolution from Kabuto."
    },
    {
        "id": 142,
        "name": "Aerodactyl",
        "types": [
            "rock",
            "flying"
        ],
        "desc": "Aerodactyl is a Rock/Flying-type Pokemon known for its ancient origins as a prehistoric flying reptile."
    },
    {
        "id": 238,
        "name": "Smoochum",
        "isNfe": true,
        "types": [
            "ice",
            "psychic"
        ],
        "desc": "Smoochum is an Ice/Psychic-type Baby Pokemon with a charming appearance."
    },
    {
        "id": 252,
        "name": "Treecko",
        "isNfe": true,
        "types": [
            "grass"
        ],
        "desc": "Treecko is a Grass-type Pokemon known for its agility and tree-dwelling habits."
    },
    {
        "id": 253,
        "name": "Grovyle",
        "isNfe": true,
        "types": [
            "grass"
        ],
        "desc": "Grovyle is a Grass-type Pokemon known for its speed and its role as the middle evolution of Treecko."
    },
    {
        "id": 254,
        "name": "Sceptile",
        "types": [
            "grass"
        ],
        "desc": "Sceptile is a Grass-type Pokemon known for its leafy tail and its final evolution from Treecko."
    },
    {
        "id": 255,
        "name": "Torchic",
        "isNfe": true,
        "types": [
            "fire"
        ],
        "desc": "Torchic is a Fire-type Pokemon known for its fiery enthusiasm and its role as a starting Pokemon in the Hoenn region."
    },
    {
        "id": 256,
        "name": "Combusken",
        "isNfe": true,
        "types": [
            "fire",
            "fighting"
        ],
        "desc": "Combusken is a Fire/Fighting-type Pokemon known for its martial arts skills and its middle evolution from Torchic."
    },
    {
        "id": 257,
        "name": "Blaziken",
        "types": [
            "fire",
            "fighting"
        ],
        "desc": "Blaziken is a Fire/Fighting-type Pokemon known for its powerful kicks and its final evolution from Torchic."
    },
    {
        "id": 258,
        "name": "Mudkip",
        "isNfe": true,
        "types": [
            "water"
        ],
        "desc": "Mudkip is a Water-type Pokemon known for its love of water and its role as a starting Pokemon in the Hoenn region."
    },
    {
        "id": 259,
        "name": "Marshtomp",
        "isNfe": true,
        "types": [
            "water",
            "ground"
        ],
        "desc": "Marshtomp is a Water/Ground-type Pokemon known for its amphibious nature and its middle evolution from Mudkip."
    },
    {
        "id": 260,
        "name": "Swampert",
        "types": [
            "water",
            "ground"
        ],
        "desc": "Swampert is a Water/Ground-type Pokemon known for its powerful combination of water and ground abilities and its final evolution from Mudkip."
    },
    {
        "id": 347,
        "name": "Anorith",
        "isNfe": true,
        "types": [
            "rock",
            "bug"
        ],
        "desc": "Anorith is a Rock/Bug-type Pokemon known for its ancient origins as a prehistoric arthropod."
    },
    {
        "id": 348,
        "name": "Armaldo",
        "types": [
            "rock",
            "bug"
        ],
        "desc": "Armaldo is a Rock/Bug-type Pokemon known for its powerful claws and its final evolution from Anorith."
    },
    {
        "id": 371,
        "name": "Bagon",
        "isNfe": true,
        "types": [
            "dragon"
        ],
        "desc": "Bagon is a Dragon-type Pokemon known for its strong desire to fly and its aspirations of evolving into Salamence."
    },
    {
        "id": 372,
        "name": "Shelgon",
        "isNfe": true,
        "types": [
            "dragon"
        ],
        "desc": "Shelgon is a Dragon-type Pokemon known for its sturdy shell and its middle evolution from Bagon."
    },
    {
        "id": 373,
        "name": "Salamence",
        "types": [
            "dragon",
            "flying"
        ],
        "desc": "Salamence is a Dragon/Flying-type Pokemon known for its powerful flight and its final evolution from Bagon."
    },
    {
        "id": 442,
        "name": "Spiritomb",
        "types": [
            "ghost",
            "dark"
        ],
        "desc": "Spiritomb is a Ghost/Dark-type Pokemon known for its mysterious and enigmatic nature."
    },
    {
        "id": 494,
        "name": "Victini",
        "types": [
            "psychic",
            "fire"
        ],
        "isLegendary": true,
        "desc": "Victini is a Legendary Psychic/Fire-type Pokemon known for bringing victory and success to its trainer."
    },
    {
        "id": 564,
        "name": "Tirtouga",
        "isNfe": true,
        "types": [
            "water",
            "rock"
        ],
        "desc": "Tirtouga is a Water/Rock-type Pokemon known for its fossil origins and its prehistoric appearance."
    },
    {
        "id": 565,
        "name": "Carracosta",
        "types": [
            "water",
            "rock"
        ],
        "desc": "Carracosta is a Water/Rock-type Pokemon known for its powerful shell and its evolution from Tirtouga."
    },
    {
        "id": 566,
        "name": "Archen",
        "isNfe": true,
        "types": [
            "rock",
            "flying"
        ],
        "desc": "Archen is a Rock/Flying-type Pokemon known for its fossil origins and its prehistoric appearance."
    },
    {
        "id": 567,
        "name": "Archeops",
        "types": [
            "rock",
            "flying"
        ],
        "desc": "Archeops is a Rock/Flying-type Pokemon known for its powerful flight and its evolution from Archen."
    },
    {
        "id": 649,
        "name": "Genesect",
        "types": [
            "bug",
            "steel"
        ],
        "forms": [
            {
                "name": "Genesect",
                "types": [
                    "bug",
                    "steel"
                ]
            },
            {
                "name": "Genesect",
                "types": [
                    "bug",
                    "steel"
                ],
                "spriteSuffix": "burn"
            },
            {
                "name": "Genesect",
                "types": [
                    "bug",
                    "steel"
                ],
                "spriteSuffix": "chill"
            },
            {
                "name": "Genesect",
                "types": [
                    "bug",
                    "steel"
                ],
                "spriteSuffix": "douse"
            },
            {
                "name": "Genesect",
                "types": [
                    "bug",
                    "steel"
                ],
                "spriteSuffix": "shock"
            }
        ],
        "isLegendary": true,
        "desc": "Genesect is a Legendary Bug/Steel-type Pokemon known for its technological enhancements and adaptability."
    },
    {
        "id": 719,
        "name": "Diancie",
        "types": [
            "rock",
            "fairy"
        ],
        "isLegendary": true,
        "desc": "Diancie is a Legendary Rock/Fairy-type Pokemon known for its dazzling appearance and its ability to create diamonds."
    },
    {
        "id": 721,
        "name": "Volcanion",
        "types": [
            "fire",
            "water"
        ],
        "isLegendary": true,
        "desc": "Volcanion is a Legendary Fire/Water-type Pokemon known for its steam-based abilities and its rarity."
    },
    {
        "id": 793,
        "name": "Nihilego",
        "types": [
            "rock",
            "poison"
        ],
        "desc": "Nihilego is a Rock/Poison-type Ultra Beast known for its otherworldly and mysterious nature."
    },
    {
        "id": 794,
        "name": "Buzzwole",
        "types": [
            "bug",
            "fighting"
        ],
        "desc": "Buzzwole is a Bug/Fighting-type Ultra Beast known for its incredible strength and physique."
    },
    {
        "id": 795,
        "name": "Pheromosa",
        "types": [
            "bug",
            "fighting"
        ],
        "desc": "Pheromosa is a Bug/Fighting-type Ultra Beast known for its incredible speed and agility."
    },
    {
        "id": 796,
        "name": "Xurkitree",
        "types": [
            "electric"
        ],
        "desc": "Xurkitree is an Electric-type Ultra Beast known for its electrifying appearance and unique design."
    },
    {
        "id": 797,
        "name": "Celesteela",
        "types": [
            "steel",
            "flying"
        ],
        "desc": "Celesteela is a Steel/Flying-type Ultra Beast known for its towering and rocket-like form."
    },
    {
        "id": 798,
        "name": "Kartana",
        "types": [
            "grass",
            "steel"
        ],
        "desc": "Kartana is a Grass/Steel-type Ultra Beast known for its paper-thin body and sharp edges."
    },
    {
        "id": 799,
        "name": "Guzzlord",
        "types": [
            "dark",
            "dragon"
        ],
        "desc": "Guzzlord is a Dark/Dragon-type Ultra Beast known for its insatiable appetite and fearsome appearance."
    },
    {
        "id": 803,
        "name": "Poipole",
        "isNfe": true,
        "types": [
            "poison"
        ],
        "desc": "Poipole is a Poison-type Ultra Beast known for its unique and otherworldly appearance."
    },
    {
        "id": 804,
        "name": "Naganadel",
        "types": [
            "poison",
            "dragon"
        ],
        "desc": "Naganadel is a Poison/Dragon-type Ultra Beast known for its sleek design and powerful stinger."
    },
    {
        "id": 805,
        "name": "Stakataka",
        "types": [
            "rock",
            "steel"
        ],
        "desc": "Stakataka is a Rock/Steel-type Ultra Beast known for its blocky and fortress-like structure."
    },
    {
        "id": 806,
        "name": "Blacephalon",
        "types": [
            "fire",
            "ghost"
        ],
        "desc": "Blacephalon is a Fire/Ghost-type Ultra Beast known for its explosive and theatrical nature."
    }
]